<pad>	0
<unk>	0
<s>	0
</s>	0
▁የ	-0
▁በ	-1
▁አ	-2
▁እ	-3
▁መ	-4
▁ተ	-5
▁ከ	-6
▁እን	-7
▁ለ	-8
ል።	-9
ቸው	-10
▁ወ	-11
▁ነ	-12
▁ይ	-13
ዎች	-14
▁ማ	-15
ላይ	-16
▁ስ	-17
▁ያ	-18
▁የሚ	-19
▁እና	-20
▁ሰ	-21
▁ም	-22
▁ብ	-23
▁የተ	-24
▁ሲ	-25
▁ላይ	-26
▁እንደ	-27
፡፡	-28
▁ባ	-29
▁ው	-30
▁ግ	-31
▁አስ	-32
▁ክ	-33
ነት	-34
▁ነው	-35
ደረ	-36
▁በመ	-37
ዋል።	-38
ስት	-39
▁ገ	-40
ውን	-41
ችን	-42
▁ት	-43
▁እንዲ	-44
▁1	-45
▁ቀ	-46
▁ጥ	-47
▁የአ	-48
ደር	-49
▁በተ	-50
ንግ	-51
▁በአ	-52
▁"	-53
▁ቤ	-54
▁ሚ	-55
ኢት	-56
▁2	-57
▁ድ	-58
ኢትዮ	-59
ል፡፡	-60
ንድ	-61
▁የመ	-62
▁ጋ	-63
▁ዓ	-64
ሪያ	-65
ሆን	-66
ሆኑ	-67
ጵያ	-68
▁ህ	-69
ኢትዮጵያ	-70
በት	-71
..	-72
▁ደ	-73
ቸውን	-74
▁ወደ	-75
ለው	-76
▁ከተ	-77
ርት	-78
▁ሊ	-79
ራት	-80
ተኛ	-81
ቶች	-82
▁ሀ	-83
▁ሁ	-84
▁ለመ	-85
በር	-86
▁ጉ	-87
▁ል	-88
ሆነ	-89
▁እየ	-90
ለት	-91
▁ጋር	-92
ማሪ	-93
▁-	-94
ንት	-95
ገር	-96
ስጥ	-97
▁ታ	-98
▁ሳ	-99
▁በማ	-100
▁ለማ	-101
▁እንደሚ	-102
ስተ	-103
▁ኮ	-104
ዚህ	-105
00	-106
▁ዘ	-107
▁ካ	-108
ለም	-109
▁ውስጥ	-110
ድር	-111
ገል	-112
ጨዋ	-113
▁ቢ	-114
▁ጠ	-115
▁ባለ	-116
▁ፍ	-117
▁ዋ	-118
▁ዩ	-119
ቨር	-120
ራዊ	-121
ረት	-122
ምህ	-123
በረ	-124
ዲስ	-125
▁(	-126
▁እስ	-127
▁ፈ	-128
ድረ	-129
01	-130
▁የማ	-131
▁ጉዳ	-132
▁በሚ	-133
▁አካ	-134
▁ፕ	-135
▁ከተማ	-136
ቱን	-137
▁እንዳ	-138
ጊዜ	-139
▁አን	-140
መት	-141
▁ሰዎች	-142
▁ግን	-143
▁የም	-144
▁አይ	-145
ሁን	-146
▁ምክ	-147
▁የሚያ	-148
▁።	-149
ገባ	-150
▁ኢ	-151
ንስ	-152
▁መስ	-153
ሎች	-154
ትን	-155
ሪካ	-156
▁መሆኑ	-157
▁አል	-158
ታወ	-159
▁፣	-160
▁ገል	-161
ዛሬ	-162
▁3	-163
▁ሲሆን	-164
ሰብ	-165
ምህርት	-166
▁ቤት	-167
▁ክል	-168
ዋል	-169
▁ች	-170
▁አስተ	-171
ጀመ	-172
ጨዋታ	-173
ረጃ	-174
▁ሚኒ	-175
▁ጊዜ	-176
ኒቨር	-177
ጥር	-178
▁ምን	-179
▁ተከ	-180
መራ	-181
መለ	-182
▁አለ	-183
▁ነው።	-184
▁ይህ	-185
▁እየተ	-186
ቅር	-187
ናል	-188
ንያ	-189
▁ተና	-190
▁የነ	-191
▁ቡ	-192
--	-193
ልጣ	-194
ያን	-195
ላት	-196
ጠና	-197
▁ኤ	-198
▁ሆ	-199
ባቢ	-200
ታው	-201
ናት	-202
▁መንግ	-203
▁አበ	-204
▁ፖ	-205
▁ኢትዮጵያ	-206
ሲቲ	-207
ደረገ	-208
▁ተማሪ	-209
▁ብር	-210
▁መን	-211
▁ያለ	-212
ተር	-213
▁ጨዋታ	-214
▁ቁ	-215
ብር	-216
ከል	-217
ዋል፡፡	-218
▁ተናግ	-219
ገኙ	-220
▁ከፍ	-221
ኒቨርሲቲ	-222
▁ክፍ	-223
ገኘ	-224
ዎችን	-225
ግራ	-226
▁ምር	-227
ምሮ	-228
▁ክልል	-229
▁ሙ	-230
ለያ	-231
▁መረጃ	-232
▁መሆኑን	-233
ሽን	-234
▁ዳ	-235
ይት	-236
▁የት	-237
▁ዶ	-238
ርድ	-239
ታት	-240
ከተ	-241
▁በላይ	-242
▁ቅ	-243
ታቸው	-244
ላቸው	-245
▁አባ	-246
ረዳ	-247
▁መል	-248
ሮች	-249
▁ኃ	-250
▁አበባ	-251
ፊት	-252
▁ቦ	-253
ግባ	-254
ግር	-255
ድን	-256
▁አቶ	-257
▁ስለ	-258
▁ጀ	-259
▁ዝ	-260
ይወ	-261
▁የእ	-262
▁ስራ	-263
ሊስ	-264
▁እያ	-265
▁ቀን	-266
የር	-267
▁የሰ	-268
▁ሌ	-269
▁የኢትዮጵያ	-270
ሎት	-271
▁ድር	-272
▁ና	-273
▁አንድ	-274
ብረ	-275
ማት	-276
▁4	-277
ገለ	-278
ገድ	-279
▁ተናግረ	-280
▁5	-281
ለን	-282
▁ነበር	-283
▁ዕ	-284
ረስ	-285
▁የወ	-286
▁ደረ	-287
▁ከአ	-288
ባቸው	-289
ዓት	-290
▁0	-291
ደጋ	-292
▁ዩኒቨርሲቲ	-293
ረጋ	-294
ችሁ	-295
ዮን	-296
ገልግ	-297
ሰራ	-298
ቢያ	-299
▁ተጠ	-300
▁“	-301
▁ማን	-302
ኞች	-303
ድረግ	-304
ፈል	-305
▁አሳ	-306
ላፊ	-307
ርካ	-308
ላል	-309
መል	-310
ሁም	-311
201	-312
▁ከፍተኛ	-313
ተና	-314
በሩ	-315
ሚያ	-316
ለች	-317
ሏል።	-318
ግለ	-319
▁ዛሬ	-320
▁ሃ	-321
▁ፓ	-322
▁ሥ	-323
▁እስከ	-324
ላም	-325
ስራ	-326
ቦች	-327
▁ማስ	-328
▁!	-329
▁በቀ	-330
ዎቹ	-331
▁ስር	-332
▁አገልግ	-333
ረው	-334
ሉት	-335
▁አር	-336
ክል	-337
▁እንዲሁም	-338
ገኛ	-339
▁ነገር	-340
▁ብለ	-341
▁ከመ	-342
▁አሰ	-343
▁መሰ	-344
▁በዚህ	-345
▁ዓመት	-346
▁ተማሪዎች	-347
▁ምክንያ	-348
ተው	-349
▁አድር	-350
▁የው	-351
▁ተብ	-352
ጨማሪ	-353
▁ትምህርት	-354
ዳን	-355
▁በእ	-356
ዝብ	-357
▁ሺ	-358
ቋል።	-359
▁ላ	-360
ኋላ	-361
▁ሲሉ	-362
ታል	-363
▁ሕ	-364
ለያዩ	-365
መር	-366
ካሄ	-367
ጿል።	-368
▁በሰ	-369
ስቲ	-370
ኛው	-371
▁፤	-372
▁ተቋ	-373
▁አም	-374
▁ጎ	-375
መን	-376
▁.	-377
▁ሳይ	-378
ሪዎች	-379
▁ኦ	-380
ከላ	-381
▁አካባቢ	-382
▁የህ	-383
▁ብቻ	-384
▁ፕሬ	-385
▁ኮሚ	-386
▁ተገል	-387
ክት	-388
ጦር	-389
ይል	-390
▁ፖሊስ	-391
▁ዋና	-392
ራል	-393
ኔታ	-394
▁ሞ	-395
ምና	-396
ስቴ	-397
ስተር	-398
▁ሴ	-399
▁የቀ	-400
ገኝ	-401
▁ሜ	-402
in	-403
▁አዲስ	-404
▁በኋላ	-405
▁አስተዳ	-406
ቤት	-407
▁ሰው	-408
▁አሁን	-409
▁ቴ	-410
ምን	-411
ታቸውን	-412
▁ደግ	-413
▁አስታው	-414
▁ዜ	-415
ጣት	-416
▁ደረጃ	-417
▁ሚኒስት	-418
▁ሁኔታ	-419
ይም	-420
▁ን	-421
▁በት	-422
...	-423
ንን	-424
ሆና	-425
ጀመሪያ	-426
▁አቀ	-427
▁ጨ	-428
ሳይ	-429
ማራ	-430
▁ሚሊ	-431
ጥታ	-432
▁ቤተ	-433
▁ሁሉ	-434
▁ደግሞ	-435
▁ራ	-436
▁እር	-437
መድ	-438
ቷል።	-439
▁መካ	-440
ሳት	-441
▁ክለ	-442
▁መንግስት	-443
▁ሶ	-444
▁ዞ	-445
ደረጉ	-446
ሜሪካ	-447
▁6	-448
▁ምክንያት	-449
▁•	-450
ጠቀ	-451
ቫይ	-452
▁አገልግሎት	-453
ፍሪካ	-454
▁በስ	-455
▁ሚኒስቴ	-456
▁ሀገ	-457
ገን	-458
▁ህይወ	-459
▁ያለው	-460
ወሰ	-461
▁መር	-462
▁ተናግረዋል።	-463
er	-464
ዮች	-465
▁201	-466
ጠበ	-467
ዘጋ	-468
ኤል	-469
▁ዲ	-470
▁የነበረ	-471
ደው	-472
▁አብ	-473
ችል	-474
▁ሲል	-475
ባት	-476
ቅም	-477
ደረሰ	-478
ጤና	-479
▁:	-480
▁ሽ	-481
▁ውጤ	-482
▁ናቸው	-483
ሪክ	-484
ታዊ	-485
▁ቆ	-486
▁ለአ	-487
an	-488
▁መንገድ	-489
ፖርት	-490
ቸዉ	-491
የት	-492
ቃት	-493
ጠር	-494
▁ወቅ	-495
▁ስም	-496
▁ሰዓት	-497
ዳንት	-498
ነው	-499
▁መግለ	-500
▁7	-501
▁ጠቅ	-502
▁ወረዳ	-503
▁ይገኛ	-504
▁ወር	-505
ደም	-506
▁አደጋ	-507
ግብ	-508
▁መካከል	-509
ንጀ	-510
ተን	-511
ሩን	-512
▁ሆነ	-513
ባለ	-514
▁ያስ	-515
▁ሚኒስቴር	-516
ምር	-517
ያስ	-518
ቀው	-519
ችስተር	-520
ቶችን	-521
ጅት	-522
ትል	-523
▁ጀምሮ	-524
----	-525
▁በፊት	-526
on	-527
▁ጉዳይ	-528
▁ዞን	-529
ላለ	-530
▁ቡድን	-531
▁አው	-532
▁የስ	-533
▁ግብ	-534
ንክ	-535
ናይት	-536
ርቲ	-537
▁8	-538
ወጣ	-539
▁ብለዋል።	-540
መው	-541
ጥጥር	-542
▁ውድ	-543
ያቄ	-544
ሉ።	-545
ገና	-546
▁የሆነ	-547
▁ሺህ	-548
▁ተከት	-549
▁ቁጥር	-550
ዘብ	-551
ክር	-552
ሩት	-553
▁ግለ	-554
ጫዋ	-555
ክተር	-556
ፍት	-557
ተዋል።	-558
▁ፈተና	-559
▁ተፈ	-560
▁ፕሮ	-561
ንም	-562
ግራይ	-563
....	-564
▁ተከትሎ	-565
▁ከዚህ	-566
▁ሊግ	-567
▁ዙ	-568
▁ጉዳት	-569
▁ተወ	-570
ዲያ	-571
ለሁ	-572
▁ተቀ	-573
▁ይፋ	-574
▁ጥያቄ	-575
ብስ	-576
▁መግለጫ	-577
▁ገልጸ	-578
ፈው	-579
▁አሰልጣ	-580
▁አመ	-581
▁የኮ	-582
ክምና	-583
▁ቃ	-584
ቀር	-585
ገቡ	-586
▁የሀ	-587
▁ያል	-588
ማር	-589
▁ቦታ	-590
▁t	-591
▁ድጋ	-592
ጠናቀ	-593
ገኘው	-594
ሉን	-595
▁ኢን	-596
▁ለተ	-597
ሥት	-598
ም።	-599
ስር	-600
ክስ	-601
▁ሁለት	-602
ጠው	-603
▁ተጨዋ	-604
▁ፕሬዝ	-605
▁እንዲያ	-606
ንጫ	-607
ላን	-608
▁በነ	-609
▁ብዙ	-610
ረም	-611
▁በኢትዮጵያ	-612
▁የግ	-613
▁ሪ	-614
▁ሲያ	-615
▁ሚኒስትር	-616
▁ማህ	-617
▁ጣ	-618
ከተማ	-619
ኖች	-620
re	-621
▁'	-622
ናይትድ	-623
▁አስተዳደር	-624
▁መጠ	-625
▁ተሰ	-626
ኖር	-627
ሰቡ	-628
▁ዓመ	-629
ሸነ	-630
▁ክፍል	-631
ሔራዊ	-632
▁ችግር	-633
▁ወቅት	-634
▁ተጫዋ	-635
/201	-636
▁?	-637
▁በወ	-638
▁ልዩ	-639
▁ሥራ	-640
ከት	-641
ቧል።	-642
19	-643
▁ኪ	-644
▁ወይም	-645
▁አመት	-646
ፉት	-647
ላማ	-648
▁9	-649
▁በህ	-650
▁ኃላፊ	-651
▁በዓ	-652
ገደ	-653
ምነት	-654
ገራ	-655
ኩል	-656
▁ውጤት	-657
▁መሰረት	-658
በል	-659
▁በም	-660
▁አት	-661
▁ጦር	-662
ገው	-663
▁የኢ	-664
▁እንደሆነ	-665
▁የትምህርት	-666
ቡብ	-667
ረብ	-668
▁ያሉ	-669
ሯል።	-670
ህን	-671
▁ተነ	-672
ቀጥ	-673
▁ድረስ	-674
▁ሚሊዮን	-675
ia	-676
▁ተመ	-677
ጠቃ	-678
▁ቢሮ	-679
ምንት	-680
▁ይታወ	-681
ንዳ	-682
ጥብ	-683
ክልሉ	-684
▁10	-685
▁ከሚ	-686
ሱን	-687
ዲዮ	-688
▁ስል	-689
▁የተሰ	-690
000	-691
ድሞ	-692
ብረት	-693
በው	-694
ረን	-695
▁ር	-696
▁ነበር።	-697
ናው	-698
▁ለሚ	-699
▁ተገልጿል።	-700
ያዘ	-701
ሪቱ	-702
▁በቁ	-703
ሳኔ	-704
▁ሌሎች	-705
ከርካ	-706
ማን	-707
▁ፋ	-708
▁ድጋፍ	-709
▁በተጨማሪ	-710
▁ሂ	-711
ሰው	-712
ነሳ	-713
ክለ	-714
ደን	-715
▁የታ	-716
▁ነዋ	-717
ባይ	-718
▁አሰልጣኝ	-719
▁በሀ	-720
ሮና	-721
ጠት	-722
▁የሚያስ	-723
ንግስት	-724
▁20	-725
▁ጭ	-726
▁ጥቃት	-727
▁አስፈ	-728
▁ቫይ	-729
▁ሮ	-730
ዶች	-731
▁ዝግ	-732
▁ሙሉ	-733
▁በርካ	-734
▁የፈ	-735
▁ዩናይትድ	-736
▁ክለብ	-737
▁ማዕ	-738
ደረግ	-739
ባል	-740
ጋት	-741
▁ማንችስተር	-742
ራን	-743
en	-744
▁በአዲስ	-745
ለቱ	-746
ብት	-747
▁በው	-748
▁ጠቅላይ	-749
ከሰ	-750
▁ሬ	-751
▁ሀገር	-752
ጣይ	-753
▁መቀ	-754
ደረገው	-755
▁A	-756
ጡት	-757
መረ	-758
ጨረ	-759
ንጀል	-760
▁ለማስ	-761
ቀት	-762
መስ	-763
▁አይደ	-764
▁አባላት	-765
▁ምክር	-766
ተኞች	-767
▁አካላት	-768
▁የአዲስ	-769
▁ጨምሮ	-770
▁ተቋማት	-771
ቂያ	-772
▁ሲቲ	-773
ረጋገ	-774
ንግድ	-775
በራዊ	-776
▁የመጀመሪያ	-777
▁ነው፡፡	-778
▁ሆኖ	-779
at	-780
▁ምርመራ	-781
▁የባ	-782
▁የተፈ	-783
▁ተግባ	-784
▁አቀፍ	-785
al	-786
▁ቡድ	-787
ሰባ	-788
ግኘ	-789
▁ሱ	-790
▁ዜጎ	-791
▁ምንም	-792
ኦሮ	-793
ታደ	-794
▁ነገ	-795
ምፒ	-796
ድሪ	-797
▁በቁጥጥር	-798
ዊው	-799
ሉም	-800
▁ገን	-801
▁S	-802
▁ቀናት	-803
ለች።	-804
ብራ	-805
▁ፕሬዝዳንት	-806
▁ከእ	-807
ሽከርካ	-808
ታል።	-809
▁በየ	-810
ጠረ	-811
ጭት	-812
▁እድ	-813
▁የሚገኙ	-814
▁ቶ	-815
▁12	-816
ሬት	-817
ሰቦች	-818
ቲክ	-819
▁የነበሩ	-820
▁ብሔራዊ	-821
▁በደ	-822
▁ደር	-823
ጀት	-824
ስተኛ	-825
▁አመራ	-826
▁ሐ	-827
▁እንደተ	-828
ልቅ	-829
▁ገልጿል።	-830
it	-831
▁በኩል	-832
▁ሳምንት	-833
or	-834
ከፍ	-835
መጣ	-836
▁ቤቱ	-837
▁ቤቶች	-838
▁ገልፀ	-839
▁ተደር	-840
ከያ	-841
ፋት	-842
ፌዴ	-843
ታወቀ	-844
▁እንዳይ	-845
ህል	-846
▁በበ	-847
ገሪቱ	-848
▁ጽ	-849
ጠራ	-850
▁ማለ	-851
ይና	-852
▁ብሎ	-853
▁የተለያዩ	-854
ሙሉ	-855
ዳር	-856
ሰን	-857
▁በሁ	-858
ግራም	-859
▁የደ	-860
▁የሆኑ	-861
▁በርካታ	-862
▁በኮ	-863
▁ከነ	-864
ርያ	-865
ስፒ	-866
▁ዋንጫ	-867
▁ውሳኔ	-868
ሳተ	-869
ችንን	-870
▁ፓርቲ	-871
▁የበ	-872
▁ቻ	-873
ሊያ	-874
ኝነት	-875
ነቱ	-876
▁በግ	-877
ኑን	-878
ላው	-879
▁ነጥብ	-880
▁T	-881
ላንት	-882
▁አቅር	-883
ሞች	-884
▁ኩ	-885
▁በሚል	-886
ሜን	-887
ደራ	-888
▁እንደነ	-889
ደርጉ	-890
ልጣን	-891
ሰጥ	-892
ስታ	-893
ዳጅ	-894
▁አለመ	-895
▁ቫይረስ	-896
ቀረ	-897
▁ፍርድ	-898
▁እንደሚያ	-899
▁፦	-900
ለተኛ	-901
▁በመሆኑ	-902
▁ሸ	-903
▁ዕለት	-904
▁ጥሪ	-905
▁እነ	-906
መለከተ	-907
ንቲ	-908
▁ማሳ	-909
ከና	-910
▁ተጨዋች	-911
ጨረሻ	-912
▁አጋ	-913
he	-914
ቲካ	-915
ደት	-916
ደርግ	-917
▁በመቶ	-918
▁በታ	-919
▁ረ	-920
የን	-921
▁ሰላም	-922
ሳብ	-923
st	-924
ችው	-925
ዛት	-926
▁ፎ	-927
ጠቃላይ	-928
ሙያ	-929
▁አስታውቋል።	-930
▁አድ	-931
▁ህይወት	-932
ጋራ	-933
ፈት	-934
▁አሸ	-935
▁ባንክ	-936
▁ዴ	-937
▁አሳው	-938
ምጃ	-939
▁ፀ	-940
▁ምርጫ	-941
▁አዳ	-942
▁ምንጭ	-943
▁በጣ	-944
▁ዳይ	-945
▁C	-946
ላቀ	-947
ጣሪ	-948
▁በሌ	-949
▁ተብሎ	-950
ራቸው	-951
▁በተለ	-952
▁ገልጸዋል።	-953
▁ሠ	-954
▁መሆና	-955
ላክ	-956
ርክ	-957
ርፍ	-958
ከታ	-959
▁ድርጅት	-960
▁ይች	-961
▁መድረ	-962
▁ሻ	-963
ሮፓ	-964
ያዊ	-965
20	-966
▁ዉ	-967
መልክ	-968
▁የተባ	-969
▁በዛሬ	-970
ላቸውን	-971
ከላከያ	-972
ከር	-973
▁አቅ	-974
▁ያሉት	-975
▁ከባ	-976
ሀም	-977
,000	-978
ንቀ	-979
▁ሀገራት	-980
ላሽ	-981
▁በተለያዩ	-982
ሊዝ	-983
▁እንቅ	-984
▁ቆይ	-985
ውያን	-986
▁ሰራ	-987
▁ተጨማሪ	-988
ልም	-989
ልፍ	-990
▁ችግ	-991
▁በማድረግ	-992
!!	-993
▁ቴሌ	-994
▁ይህን	-995
▁በጥ	-996
▁ድም	-997
ካባቢ	-998
ደበ	-999
ያዙ	-1000
▁ቪ	-1001
▁09	-1002
▁አማ	-1003
ከናወ	-1004
▁ዋጋ	-1005
ጆች	-1006
▁11	-1007
▁አይደለም	-1008
ፈጸ	-1009
▁ከሰ	-1010
el	-1011
ትር	-1012
ረጋግ	-1013
▁ያሳ	-1014
▁ኃይ	-1015
ገብ	-1016
▁በዚህም	-1017
ar	-1018
▁ኬ	-1019
▁የዩ	-1020
▁ልጅ	-1021
ላር	-1022
ou	-1023
ስፋ	-1024
▁ዳይሬ	-1025
ላችሁ	-1026
▁ጉዳዮች	-1027
ብረተ	-1028
▁ቢሆን	-1029
▁የካ	-1030
▁ዓለም	-1031
▁ዘግ	-1032
ደባ	-1033
ግኘት	-1034
▁መንግሥት	-1035
ልድ	-1036
▁ጨዋታዎች	-1037
ስቃ	-1038
▁በድ	-1039
12	-1040
▁ድን	-1041
ያዝ	-1042
ቅድ	-1043
ረሱ	-1044
▁ቃል	-1045
▁የኤ	-1046
▁ፊ	-1047
▁ግንኙ	-1048
▁እርምጃ	-1049
ቆጣ	-1050
▁ሩ	-1051
▁የውጭ	-1052
ፊያ	-1053
▁ጋዜ	-1054
ማይ	-1055
▁ይታወሳ	-1056
ያይ	-1057
▁እጅ	-1058
▁ገንዘብ	-1059
ፍራ	-1060
ልን	-1061
ዕራ	-1062
▁ይህንን	-1063
ቻቸው	-1064
▁ጆ	-1065
▁ተብሏል።	-1066
ፈር	-1067
▁ሰጥ	-1068
▁ኮሚሽን	-1069
▁ግድ	-1070
▁በማለት	-1071
▁ኃይል	-1072
▁የምት	-1073
ልሲ	-1074
▁ሊያ	-1075
ለቲካ	-1076
▁መስመር	-1077
ይይት	-1078
▁በር	-1079
▁የስራ	-1080
▁ማድረግ	-1081
▁ምክትል	-1082
ቷል	-1083
▁እስካ	-1084
▁ሆስፒ	-1085
▁እው	-1086
50	-1087
▁ዘመ	-1088
▁የብ	-1089
ችሉ	-1090
▁ወረ	-1091
▁የጥ	-1092
▁ስታ	-1093
ሬን	-1094
ፈፀ	-1095
ዚያ	-1096
ሪያል	-1097
ስቃሴ	-1098
▁መም	-1099
▁ማድሪ	-1100
▁E	-1101
ላጊ	-1102
ቡን	-1103
▁ያለውን	-1104
▁ናቸው።	-1105
▁ጤና	-1106
▁መልዕ	-1107
▁ዜጎች	-1108
ኪና	-1109
▁ህዝብ	-1110
▁ክር	-1111
ሸነፍ	-1112
▁ግንባ	-1113
▁በሆነ	-1114
::	-1115
am	-1116
ቹን	-1117
▁አይነት	-1118
30	-1119
ነጋ	-1120
ታይ	-1121
ቼልሲ	-1122
▁አዋ	-1123
:00	-1124
▁በዛሬው	-1125
መለስ	-1126
ጠቀም	-1127
ፈልጋ	-1128
▁ለማድረግ	-1129
▁አክ	-1130
ወስ	-1131
▁የማይ	-1132
ኳስ	-1133
ዘር	-1134
▁እንግ	-1135
▁አፍሪካ	-1136
▁የፀ	-1137
ጠሩ	-1138
ቻችን	-1139
ውው	-1140
ሁኑ	-1141
▁የሚል	-1142
ርሴ	-1143
በትን	-1144
▁አትሌ	-1145
በያ	-1146
ic	-1147
▁የነበረው	-1148
ጠበቅ	-1149
▁ዶላር	-1150
ቀዋል።	-1151
ካም	-1152
▁ብሏል።	-1153
▁ባለሙያ	-1154
▁ምስ	-1155
ላንድ	-1156
▁ባለስ	-1157
▁ሶስት	-1158
▁ተገልጿ	-1159
ሚየር	-1160
ድድር	-1161
▁ወጣ	-1162
▁እንዳለ	-1163
▁የአሜሪካ	-1164
ነር	-1165
ይወት	-1166
▁የፖ	-1167
▁ግንኙነት	-1168
ምት	-1169
▁በጣም	-1170
▁ግብር	-1171
▁እንድ	-1172
is	-1173
▁የዓ	-1174
▁በአንድ	-1175
▁ዓመታት	-1176
▁መድ	-1177
ይን	-1178
▁እንጂ	-1179
ፈለ	-1180
ሥራ	-1181
▁በቅር	-1182
▁ህግ	-1183
▁በሙሉ	-1184
▁ሁሉም	-1185
ኳን	-1186
ኦሮሚያ	-1187
▁ወንጀል	-1188
▁ማለት	-1189
ናን	-1190
▁የለም	-1191
▁እንቅስቃሴ	-1192
▁ይገባ	-1193
▁ወራት	-1194
▁የጤና	-1195
ሎጂ	-1196
▁ጣቢያ	-1197
▁19	-1198
▁ዙሪያ	-1199
▁በፍ	-1200
▁እኔ	-1201
ቪድ	-1202
▁የቀድሞ	-1203
25	-1204
▁ይሆና	-1205
ናገ	-1206
▁መሳ	-1207
ካል	-1208
▁ወታደ	-1209
▁እለት	-1210
10	-1211
ሰሩ	-1212
ላዊ	-1213
▁ስብ	-1214
ፌደ	-1215
ቦት	-1216
▁የሕ	-1217
▁አህ	-1218
▁ባለፉት	-1219
ሻሻ	-1220
ኛውም	-1221
ሰናል	-1222
በቃ	-1223
▁አስታወቀ	-1224
▁አንዱ	-1225
ሏል	-1226
▁ትራ	-1227
ሌክት	-1228
ከለ	-1229
▁ምሽ	-1230
▁ጉባ	-1231
▁ገብ	-1232
▁24	-1233
▁ሊቨር	-1234
የም	-1235
▁ቀር	-1236
ቋል፡፡	-1237
▁ጫ	-1238
▁ምላሽ	-1239
ከራ	-1240
▁እስካሁን	-1241
▁ውጪ	-1242
▁ተጫዋች	-1243
ቅና	-1244
ንደ	-1245
ዝገባ	-1246
▁ከሆነ	-1247
▁በማስ	-1248
ሃን	-1249
▁ስት	-1250
▁ጌ	-1251
▁መው	-1252
▁ቀደም	-1253
በሌ	-1254
▁ስምምነት	-1255
ረድ	-1256
ቤተ	-1257
▁ማስተ	-1258
▁በቀጣይ	-1259
▁ተናግረዋል፡፡	-1260
ኖሩ	-1261
▁ለእ	-1262
▁ፅ	-1263
ስራት	-1264
▁ድርጅ	-1265
ቀመ	-1266
▁ሰር	-1267
ለጠ	-1268
ገንዘብ	-1269
▁ከወ	-1270
ካይ	-1271
▁አካባቢዎች	-1272
ሰቦ	-1273
▁የገ	-1274
መዘ	-1275
ስቶ	-1276
▁ከማ	-1277
ታችን	-1278
▁አካል	-1279
▁የሞ	-1280
▁አየር	-1281
▁ሄ	-1282
ካሄድ	-1283
ቫህ	-1284
et	-1285
▁ከባድ	-1286
▁መሪ	-1287
ቱም	-1288
ደርስ	-1289
▁አሜሪካ	-1290
▁ድርጊ	-1291
ዱስ	-1292
▁አራት	-1293
▁ቢሊ	-1294
▁ማድረ	-1295
ብስራት	-1296
የው	-1297
ላጎ	-1298
▁ውድድር	-1299
▁ማድሪድ	-1300
ባሳ	-1301
ስጠት	-1302
ድስት	-1303
▁ዘመን	-1304
▁15	-1305
ሰጣ	-1306
ጫወ	-1307
▁ነዋሪዎች	-1308
ከላከል	-1309
▁ተጠር	-1310
▁ጠይ	-1311
es	-1312
ቆም	-1313
ሰር	-1314
▁የል	-1315
ቲት	-1316
ከፍተኛ	-1317
▁አገ	-1318
--------	-1319
▁ሌላ	-1320
▁የመንግስት	-1321
om	-1322
▁እንደነበር	-1323
ፌደራል	-1324
▁በዘ	-1325
▁ዜና	-1326
▁ልማት	-1327
▁ጦርነት	-1328
ion	-1329
ጸጥታ	-1330
▁ምርጥ	-1331
▁አጥ	-1332
▁የደረሰ	-1333
▁አያ	-1334
ጣቂ	-1335
ልስ	-1336
ሳሳይ	-1337
▁ይሄ	-1338
▁የገለ	-1339
ደሩ	-1340
▁የፍ	-1341
ርሴሎ	-1342
ራዊት	-1343
▁ተነግ	-1344
▁ገለ	-1345
ዋን	-1346
▁መንገ	-1347
▁፡	-1348
▁ሆስፒታል	-1349
ጠየ	-1350
ካባቢው	-1351
▁በተጨማሪም	-1352
▁የምር	-1353
▁30	-1354
ወቅ	-1355
ሮችን	-1356
ዘው	-1357
ሞክ	-1358
▁:-	-1359
ቅረ	-1360
▁በሽ	-1361
ኞቹ	-1362
ህር	-1363
▁መብ	-1364
ሲያ	-1365
ወጥ	-1366
▁መኖ	-1367
▁ሜዳ	-1368
▁መመ	-1369
ማኖ	-1370
ሰማ	-1371
▁ግጭት	-1372
ላሉ	-1373
ውሮፓ	-1374
ንደር	-1375
▁የዋ	-1376
▁ባል	-1377
ቲክቫህ	-1378
ልክ	-1379
▁ቱ	-1380
▁ገልፀዋል።	-1381
▁ሚዲያ	-1382
ሄራዊ	-1383
▁ከቀ	-1384
▁የሁ	-1385
ህንነት	-1386
▁በጉ	-1387
▁የክልሉ	-1388
ዳማ	-1389
▁ሰብ	-1390
ሳቀ	-1391
ንግሊዝ	-1392
ጠብ	-1393
ክኖ	-1394
▁ተከሳ	-1395
ደበኛ	-1396
ቀላቀ	-1397
ናዊ	-1398
▁ፍላጎ	-1399
▁ውይይት	-1400
▁ዙር	-1401
ትና	-1402
ኬሽን	-1403
▁ኮሚቴ	-1404
ሙን	-1405
ሽከርካሪ	-1406
ጋሚ	-1407
▁አድርጓ	-1408
▁የከተማ	-1409
ቃል።	-1410
ዳታ	-1411
▁የቆ	-1412
ዘጋጀ	-1413
ዉን	-1414
ለዋል።	-1415
ስቲያን	-1416
▁ሆነው	-1417
ቴሌ	-1418
▁ወጥ	-1419
▁እንኳን	-1420
▁የሊ	-1421
ናፊ	-1422
ሌክትሪክ	-1423
▁ዶክተር	-1424
ይማኖ	-1425
▁ቼልሲ	-1426
▁ክት	-1427
▁የአፍሪካ	-1428
▁መሳሪያ	-1429
▁ግለሰቦች	-1430
ወር	-1431
ሮፕ	-1432
መቱ	-1433
ካሄደ	-1434
▁ህዝ	-1435
ባሪ	-1436
ጥሮ	-1437
ተዋል	-1438
ኦን	-1439
▁/	-1440
▁ጥቅም	-1441
▁እንዴ	-1442
▁ግለሰብ	-1443
▁14	-1444
-0	-1445
▁እኛ	-1446
ድዮ	-1447
ቃድ	-1448
▁እንዳል	-1449
ሶማ	-1450
ቻል	-1451
ስተዳ	-1452
▁አሁንም	-1453
▁ቢሆንም	-1454
▁ለው	-1455
ዝር	-1456
ሬሽን	-1457
▁ለብስራት	-1458
ጠቅ	-1459
▁አላ	-1460
ባቂ	-1461
ጠኛ	-1462
ኒክ	-1463
▁መሆን	-1464
ብኝ	-1465
ሏል፡፡	-1466
ከታተ	-1467
▁ተስፋ	-1468
▁ምሽት	-1469
ዱን	-1470
በዋል።	-1471
▁ዳይሬክተር	-1472
▁መተ	-1473
▁ወንድ	-1474
ንድሮ	-1475
ሰት	-1476
▁ዕድ	-1477
▁ጥሩ	-1478
▁የሌ	-1479
▁የዘ	-1480
▁ያልተ	-1481
ሚዎች	-1482
ሄድ	-1483
ሳቸው	-1484
ቷል፡፡	-1485
▁አስተያ	-1486
ጠይ	-1487
ክኖሎጂ	-1488
ዕራብ	-1489
▁ወይ	-1490
ing	-1491
▁አማራ	-1492
ኳይ	-1493
▁በኃ	-1494
ማቸው	-1495
▁አባል	-1496
ኒኬሽን	-1497
▁ገቢ	-1498
▁ጥረት	-1499
ለቀ	-1500
▁የሚሆኑ	-1501
ቸኳይ	-1502
መሰ	-1503
ጀር	-1504
▁ይገኛል።	-1505
በረሰብ	-1506
▁ሁለተኛ	-1507
▁ክፍለ	-1508
ed	-1509
▁አስፈላጊ	-1510
▁ጉባኤ	-1511
▁13	-1512
▁ንግ	-1513
▁የድ	-1514
▁ህክምና	-1515
▁ሴት	-1516
ቫይረሱ	-1517
▁መሠ	-1518
▁ክፍያ	-1519
▁ከስ	-1520
ብረተሰቡ	-1521
▁ጠቁ	-1522
ሰጡ	-1523
ሶች	-1524
ጀመረ	-1525
ገረ	-1526
▁አምስት	-1527
ርሴሎና	-1528
ሆናል	-1529
▁ትላንት	-1530
ደብ	-1531
ቋረ	-1532
▁c	-1533
▁መልኩ	-1534
ኒቨርስቲ	-1535
▁ይሆናል	-1536
▁የውድድር	-1537
ምህር	-1538
▁የቀረ	-1539
ህበራዊ	-1540
▁በጎ	-1541
ዋሳ	-1542
ናቸው	-1543
▁የፀጥታ	-1544
ac	-1545
▁አገልግሎ	-1546
▁የሰላም	-1547
ቋቋ	-1548
ዓዊ	-1549
ቀል	-1550
▁የቻ	-1551
▁ቋ	-1552
▁ቅር	-1553
ነሱ	-1554
ቂቃ	-1555
ስን	-1556
▁ባለው	-1557
▁የአማራ	-1558
▁መርሐ	-1559
▁የምን	-1560
▁የትራ	-1561
▁ሥር	-1562
ብን	-1563
ኮች	-1564
▁እንደማይ	-1565
ፉን	-1566
▁ወን	-1567
▁ኳስ	-1568
▁አህመድ	-1569
ፖር	-1570
▁ዳር	-1571
▁ደን	-1572
ምባ	-1573
▁በተመለከተ	-1574
ፈልግ	-1575
▁ተቃ	-1576
▁አመራሮች	-1577
▁ቀበሌ	-1578
ወጡ	-1579
ጀም	-1580
▁አርሰናል	-1581
ንግሥት	-1582
▁ሳይሆን	-1583
▁መንግስ	-1584
▁ይታወሳል።	-1585
ከረም	-1586
ያያዘ	-1587
በረው	-1588
▁ትኩ	-1589
▁ኒ	-1590
▁)	-1591
ሎችን	-1592
▁ዝግጅት	-1593
and	-1594
▁የትግራይ	-1595
▁ባይ	-1596
▁አለም	-1597
▁f	-1598
ላማዊ	-1599
▁በመሆን	-1600
ርቶ	-1601
ደኛ	-1602
▁በይ	-1603
▁ተገ	-1604
▁የጦር	-1605
▁ያላቸው	-1606
ወጣው	-1607
▁በዋ	-1608
ንቅ	-1609
ሱዳን	-1610
ከፈ	-1611
▁መግ	-1612
▁ልም	-1613
▁ሴቶች	-1614
ገናኛ	-1615
▁መፍት	-1616
▁አምባሳ	-1617
▁በቅርቡ	-1618
▁መሆናቸውን	-1619
▁ሪፖርት	-1620
▁ጅ	-1621
▁ነዉ	-1622
መለከ	-1623
▁ታሪክ	-1624
▁አሳውቋል።	-1625
ጋቢ	-1626
ክሬን	-1627
ከብ	-1628
ናንት	-1629
▁ቢያ	-1630
ዲሱ	-1631
▁በራ	-1632
ፃሜ	-1633
▁ንግድ	-1634
▁ጁ	-1635
መዋል።	-1636
▁አልተ	-1637
▁s	-1638
ውውር	-1639
ደርጋ	-1640
▁ፒ	-1641
▁እግር	-1642
▁በረ	-1643
▁b	-1644
ቅረብ	-1645
▁ትልቅ	-1646
ምፕ	-1647
▁ክስ	-1648
▁ዝር	-1649
▁የራ	-1650
▁የሰው	-1651
ታወቂያ	-1652
▁ባለፈው	-1653
▁ታጣቂ	-1654
▁ለህ	-1655
▁ዘግቧል።	-1656
ሙት	-1657
▁የህዝብ	-1658
▁ጊ	-1659
▁ኮን	-1660
▁የፊት	-1661
▁ይሆናል።	-1662
ጉን	-1663
▁ቀጥ	-1664
ለማ	-1665
▁ይሁን	-1666
ገነ	-1667
▁ውጭ	-1668
ተት	-1669
ኮኖ	-1670
▁18	-1671
▁ያህል	-1672
▁አፈ	-1673
▁ስጋት	-1674
▁አሸናፊ	-1675
ፈልጉ	-1676
▁ኮሚሽ	-1677
-1	-1678
▁የጎ	-1679
▁ተገልጿል	-1680
ርስ	-1681
ለን።	-1682
▁በትግራይ	-1683
▁ሉ	-1684
il	-1685
▁a	-1686
▁ስፍራ	-1687
▁አሳስ	-1688
ውስ	-1689
ቸዉን	-1690
▁16	-1691
▁አሉ	-1692
▁ደጋ	-1693
ንስፖርት	-1694
ካሄደው	-1695
▁ስብሰባ	-1696
▁አግ	-1697
▁the	-1698
▁ነፃ	-1699
▁በዓል	-1700
▁ነዋሪ	-1701
▁መጥ	-1702
ፋር	-1703
▁አድርጎ	-1704
▁መከላከያ	-1705
▁በስም	-1706
▁ሂደት	-1707
▁ጃ	-1708
ኒያ	-1709
▁መዋ	-1710
ንሲ	-1711
▁ሚሊየን	-1712
ርሚየር	-1713
▁ተከታ	-1714
ርትራ	-1715
▁መልካም	-1716
▁ስነ	-1717
ዩን	-1718
▁በሌላ	-1719
ላል።	-1720
▁የዓለም	-1721
ልማት	-1722
ጀመር	-1723
▁መልዕክት	-1724
ውል	-1725
▁ሪያል	-1726
▁ሻምፒ	-1727
▁o	-1728
ገሩ	-1729
ስቲያ	-1730
▁መጠን	-1731
▁ፕሮግራም	-1732
ሟል።	-1733
▁ተገኝ	-1734
▁አጠቃላይ	-1735
▁መታ	-1736
▁እጅግ	-1737
ዘጋጅ	-1738
ጠናቀቅ	-1739
ዘን	-1740
▁ብለው	-1741
ማሽ	-1742
▁ካለ	-1743
▁ለሁ	-1744
▁ግንባታ	-1745
▁መፈ	-1746
ከፋ	-1747
▁ምዝገባ	-1748
ረተ	-1749
▁p	-1750
ሰጠ	-1751
ጥረት	-1752
▁ሳይንስ	-1753
ነስ	-1754
ደረጉት	-1755
▁በበኩ	-1756
ኤስ	-1757
▁የክ	-1758
▁በአማራ	-1759
ግባት	-1760
▁በብ	-1761
በብ	-1762
ዳት	-1763
ጋጠ	-1764
በሩት	-1765
▁መኪና	-1766
ችሁን	-1767
ቃል	-1768
ግና	-1769
ራሲ	-1770
ለፍ	-1771
▁ካል	-1772
መም	-1773
▁አድርገ	-1774
▁ሚኒስትሩ	-1775
▁17	-1776
▁ባን	-1777
ገባው	-1778
ቢሲ	-1779
▁ይዞ	-1780
ስራኤል	-1781
▁ታው	-1782
▁ዩኒቨርሲቲው	-1783
▁ከም	-1784
መጡ	-1785
▁25	-1786
-19	-1787
24	-1788
▁ስን	-1789
▁ስልጠና	-1790
መለሱ	-1791
ያቸው	-1792
▁በኮሮና	-1793
ቸዋል።	-1794
▁ፍላጎት	-1795
ላቅ	-1796
ለውን	-1797
▁ተጠቃ	-1798
▁ዘርፍ	-1799
ደባባይ	-1800
▁m	-1801
▁ማር	-1802
▁መብት	-1803
▁ፎቶ	-1804
ሯል	-1805
▁የማን	-1806
▁አንዳ	-1807
▁::	-1808
▁ችሏል።	-1809
▁የፕ	-1810
ነትን	-1811
ቤቱ	-1812
ዳሚ	-1813
▁ሰራተኞች	-1814
▁ከተሞች	-1815
▁ብሄራዊ	-1816
ራር	-1817
ገለጸ	-1818
ኔት	-1819
▁እንዴት	-1820
ኛል	-1821
▁በክልሉ	-1822
▁በባ	-1823
▁ደብ	-1824
ንቀሳቀ	-1825
▁እንደሚገኝ	-1826
ከበር	-1827
15	-1828
▁እነዚህ	-1829
ሳስ	-1830
▁የንግድ	-1831
▁የሚገኘው	-1832
▁ተደርጓ	-1833
▁ይህም	-1834
▁የሆኑት	-1835
ደግ	-1836
▁በተያያዘ	-1837
ናል።	-1838
ሳው	-1839
ንቲባ	-1840
ተዋል፡፡	-1841
ፌዴራል	-1842
▁በኢ	-1843
▁ሬዲዮ	-1844
▁መዝ	-1845
th	-1846
ራይ	-1847
▁ማረ	-1848
▁ተግባር	-1849
ስራቅ	-1850
▁ምንጭ፦	-1851
▁ሃላፊ	-1852
▁የሰብ	-1853
ዘግ	-1854
▁በከተማ	-1855
▁ኃይሎች	-1856
▁የለ	-1857
▁ሜትር	-1858
▁ወጣቶች	-1859
▁ማዕከል	-1860
▁ኢንተር	-1861
ጠረው	-1862
▁ወስ	-1863
ረጋገጥ	-1864
▁ደህንነት	-1865
▁በተለይ	-1866
▁በኃላ	-1867
ቁት	-1868
▁የገንዘብ	-1869
ደረጋ	-1870
▁ቢሊዮን	-1871
ባቸውን	-1872
▁የተነሳ	-1873
▁ከት	-1874
gr	-1875
ፊዎች	-1876
▁ርዕ	-1877
▁የላ	-1878
▁የግል	-1879
▁የህክምና	-1880
▁በዩ	-1881
ጠል	-1882
ነግ	-1883
▁መለ	-1884
▁የሚቆ	-1885
ነቱን	-1886
▁መደበኛ	-1887
▁ቴሌቪ	-1888
▁ኢንስ	-1889
▁ሀላፊ	-1890
ንቃ	-1891
ቆጣጠር	-1892
▁የሆነው	-1893
▁ተሸ	-1894
▁ቅሬ	-1895
▁ቁጥጥር	-1896
ግሪ	-1897
▁መረጃዎች	-1898
ቃቤ	-1899
ሽከርካሪዎች	-1900
▁፡፡	-1901
▁ባርሴሎና	-1902
▁በል	-1903
▁ቅድ	-1904
▁ሀይ	-1905
ኒት	-1906
ዚሁ	-1907
ቸዋል	-1908
መዝ	-1909
ሪስ	-1910
▁ሎ	-1911
▁ህፃ	-1912
▁አራ	-1913
▁መነ	-1914
▁አረጋግ	-1915
ስቡ	-1916
ዳሜ	-1917
▁ፕሬዚ	-1918
ሞት	-1919
ኞችን	-1920
▁ፕሮጀ	-1921
ድሩ	-1922
ፎች	-1923
▁ተነግሯል።	-1924
▁የሥራ	-1925
▁አምባሳደር	-1926
▁የምግብ	-1927
ሰበ	-1928
▁ዉስጥ	-1929
ረንሳይ	-1930
▁ባለስልጣ	-1931
ቢይ	-1932
▁ይጠበ	-1933
▁እየተደረገ	-1934
ገት	-1935
ምሌ	-1936
ወዳ	-1937
▁ቡድኑ	-1938
▁የኮሮና	-1939
▁ከታ	-1940
▁በቫይረሱ	-1941
▁ባለመ	-1942
▁ሁለቱ	-1943
▁ብለዋል፡፡	-1944
ጋዊ	-1945
▁ፌ	-1946
▁ህገ	-1947
▁አውሮፕ	-1948
▁አረ	-1949
ሙስ	-1950
▁በጀት	-1951
ይማኖት	-1952
▁ቴክኖሎጂ	-1953
ቁን	-1954
አት	-1955
ድብ	-1956
▁ንብረት	-1957
▁የጸጥታ	-1958
▁ይመስ	-1959
ol	-1960
ጭር	-1961
ካዮች	-1962
▁በሕ	-1963
▁በጋራ	-1964
▁ዘር	-1965
ሰጠው	-1966
▁በይፋ	-1967
▁ከሌ	-1968
▁በሚያ	-1969
በራ	-1970
▁ዩኒቨርስቲ	-1971
ገራችን	-1972
ናይ	-1973
▁ትኩረት	-1974
ውም	-1975
▁የተወሰ	-1976
ላለፍ	-1977
▁ተሳ	-1978
▁ያደረገ	-1979
▁ተጋ	-1980
ሻለ	-1981
ጅም	-1982
▁ሊቀ	-1983
ያዛ	-1984
▁አመታት	-1985
▁ማሸነፍ	-1986
▁በመተ	-1987
ሶስት	-1988
▁የሴ	-1989
▁አማካ	-1990
ንካ	-1991
ፊክ	-1992
ጀንሲ	-1993
▁በደቡብ	-1994
▁1.	-1995
ርሽ	-1996
▁የተባለ	-1997
ዳቤ	-1998
ላችን	-1999
▁ከበ	-2000
▁መሠረት	-2001
ባንያ	-2002
13	-2003
ሁድ	-2004
ኩት	-2005
▁በአሁኑ	-2006
▁ኢትዮጵያዊ	-2007
▁አድራ	-2008
▁ትን	-2009
ቋል	-2010
ልያ	-2011
ስቱ	-2012
▁በሰጡት	-2013
▁ድል	-2014
ዋት	-2015
ለውም	-2016
▁እንደሚችል	-2017
▁በስምኦን	-2018
ግል	-2019
▁ሰዎችን	-2020
ርማ	-2021
▁ቲ	-2022
▁መቶ	-2023
▁ምግብ	-2024
▁ሱዳን	-2025
▁በመግለ	-2026
ኬት	-2027
▁ተማሪዎችን	-2028
ክሲ	-2029
▁ተቋም	-2030
▁የእንግሊዝ	-2031
ዳሪ	-2032
ዳቸው	-2033
▁ተያይ	-2034
▁ስድስት	-2035
▁የቡ	-2036
ገለፀ	-2037
ቷን	-2038
▁አደባባይ	-2039
ቀርብ	-2040
ቀበል	-2041
ጥነት	-2042
▁በጋ	-2043
22	-2044
▁የፖለቲካ	-2045
ሳቸውን	-2046
ኮም	-2047
▁of	-2048
▁ለማግኘት	-2049
▁ደቂቃ	-2050
ሳቢ	-2051
ቶቹ	-2052
ቆጥ	-2053
▁ከሀ	-2054
▁ቤተሰብ	-2055
▁የሽ	-2056
▁ቆይታ	-2057
▁ባለሙያዎች	-2058
▁አስራ	-2059
▁አቅም	-2060
ማስ	-2061
▁የአውሮፓ	-2062
▁በተመ	-2063
▁and	-2064
▁ማስረጃ	-2065
▁በሊ	-2066
▁የጉ	-2067
▁አስረድ	-2068
ቴል	-2069
ክሮ	-2070
▁ነጋ	-2071
▁ቅዱስ	-2072
▁መቆ	-2073
▁ህብረት	-2074
ማማ	-2075
ቦችን	-2076
▁ነኝ	-2077
▁በደረሰ	-2078
ግን	-2079
▁ፕሪ	-2080
ፈራ	-2081
▁በሽታ	-2082
ጠዋል።	-2083
▁ስልክ	-2084
ent	-2085
ምረ	-2086
ደጋጋሚ	-2087
▁ጥቃ	-2088
አዊ	-2089
▁ይገኛል	-2090
▁ወጪ	-2091
ቶን	-2092
ክለቡ	-2093
▁ጥር	-2094
ኮኖሚ	-2095
ታል፡፡	-2096
ሰድ	-2097
▁መስጠት	-2098
▁አቋ	-2099
▁ትክ	-2100
▁ንግግር	-2101
▁ተናግሯል።	-2102
▁ፍቅር	-2103
ዩት	-2104
▁ዮ	-2105
▁ከንቲባ	-2106
ሬዳ	-2107
▁22	-2108
▁ክልሎች	-2109
ፖሊስ	-2110
ኩስ	-2111
▁ለመፍ	-2112
▁ጸ	-2113
▁የፓ	-2114
▁ተደም	-2115
ደገ	-2116
ሊጋ	-2117
ማሪዎች	-2118
ቻቸውን	-2119
ምሩ	-2120
ቂት	-2121
▁23	-2122
▁ከሁ	-2123
ላስ	-2124
▁ዓይ	-2125
ለጋ	-2126
ሊያን	-2127
ጠኝ	-2128
ሱት	-2129
ጠፋ	-2130
▁ኖ	-2131
▁21	-2132
ንቃቄ	-2133
▁መስከረም	-2134
▁ስሜ	-2135
ለመ	-2136
ዛዝ	-2137
▁መምሪያ	-2138
▁ለም	-2139
የንስ	-2140
▁ተዋ	-2141
▁ተወካዮች	-2142
▁d	-2143
▁ድርጅቶች	-2144
ቱት	-2145
በሪያ	-2146
as	-2147
ፈን	-2148
▁...	-2149
▁ከላይ	-2150
▁የሃ	-2151
ስቡክ	-2152
ባበር	-2153
ባብ	-2154
ደረጃ	-2155
ዝም	-2156
ግም	-2157
▁መፍትሄ	-2158
ጫው	-2159
▁ፊት	-2160
ረፍ	-2161
▁ለመስጠት	-2162
ሳካ	-2163
▁ወገ	-2164
▁ደቡብ	-2165
▁መምህ	-2166
▁የፌደራል	-2167
▁አስተያየት	-2168
▁ድምፅ	-2169
▁አመራር	-2170
ኔል	-2171
ቆማ	-2172
▁እንድት	-2173
▁አስቀ	-2174
▁በአጠቃላይ	-2175
መንት	-2176
ሬዳዋ	-2177
ሰተኛ	-2178
▁ተደርጎ	-2179
ሱም	-2180
ንቋ	-2181
ay	-2182
▁ወታደራዊ	-2183
ለዋል	-2184
▁ቡና	-2185
▁ተዘግ	-2186
ልት	-2187
▁ኑ	-2188
11	-2189
ስስር	-2190
▁ዝርዝር	-2191
▁ዘንድ	-2192
ውጣት	-2193
▁የአለም	-2194
op	-2195
▁በኤ	-2196
▁ትናንት	-2197
▁50	-2198
▁ገበያ	-2199
▁በቂ	-2200
ሔር	-2201
▁ተመል	-2202
ሬዝ	-2203
▁አንዳንድ	-2204
▁ቅሬታ	-2205
▁የሚያስችል	-2206
ከባቢ	-2207
ተንሀም	-2208
▁ወል	-2209
▁ቅዳሜ	-2210
ለኝ	-2211
▁....	-2212
▁በታች	-2213
ታማ	-2214
ሊት	-2215
ርቅ	-2216
▁በተለይም	-2217
▁እንዲህ	-2218
▁ይችላል	-2219
▁ለምን	-2220
ናቃ	-2221
▁የማስ	-2222
ኪያ	-2223
▁27	-2224
ሳተፉ	-2225
▁መያዛ	-2226
▁እርዳታ	-2227
▁ተጠርጣሪ	-2228
▁እድል	-2229
ዲህ	-2230
▁ክትትል	-2231
▁2016	-2232
▁ኢትዮ	-2233
ዱት	-2234
▁in	-2235
▁የአንድ	-2236
▁በኦሮሚያ	-2237
▁እንደተና	-2238
▁የመጨረሻ	-2239
▁ለዚህ	-2240
▁ወጣት	-2241
▁በሰላም	-2242
ir	-2243
▁መጀመ	-2244
ህፈት	-2245
▁ቦርድ	-2246
▁ፕርሚየር	-2247
▁አለበት	-2248
ሩሲያ	-2249
▁ፍፃሜ	-2250
▁መመሪያ	-2251
ot	-2252
ጣል	-2253
ገሩት	-2254
▁የጋራ	-2255
▁ከህ	-2256
▁ለወ	-2257
▁በፈ	-2258
▁የአየር	-2259
▁የእሳት	-2260
▁አዋጅ	-2261
▁ኩባንያ	-2262
ባዊ	-2263
▁ከጥ	-2264
▁የሲ	-2265
▁ተይ	-2266
▁ተጠና	-2267
▁ወንጀ	-2268
▁ማግኘት	-2269
▁ቤተሰቦ	-2270
▁ትምህር	-2271
▁የሀገር	-2272
▁መሸ	-2273
ጋቢት	-2274
▁ተመራ	-2275
le	-2276
ም፣	-2277
ጫወት	-2278
▁መኖሪያ	-2279
us	-2280
ሉ፡፡	-2281
▁ኪሎ	-2282
▁የደቡብ	-2283
23	-2284
▁ያገኘ	-2285
▁ዲግሪ	-2286
▁እጥረት	-2287
መሩ	-2288
▁እስራ	-2289
▁ጓ	-2290
▁መደረጉ	-2291
▁ነጻ	-2292
▁ማህበር	-2293
▁ልክ	-2294
ቀጥል	-2295
ጠቅላይ	-2296
▁ስለሚ	-2297
▁ካር	-2298
▁ጉዞ	-2299
ድያ	-2300
▁ትስስር	-2301
ረዳት	-2302
▁ኮሌ	-2303
▁28	-2304
▁ከኢትዮጵያ	-2305
▁ኢትዮጵያውያን	-2306
ሰዋል።	-2307
▁በከፍተኛ	-2308
▁ዩኒቨርሲቲዎች	-2309
18	-2310
▁አጠና	-2311
ጓዝ	-2312
ጠቀሙ	-2313
▁የዩኒቨርሲቲ	-2314
በላ	-2315
▁ቦታዎች	-2316
▁በተመሳሳይ	-2317
gram	-2318
ነታቸው	-2319
▁ያላ	-2320
▁ክለቦች	-2321
ላቂ	-2322
▁ሰኔ	-2323
▁y	-2324
▁ኤጀንሲ	-2325
▁ተሽከርካሪ	-2326
▁ከአንድ	-2327
ስትሪ	-2328
▁ውሃ	-2329
▁ይገባል	-2330
ክተ	-2331
▁አስታውቋል፡፡	-2332
ጋሪ	-2333
▁ተገቢ	-2334
ስቸኳይ	-2335
ረፍት	-2336
▁መና	-2337
▁ተግባራዊ	-2338
ation	-2339
▁ደብዳቤ	-2340
▁ባወጣው	-2341
▁ሬድዮ	-2342
▁ፍት	-2343
ዎቹን	-2344
መልከት	-2345
▁ጥቅምት	-2346
▁ማህበረሰብ	-2347
▁ወረርሽ	-2348
▁የኢን	-2349
▁አዲሱ	-2350
ካሂ	-2351
▁መሀ	-2352
▁አገር	-2353
▁ግል	-2354
▁መወሰ	-2355
▁26	-2356
▁ሰነ	-2357
▁ጀር	-2358
ha	-2359
▁የዝ	-2360
▁አፍ	-2361
▁ሚላን	-2362
▁ትዕ	-2363
▁ተሰም	-2364
▁የሚፈ	-2365
ዳጊ	-2366
▁ችሎት	-2367
ራሽ	-2368
▁ዋናው	-2369
▁አመልክ	-2370
oin	-2371
▁ደም	-2372
▁ፈቃድ	-2373
ቡር	-2374
▁ልጆች	-2375
▁አስተዳደሩ	-2376
▁በወቅ	-2377
ታር	-2378
▁የማንችስተር	-2379
ዲየም	-2380
▁ባለቤት	-2381
▁የተቀ	-2382
▁ብዬ	-2383
ላላ	-2384
▁ከው	-2385
▁ሰላማዊ	-2386
:-	-2387
ደርገው	-2388
ፃሚ	-2389
የሁ	-2390
▁ባሉ	-2391
ዘዋ	-2392
▁ስለሆነ	-2393
▁አስከ	-2394
ስል	-2395
▁ከደ	-2396
▁የቅ	-2397
▁መጨረሻ	-2398
▁የካቲት	-2399
▁አዛ	-2400
▁ጥናት	-2401
ላይታ	-2402
▁አብይ	-2403
ም፡፡	-2404
▁2.	-2405
ኤስጂ	-2406
▁በሳ	-2407
ሠራ	-2408
ስትና	-2409
ur	-2410
▁ወላ	-2411
▁ባለስልጣን	-2412
▁በተፈ	-2413
▁እየሰራ	-2414
▁ምርት	-2415
▁ተጠቃሚ	-2416
▁ቫ	-2417
▁በመጠቀም	-2418
ጠቁ	-2419
▁የዲ	-2420
▁የተከሰ	-2421
▁ሰራዊት	-2422
ናብ	-2423
▁ግራ	-2424
▁ውል	-2425
ከናወን	-2426
▁እሁድ	-2427
▁ስቴ	-2428
▁ሽልማት	-2429
▁ህጻ	-2430
▁ናት	-2431
▁በሁሉም	-2432
▁ታጣቂዎች	-2433
▁ተሳት	-2434
14	-2435
ቡት	-2436
ገዛ	-2437
▁ቀጣይ	-2438
ደሰ	-2439
▁ጋዜጣ	-2440
▁የሀገሪቱ	-2441
▁ለበ	-2442
▁ያሳያ	-2443
▁እንደተናገሩት	-2444
▁እንዲሆን	-2445
▁100	-2446
▁ችግሮች	-2447
▁ያቀረ	-2448
ዎን	-2449
ንቱ	-2450
▁መሆናቸው	-2451
▁የተያዙ	-2452
▁አስመልክ	-2453
ዜማ	-2454
▁ለውጥ	-2455
▁29	-2456
ፎርድ	-2457
ጊያ	-2458
ለሁ።	-2459
▁ማክ	-2460
▁ላለ	-2461
ሞን	-2462
▁ማጣ	-2463
ክልል	-2464
ሸን	-2465
▁ዓመቱ	-2466
▁መፍ	-2467
ፈረም	-2468
2519	-2469
▁መስተዳ	-2470
▁to	-2471
▁አደ	-2472
ጋና	-2473
▁ስራዎች	-2474
ቆጠር	-2475
ናቀ	-2476
ረቃ	-2477
ልማ	-2478
▁የወጣ	-2479
ዞኑ	-2480
ክርስቲያን	-2481
▁ሰለ	-2482
▁ገልጸዋል፡፡	-2483
▁መፅ	-2484
▁አድርጓል።	-2485
▁ህይወታቸው	-2486
▁ባለስልጣናት	-2487
▁2015	-2488
ሰል	-2489
▁ብራ	-2490
▁ግቢ	-2491
▁አስታወቀ።	-2492
ኬንያ	-2493
▁የኦ	-2494
▁ለመከላከል	-2495
▁ሰን	-2496
▁እራ	-2497
ብብር	-2498
ሊን	-2499
▁ተለ	-2500
▁አቡ	-2501
ነኛ	-2502
ያት	-2503
ምረው	-2504
▁የቴሌ	-2505
▁ስርዓት	-2506
ሳኝ	-2507
ዳሴ	-2508
ራቸውን	-2509
▁በዓለም	-2510
▁ሙከራ	-2511
▁ሮናል	-2512
16	-2513
ረር	-2514
▁ድርጊት	-2515
ሜዳ	-2516
ንፈ	-2517
▁ቋንቋ	-2518
ራዘ	-2519
▁የቤት	-2520
ከረ	-2521
▁ግድያ	-2522
▁በመቀ	-2523
▁ኮንት	-2524
▁ተከሳሽ	-2525
▁ጋዜጠኛ	-2526
ምባሲ	-2527
▁ኤፍ	-2528
ባሉ	-2529
ያንዳን	-2530
ንስት	-2531
▁መስሪያ	-2532
ውሞ	-2533
▁ክፍሎች	-2534
▁ይገኛሉ።	-2535
▁የቀረበ	-2536
▁ቁጥ	-2537
▁ትግራይ	-2538
▁የተባለው	-2539
▁እግ	-2540
▁ሆቴል	-2541
▁ጠባቂ	-2542
▁ሕዝብ	-2543
ይይ	-2544
ገበ	-2545
▁እንደሌ	-2546
▁ፕሬዚዳንት	-2547
ለህ	-2548
ብሪካ	-2549
▁ተች	-2550
ሞክራሲ	-2551
▁ዝግጁ	-2552
ንጉ	-2553
▁ኤም	-2554
▁ዘገባ	-2555
ባር	-2556
ለያየ	-2557
▁ደሞ	-2558
▁ተጠቁ	-2559
▁የተደረገ	-2560
ፈረ	-2561
▁በቅ	-2562
▁መኮ	-2563
▁በቦ	-2564
▁ጥቆማ	-2565
▁እናት	-2566
▁መሬት	-2567
ልኝ	-2568
em	-2569
▁ቀጠ	-2570
/2016	-2571
▁ሰባት	-2572
▁ቅጣት	-2573
▁መገደ	-2574
ጡን	-2575
▁ባህር	-2576
▁መግባ	-2577
▁በሀገሪቱ	-2578
አብ	-2579
ናሽ	-2580
▁የፋ	-2581
ኛውን	-2582
▁ቻና	-2583
▁ግቦች	-2584
▁እስራኤል	-2585
ሽታው	-2586
▁ማሻሻ	-2587
▁በትላንት	-2588
▁እየተሰራ	-2589
▁ትክክለ	-2590
▁ምል	-2591
▁ህመም	-2592
▁አልባ	-2593
▁ዱ	-2594
▁በሚገኙ	-2595
ናግ	-2596
▁ጥላ	-2597
▁ሃይል	-2598
▁ህን	-2599
▁ልጆ	-2600
▁መገናኛ	-2601
ራረ	-2602
ማቸውን	-2603
▁ወረዳዎች	-2604
▁ሳምን	-2605
▁ስለመ	-2606
▁በማህበራዊ	-2607
ይቶ	-2608
ናና	-2609
ele	-2610
▁በመጀመሪያ	-2611
ቻሉ	-2612
▁ነበር፡፡	-2613
▁ለብ	-2614
ዳዩ	-2615
ጨዋታው	-2616
▁እንደሚገኙ	-2617
ምድ	-2618
▁እየተካሄደ	-2619
▁በሚገኘው	-2620
ክቶ	-2621
ቅርታ	-2622
በታል።	-2623
▁ብል	-2624
▁ትር	-2625
▁ቶተንሀም	-2626
▁ያደርጋ	-2627
ደል	-2628
ሌት	-2629
▁የመንግሥት	-2630
▁የተናገ	-2631
▁ተራ	-2632
ቧል፡፡	-2633
▁ዘመቻ	-2634
▁ቤተሰቦች	-2635
▁በአካባቢው	-2636
▁የምታ	-2637
▁መጽ	-2638
▁የነበረውን	-2639
▁መጨ	-2640
▁የኦሮሚያ	-2641
▁እስራት	-2642
▁ሀሳብ	-2643
▁የዛሬ	-2644
27	-2645
ሽኑ	-2646
ችላ	-2647
▁አስተላል	-2648
▁የቤተ	-2649
ro	-2650
▁እንዲፈ	-2651
ቀርቡ	-2652
ታወቀው	-2653
▁you	-2654
▁ግዛት	-2655
ድሮ	-2656
▁ሰልፍ	-2657
▁በሌሎች	-2658
ለች፡፡	-2659
▁አቅራ	-2660
▁ጥበቃ	-2661
▁በተደጋጋሚ	-2662
ገገ	-2663
▁የኤሌክትሪክ	-2664
ያቂ	-2665
ምቤ	-2666
ኦሮሞ	-2667
▁ከአዲስ	-2668
ንታ	-2669
ከላዊ	-2670
▁ሜሲ	-2671
▁አትሌት	-2672
ሰቢያ	-2673
▁መክ	-2674
▁የቦ	-2675
▁መንግስታት	-2676
▁ህብረተሰቡ	-2677
▁ሃይ	-2678
▁ቀላል	-2679
ኖረው	-2680
▁ሀይል	-2681
▁በማን	-2682
▁የሶማ	-2683
ገዳ	-2684
ቶሪ	-2685
▁ደስ	-2686
▁መድረክ	-2687
▁ክርስቲያን	-2688
ነዚህ	-2689
▁በክ	-2690
▁አስተዋ	-2691
▁በአሜሪካ	-2692
▁ለሀ	-2693
▁ተረጋግ	-2694
▁የፊ	-2695
▁ራዲዮ	-2696
▁ደንበ	-2697
▁የመጣ	-2698
▁አረቢያ	-2699
▁ባየር	-2700
▁ይሰጣ	-2701
▁ይደው	-2702
▁ክርስቲያ	-2703
ደርሱ	-2704
:30	-2705
▁ሠራ	-2706
▁ኤር	-2707
▁ገልጿ	-2708
▁ሰም	-2709
▁አለው	-2710
▁ስታዲየም	-2711
ነህ	-2712
▁ሕይወት	-2713
▁መልዕክ	-2714
▁ብላ	-2715
▁ይዘ	-2716
▁አግኝ	-2717
▁ነገሮች	-2718
▁አስመልክቶ	-2719
▁የመጀመሪያው	-2720
▁ብስራት	-2721
▁ስላ	-2722
▁የሚለው	-2723
▁3.	-2724
▁ሆኖም	-2725
40	-2726
▁እንዳስ	-2727
▁ፈር	-2728
▁የመከላከያ	-2729
ናዊው	-2730
▁በአፍሪካ	-2731
▁ለመጀመሪያ	-2732
ፍና	-2733
▁አለማ	-2734
id	-2735
▁ተመሳሳይ	-2736
▁ፖሊ	-2737
▁ሙኒክ	-2738
ub	-2739
▁ለማሳ	-2740
ገስ	-2741
ad	-2742
▁ኔ	-2743
▁የጋ	-2744
▁ዕድል	-2745
▁ግድብ	-2746
▁ማብራ	-2747
▁ከዚያ	-2748
▁ወረርሽኝ	-2749
ገራቸው	-2750
ረዳው	-2751
ምስት	-2752
ዝግ	-2753
▁ህወ	-2754
ማሩ	-2755
▁የተመ	-2756
▁እንደሚገባ	-2757
ጥቅ	-2758
ዲት	-2759
ጣኝ	-2760
ጨት	-2761
oo	-2762
ግባብ	-2763
▁2014	-2764
▁ሲሆኑ	-2765
▁ዝውውር	-2766
▁ማንኛውም	-2767
▁ግንቦት	-2768
ጻሚ	-2769
▁ደብረ	-2770
▁ለቀ	-2771
▁ዳግም	-2772
ሟል	-2773
ጀምር	-2774
ንተ	-2775
ጣሪዎች	-2776
▁ሊጉ	-2777
▁እቃ	-2778
ሐል	-2779
▁ሮናልዶ	-2780
▁ነጥ	-2781
▁ጥንቃቄ	-2782
▁ጂ	-2783
60	-2784
▁የወንጀል	-2785
▁ሞት	-2786
45	-2787
ካን	-2788
ስተዋ	-2789
▁ስፖርት	-2790
ላቁ	-2791
ገነባ	-2792
ec	-2793
ቅድመ	-2794
ከሉ	-2795
▁በዚሁ	-2796
▁40	-2797
▁እድሜ	-2798
ካት	-2799
▁መምህራን	-2800
ንባ	-2801
ቀበ	-2802
▁ዛ	-2803
ፍን	-2804
▁የመሬት	-2805
▁በተደረገ	-2806
ብረተሰብ	-2807
▁የነበሩት	-2808
▁መነሻ	-2809
▁እያደረገ	-2810
▁ከሚያ	-2811
▁ባህ	-2812
▁ተብሏል፡፡	-2813
ሚን	-2814
ሰስ	-2815
▁ሸዋ	-2816
▁ሂደ	-2817
ታን	-2818
ቁም	-2819
ባለው	-2820
▁የምርጫ	-2821
▁ለኢትዮጵያ	-2822
ጠን	-2823
ወያ	-2824
▁ደመ	-2825
▁ጭማሪ	-2826
▁ኬንያ	-2827
▁ማም	-2828
ጋይ	-2829
ጀርመን	-2830
▁ቡድኖች	-2831
ላትን	-2832
▁ኦሮ	-2833
ንብ	-2834
▁መገኘ	-2835
▁ያደረጉ	-2836
▁እንደገለ	-2837
ህሳስ	-2838
▁የፌዴራል	-2839
ያም	-2840
መለከተው	-2841
ድረስ	-2842
▁አስታውቀዋል።	-2843
ቧል	-2844
▁መስራት	-2845
▁የዕ	-2846
ሪን	-2847
ሊክ	-2848
ጠበቀ	-2849
▁ሻምፒየንስ	-2850
▁ጆር	-2851
▁መንገዶች	-2852
ጠናቀቀ	-2853
▁ተከላ	-2854
▁የቴ	-2855
▁ተሳታ	-2856
▁በግል	-2857
ያጭ	-2858
ንካራ	-2859
▁ይታወቃል።	-2860
ቻለ	-2861
▁ካሳ	-2862
▁ደስታ	-2863
ዮር	-2864
ጠኞች	-2865
▁እንደሚያስ	-2866
ናገር	-2867
▁ማህበራዊ	-2868
▁ቅድመ	-2869
▁በሁለት	-2870
የአ	-2871
▁ቢያንስ	-2872
ኖሪያ	-2873
መለከት	-2874
ሰጣቸው	-2875
▁ተጠቅ	-2876
▁ዓይነት	-2877
▁የሰሜን	-2878
▁ቀጠሮ	-2879
▁ተቀብ	-2880
17	-2881
▁ክለቡ	-2882
ማው	-2883
ቁር	-2884
ቪል	-2885
35	-2886
▁ችለዋል።	-2887
▁ለት	-2888
▁አሰራ	-2889
/2015	-2890
▁ጎንደር	-2891
▁ማብራሪያ	-2892
ጣሚ	-2893
▁ጉዳዩን	-2894
ዊት	-2895
▁መጋቢት	-2896
▁ስምንት	-2897
▁እስኪ	-2898
▁ሰዓ	-2899
▁ባለሥ	-2900
▁ጌታቸው	-2901
ወለ	-2902
▁ግጭ	-2903
▁ገብረ	-2904
▁ጭምር	-2905
ትስ	-2906
ደረሱ	-2907
ካተ	-2908
ቋቋም	-2909
▁ሚል	-2910
▁አብዛ	-2911
▁ጨዋታውን	-2912
ጣጫ	-2913
ያው	-2914
▁የመግ	-2915
ጣራ	-2916
ሳተፍ	-2917
▁የተሻለ	-2918
ዱስትሪ	-2919
▁200	-2920
▁አድርገው	-2921
▁ተከታታይ	-2922
▁የእስራኤል	-2923
▁ተሰጥ	-2924
▁የሚገ	-2925
▁የለም።	-2926
▁ከብ	-2927
▁ያላቸውን	-2928
ፈጸም	-2929
▁የግብ	-2930
▁ጠቁመዋል።	-2931
ig	-2932
ቂቅ	-2933
ንና	-2934
▁እምነት	-2935
▁የሚቆጠሩ	-2936
▁የተሰኘ	-2937
ሻል	-2938
▁ታዳጊ	-2939
▁አውሮፕላን	-2940
▁የሚያደርጉ	-2941
▁ቤን	-2942
▁ፌዴ	-2943
▁የተለ	-2944
▁የሰብዓዊ	-2945
ዳንቱ	-2946
▁በምር	-2947
▁ይዘው	-2948
▁የተገኘ	-2949
▁ተናግረዋል	-2950
200	-2951
▁የጣ	-2952
ፕሎ	-2953
▁ሽን	-2954
▁አስፈፃሚ	-2955
ላህ	-2956
ውና	-2957
ሄዱ	-2958
ገባት	-2959
▁ሰፊ	-2960
▁ተወስ	-2961
▁ኮር	-2962
/2014	-2963
▁እንደማ	-2964
ባባሪ	-2965
▁አባት	-2966
▁ሰኞ	-2967
ንድሮው	-2968
▁መንግሥ	-2969
▁ወታደሮች	-2970
▁ሕግ	-2971
▁ማረፊያ	-2972
▁የነዳጅ	-2973
▁ዝቅ	-2974
▁መርሃ	-2975
▁የአር	-2976
▁አቅጣጫ	-2977
▁ቀሪ	-2978
▁ስለዚህ	-2979
39	-2980
eb	-2981
▁ማስታወቂያ	-2982
▁በሃ	-2983
▁የምና	-2984
ታዉ	-2985
▁ለመፍታት	-2986
ጠባ	-2987
ዓለም	-2988
ጊዜው	-2989
▁አድራሻ	-2990
▁ኤሌክትሪክ	-2991
ከባ	-2992
▁ከመረብ	-2993
ካታ	-2994
▁የትራፊክ	-2995
▁የተባበሩት	-2996
▁ርዕሰ	-2997
ሲል	-2998
ጎች	-2999
▁2013	-3000
▁መያዛቸው	-3001
▁ተገልጿል፡፡	-3002
ራች	-3003
▁የመስ	-3004
▁ደጋፊዎች	-3005
▁ካም	-3006
▁ተመልክ	-3007
▁ስደ	-3008
ሳቁ	-3009
28	-3010
▁ኒው	-3011
▁ሚንስት	-3012
▁ይደውሉ	-3013
ፌሰር	-3014
▁ባደረገው	-3015
ግብር	-3016
▁በቀጣ	-3017
▁አዘጋጅ	-3018
▁በበኩላቸው	-3019
ጋል	-3020
▁በትላንትናው	-3021
▁ስርዓ	-3022
▁ውድድ	-3023
.....	-3024
ሰልጣ	-3025
▁ሀብ	-3026
▁በህገ	-3027
▁ፋብሪካ	-3028
▁በን	-3029
▁እያለ	-3030
▁አከባቢ	-3031
▁ሶስተኛ	-3032
ወደ	-3033
ሯል፡፡	-3034
▁በመሆኑም	-3035
44	-3036
ሰለ	-3037
ካኤል	-3038
un	-3039
▁ጎን	-3040
ሎምፒ	-3041
▁ለገ	-3042
▁ኮማን	-3043
ሪት	-3044
▁እንደምት	-3045
▁ጀም	-3046
ረጋጋት	-3047
መዘገቡ	-3048
ነበረ	-3049
▁ህጋዊ	-3050
▁ኮሌጅ	-3051
ሽቱ	-3052
▁የሚመ	-3053
ጪው	-3054
ቡቲ	-3055
ታወቁ	-3056
▁ሁሉንም	-3057
▁አማራጭ	-3058
▁ፒኤስጂ	-3059
ዮርጊ	-3060
▁ያስተ	-3061
▁የሱዳን	-3062
▁መልስ	-3063
▁ተሽከርካሪዎች	-3064
ጣን	-3065
ነትና	-3066
ያዘው	-3067
▁ጊዜያዊ	-3068
▁አገራት	-3069
▁የፖሊስ	-3070
ሮን	-3071
▁እዚህ	-3072
▁ትዕዛዝ	-3073
▁የዜ	-3074
ይናንስ	-3075
▁”	-3076
ፈፀም	-3077
▁መሪዎች	-3078
ማል	-3079
ጂታል	-3080
▁ገደ	-3081
▁ጥራት	-3082
▁ሀብት	-3083
▁ተደራ	-3084
ቴን	-3085
ች።	-3086
ነራል	-3087
▁ካርድ	-3088
▁ተደርጓል።	-3089
ቆስ	-3090
ቀፍ	-3091
▁n	-3092
በአ	-3093
መልከ	-3094
▁በትምህርት	-3095
▁በፕ	-3096
▁የጠ	-3097
ቀም	-3098
▁ደርሶ	-3099
▁አድርገዋል።	-3100
ጀመረው	-3101
ሕር	-3102
መራው	-3103
▁ነው፤	-3104
ረክ	-3105
ag	-3106
▁ይልቅ	-3107
ሸጥ	-3108
▁በነበረው	-3109
▁ፍሬ	-3110
▁አስቆጥ	-3111
▁ስምም	-3112
▁የሚጠ	-3113
▁ድምጽ	-3114
▁ሶማ	-3115
▁ማሻሻያ	-3116
ግባር	-3117
▁ትል	-3118
▁ወገኖች	-3119
▁ቻይና	-3120
▁የሚያደርግ	-3121
▁የድር	-3122
▁መግቢያ	-3123
▁ጨምረው	-3124
▁መሆኑንም	-3125
▁ወቅታዊ	-3126
im	-3127
ሰረ	-3128
ቃወ	-3129
ዎች፣	-3130
ሳዊ	-3131
ዳረ	-3132
▁ዊ	-3133
▁አትሌቲ	-3134
▁1,	-3135
▁አቅርቦት	-3136
ዶችን	-3137
▁ባደረጉት	-3138
▁ልብ	-3139
▁ተፈናቃ	-3140
▁መላ	-3141
▁ምዕራብ	-3142
▁በመንግስት	-3143
ሃት	-3144
ቀደ	-3145
ጠራው	-3146
ሴን	-3147
ስማ	-3148
▁ነን	-3149
ቀላቀል	-3150
▁ሊሆን	-3151
ባይል	-3152
▁አጥቂ	-3153
▁ኤምባሲ	-3154
▁አንስተ	-3155
▁ቤተክርስቲያን	-3156
በታል	-3157
▁የኮቪድ	-3158
ቃቸው	-3159
▁ተጠያቂ	-3160
▁በካ	-3161
▁አመቱ	-3162
▁ሙስ	-3163
▁ሚና	-3164
▁ይደረጋ	-3165
▁የህግ	-3166
▁እረፍት	-3167
▁በወቅቱ	-3168
ፎር	-3169
ደርገ	-3170
▁ምት	-3171
ታሉ	-3172
ቀላቀሉ	-3173
▁ተሳትፎ	-3174
▁l	-3175
መልስ	-3176
በራቸው	-3177
▁የቱ	-3178
▁ፕሪሚየር	-3179
▁በጦር	-3180
ኩን	-3181
ጋንዳ	-3182
በተ	-3183
ers	-3184
ዮርጊስ	-3185
▁በቀለ	-3186
▁ሰል	-3187
▁የሟ	-3188
ዚቃ	-3189
▁እንዲቀ	-3190
▁ትራንስፖርት	-3191
ጎዳ	-3192
▁የሙ	-3193
▁ጫና	-3194
ነቶች	-3195
ከታተል	-3196
21	-3197
▁በፍጥነት	-3198
ፕሎማ	-3199
▁በቤ	-3200
ጥም	-3201
▁አስቸኳይ	-3202
▁የን	-3203
2016	-3204
▁ሰሜን	-3205
▁ቅርንጫ	-3206
ገደሉ	-3207
▁በቀጥታ	-3208
ንቀሳቀሱ	-3209
▁ፍቃድ	-3210
▁ይጠበቃል።	-3211
▁የውሃ	-3212
▁የሚወስ	-3213
▁ስትል	-3214
▁ታውቋል።	-3215
▁ወርቅ	-3216
▁መጀመሪያ	-3217
▁እሱ	-3218
ዲና	-3219
ችኋ	-3220
▁የሳ	-3221
ዲን	-3222
▁ከዛሬ	-3223
▁የትራንስፖርት	-3224
▁ስሜት	-3225
በታ	-3226
▁መተግ	-3227
ለል	-3228
ኖስ	-3229
ፋን	-3230
▁ያው	-3231
▁ብዛት	-3232
▁ወዲህ	-3233
▁በሰሜን	-3234
▁የሚሆን	-3235
ጅቱ	-3236
ገኙት	-3237
▁መስቀል	-3238
ከናወነ	-3239
▁ተሰማ	-3240
▁ሳምንታት	-3241
▁ኢትዮጵያን	-3242
ላሉ።	-3243
▁ይፈ	-3244
ብሮ	-3245
ሞኑን	-3246
▁የምርመራ	-3247
▁የቢ	-3248
▁ጉብኝ	-3249
▁ትራምፕ	-3250
▁የጨዋታ	-3251
▁ይችላሉ	-3252
▁ታደሰ	-3253
▁አዳዲስ	-3254
▁ተቋሙ	-3255
▁ተገለጸ	-3256
ገኙበት	-3257
ኒው	-3258
▁ያመ	-3259
▁ሊዮ	-3260
▁የመን	-3261
▁ሳው	-3262
▁ተመር	-3263
▁የአካል	-3264
▁ነበሩ	-3265
▁ከዛ	-3266
▁ጠንካራ	-3267
80	-3268
ረግ	-3269
▁ትብብር	-3270
ተናል	-3271
▁አቻ	-3272
▁የሚሰራ	-3273
elegram	-3274
▁ወሳኝ	-3275
▁ነዳጅ	-3276
▁ወደፊት	-3277
-2	-3278
▁ተባለ	-3279
▁ለፍ	-3280
▁የመሐል	-3281
▁ገዳ	-3282
▁ዘጠኝ	-3283
በረሰቡ	-3284
▁አብረ	-3285
----------------	-3286
ቆያ	-3287
▁አስረድተዋል።	-3288
ሳል	-3289
ነገ	-3290
ብራቶሪ	-3291
ንነት	-3292
ስተካ	-3293
▁ሰአት	-3294
▁መረጃዎችን	-3295
ሐመድ	-3296
ጥፋት	-3297
▁በሀገር	-3298
▁መብቶች	-3299
▁አርብ	-3300
▁የሚገኝ	-3301
ወራ	-3302
▁ወዳ	-3303
▁ተቀባይ	-3304
ቆይ	-3305
▁ይቅርታ	-3306
ላሴ	-3307
ረጋገጠ	-3308
▁ስብስ	-3309
ባባ	-3310
▁ፈጣሪ	-3311
ጠለ	-3312
ore	-3313
▁ያገኘነው	-3314
▁የአደጋ	-3315
▁ኮሚሽነር	-3316
ዝና	-3317
▁ሕዝ	-3318
▁በቀን	-3319
በሳ	-3320
▁ሀያ	-3321
▁በመገኘ	-3322
ዬን	-3323
▁የሚችል	-3324
▁ኮንትራት	-3325
▁ፕሮጀክ	-3326
▁ለመቀ	-3327
▁ለሰ	-3328
▁ተያይዞ	-3329
▁በመስጠት	-3330
▁ሩሲያ	-3331
▁በረራ	-3332
▁መከላከል	-3333
▁እስር	-3334
ዎችና	-3335
▁ቀይ	-3336
▁ተፈታ	-3337
በርካታ	-3338
▁እቅድ	-3339
▁ህፃናት	-3340
▁ፉ	-3341
▁ሐምሌ	-3342
ሴቶች	-3343
▁ጉዳዩ	-3344
▁ፖለቲካ	-3345
▁ይመስላል	-3346
ከው	-3347
▁ክብር	-3348
▁ቲክቫህ	-3349
▁አቀባ	-3350
▁አይደለም።	-3351
▁ጥቅ	-3352
▁ረቂቅ	-3353
▁መጣ	-3354
▁ታስ	-3355
ተሻ	-3356
ግስት	-3357
ኒስት	-3358
ድድሩ	-3359
ዮቹ	-3360
ቀን	-3361
መለከታቸው	-3362
ለኛ	-3363
ላሳ	-3364
▁እንዳለው	-3365
ሁፍ	-3366
▁በገ	-3367
መለክ	-3368
ቋረጥ	-3369
▁ለሌ	-3370
▁ይፈልጋ	-3371
▁ከግ	-3372
▁ለማስፈረም	-3373
የተ	-3374
ሐሴ	-3375
ድኑ	-3376
▁አማካኝነት	-3377
70	-3378
▁ግብረ	-3379
▁ህዳር	-3380
ውሰድ	-3381
▁ሠራዊት	-3382
▁ቦር	-3383
▁መሰል	-3384
ኮት	-3385
▁የወሰ	-3386
▁ዕጣ	-3387
▁4.	-3388
▁ከቀኑ	-3389
▁ብለዋል	-3390
ሻንጉ	-3391
ዘነጋ	-3392
ረዋል።	-3393
▁አልፎ	-3394
▁ድርሻ	-3395
▁ድርድር	-3396
ፌስቡክ	-3397
▁ቁሳቁ	-3398
ደንት	-3399
ማርኛ	-3400
▁ትክክለኛ	-3401
ቀመጥ	-3402
ዊተር	-3403
▁ሲኖ	-3404
▁ምድብ	-3405
ምቤላ	-3406
▁በላ	-3407
▁ናቸው፡፡	-3408
ce	-3409
ም፤	-3410
▁አላማ	-3411
▁h	-3412
▁ብቸ	-3413
ረታ	-3414
▁ንጉ	-3415
▁አለን	-3416
ጁን	-3417
ሪዝም	-3418
ሶችን	-3419
▁በሞ	-3420
▁የዝውውር	-3421
▁ፕሮጀክት	-3422
▁ገና	-3423
▁መድረሱን	-3424
▁አስፈጻሚ	-3425
▁መደረጉን	-3426
▁ኮሚሽኑ	-3427
ሺህ	-3428
▁ብርሃ	-3429
▁በመተባበር	-3430
▁በቴሌ	-3431
▁ፕሮግራ	-3432
▁ህይወቱ	-3433
▁ፕሮፌሰር	-3434
▁እንዳለበት	-3435
ንቱስ	-3436
▁ካሉ	-3437
▁ተቀም	-3438
▁e	-3439
▁አብዱ	-3440
▁በተከሰ	-3441
▁በመግባት	-3442
▁የሕዝብ	-3443
ኖችን	-3444
▁በመስ	-3445
▁ቀጣ	-3446
▁አስተዳዳሪ	-3447
▁ድረ	-3448
!"	-3449
▁ጥያቄዎች	-3450
▁አስኪያ	-3451
▁ይገኛሉ	-3452
ረምት	-3453
ጠናከር	-3454
ወል	-3455
ድም	-3456
ዚአብ	-3457
▁የሚታወ	-3458
ፈታ	-3459
▁ከሁለት	-3460
▁ድንበር	-3461
▁ሲሆን፤	-3462
▁መሞ	-3463
ረበ	-3464
ቻይና	-3465
▁አንተ	-3466
ዓመቱ	-3467
ነጋገር	-3468
▁አጋር	-3469
ቋሙ	-3470
ከታተሉ	-3471
▁የአካባቢው	-3472
▁እውነ	-3473
▁በሁለቱ	-3474
▁የበለጠ	-3475
ጋጠመው	-3476
▁መኮንን	-3477
▁ከሳ	-3478
ሻሻል	-3479
▁ጽህፈት	-3480
ቨስት	-3481
▁ነበረ	-3482
▁ታማ	-3483
▁የሚሰጥ	-3484
▁የኦሮሞ	-3485
▁የህወ	-3486
▁th	-3487
▁ለማወቅ	-3488
▁ልምምድ	-3489
▁የተናገሩት	-3490
ሴት	-3491
99	-3492
ንዛ	-3493
ጦታ	-3494
500	-3495
ቀረበ	-3496
▁ከሌሎች	-3497
▁ይቻ	-3498
thi	-3499
ጨመረ	-3500
▁ጠዋት	-3501
ሮቹ	-3502
▁ሰጥተዋል።	-3503
▁መብራት	-3504
▁በከተማዋ	-3505
▁ተሰምቷል።	-3506
100	-3507
▁ሀገራ	-3508
ድሜ	-3509
ናትን	-3510
▁የማህበራዊ	-3511
▁ይገኛል፡፡	-3512
▁ማለፉን	-3513
▁ስርጭት	-3514
▁ተቃውሞ	-3515
▁ከተለያዩ	-3516
▁ማስቆጠር	-3517
▁የዳ	-3518
ገንባት	-3519
▁የሚታ	-3520
▁አሕ	-3521
ቲን	-3522
▁ሚልዮን	-3523
ጉም	-3524
ሻገር	-3525
ርቶዶ	-3526
▁ህል	-3527
▁ብሩ	-3528
ቆች	-3529
▁ይታወሳል፡፡	-3530
ፋሪ	-3531
▁ክስተ	-3532
▁ስልጣን	-3533
ch	-3534
▁ዘመናዊ	-3535
ጠናቀቁ	-3536
▁ይቀጥ	-3537
▁ምስጋና	-3538
ጀመሩ	-3539
▁አታ	-3540
▁ይኖ	-3541
▁ብለን	-3542
▁የተኩስ	-3543
▁አክለ	-3544
ሰኞ	-3545
▁የዋጋ	-3546
ፈጸመ	-3547
77	-3548
▁ግም	-3549
ኝም	-3550
ን፣	-3551
▁ባሳ	-3552
ጀንቲ	-3553
▁መልቀ	-3554
ዳና	-3555
▁ኤል	-3556
ፖሊ	-3557
ልስጤ	-3558
▁የኮሚ	-3559
▁በድጋሚ	-3560
▁ብራዚ	-3561
▁አንደኛ	-3562
▁ሳያ	-3563
▁የእር	-3564
ሳሰብ	-3565
ሎምፒክ	-3566
▁ልምድ	-3567
▁ያገኛ	-3568
▁አቅርበዋል።	-3569
ሳሌ	-3570
▁ቪላ	-3571
የቱን	-3572
▁ማይ	-3573
▁አቀባይ	-3574
ሊንግ	-3575
▁ግዜ	-3576
ለበት	-3577
ኔራል	-3578
▁ሀዋሳ	-3579
ist	-3580
ገናኘ	-3581
▁ንብረ	-3582
ህና	-3583
ለቅ	-3584
▁የሚደረግ	-3585
▁ኮማንደር	-3586
ክሬ	-3587
በራት	-3588
▁ገልጿል፡፡	-3589
ንጋ	-3590
▁መልሶ	-3591
▁ተማሪዎቹ	-3592
?"	-3593
pp	-3594
ዮችን	-3595
ቃል፡፡	-3596
▁ተቋማ	-3597
▁እያንዳን	-3598
ፍቶ	-3599
ተኛው	-3600
▁0-0	-3601
▁ሀሰተኛ	-3602
▁ሊዮኔል	-3603
ሰና	-3604
ላዊው	-3605
▁ካምፓ	-3606
▁ልብስ	-3607
▁ባለፈ	-3608
▁በሰጠው	-3609
ጠንቀ	-3610
▁በዕ	-3611
ኖራቸው	-3612
ጣጥ	-3613
▁የከፍተኛ	-3614
▁ማረጋገ	-3615
ab	-3616
▁እንግሊዝ	-3617
ው።	-3618
▁ሪፖር	-3619
▁ለበለጠ	-3620
▁አስታዉ	-3621
ሃብ	-3622
ቀዋል፡፡	-3623
▁አንስቶ	-3624
▁የሚለውን	-3625
▁ተጠባቂ	-3626
▁የተባሉ	-3627
ገበው	-3628
ገተኛ	-3629
▁ጠይቀዋል።	-3630
▁ተቀባይነት	-3631
▁አደጋው	-3632
ተኮ	-3633
▁ለመግ	-3634
ጣቸው	-3635
▁አርባ	-3636
▁ለአንድ	-3637
▁መንፈ	-3638
▁በነገው	-3639
ፈዋል።	-3640
▁ሰብዓዊ	-3641
▁70	-3642
ሻንጉል	-3643
ቃቂ	-3644
▁መሀመድ	-3645
▁ዩሮ	-3646
▁የስፖርት	-3647
▁ለመቆጣጠር	-3648
▁ተግባራት	-3649
ሆስፒ	-3650
▁ችሎ	-3651
com	-3652
በረታ	-3653
ታቸዉ	-3654
▁ገፅ	-3655
▁አነ	-3656
▁ሃሳብ	-3657
▁መረጃው	-3658
▁እንዳያ	-3659
▁የሚችሉ	-3660
▁ዩናይት	-3661
▁የቀድሞው	-3662
▁60	-3663
▁ዓላማ	-3664
▁የቅድመ	-3665
ሀን	-3666
ርሲ	-3667
ይታ	-3668
▁ይታ	-3669
▁በአሁን	-3670
▁ባስ	-3671
▁ለቲክቫህ	-3672
ረዋል	-3673
ረጅም	-3674
▁ልት	-3675
▁ራሱን	-3676
▁500	-3677
▁እንደሚችሉ	-3678
▁ምንድ	-3679
▁ይኖር	-3680
2014	-3681
▁ተጠርጣሪዎች	-3682
ፈለጉ	-3683
▁ለሚያ	-3684
▁እንግሊ	-3685
▁ፓርቲዎች	-3686
ሳይንስ	-3687
▁ልዩነት	-3688
ቤቶች	-3689
▁ሊቀመን	-3690
ቅርብ	-3691
▁ማው	-3692
ሁት	-3693
▁ጎል	-3694
ዳቸውን	-3695
ሩም	-3696
ተኞችን	-3697
▁መጠቀም	-3698
ኝታ	-3699
2015	-3700
▁እንዲያደርጉ	-3701
▁አርቴ	-3702
▁ግንባር	-3703
▁አሰልጣኙ	-3704
ረፋ	-3705
▁በሊጉ	-3706
ቶኒ	-3707
▁መሰረ	-3708
▁በአን	-3709
▁ተል	-3710
▁የተመረ	-3711
ንዶች	-3712
▁አሳስቧል።	-3713
ረኛ	-3714
ጻጸ	-3715
▁መያዙ	-3716
▁በሰው	-3717
▁መስተዳድር	-3718
▁ከጠ	-3719
▁መጠየ	-3720
▁አሰራር	-3721
ናቱ	-3722
▁ወለጋ	-3723
▁ርቀት	-3724
▁ታህሳስ	-3725
▁በተደረገው	-3726
▁በምን	-3727
▁ኢንስቲት	-3728
▁አለብን	-3729
▁ካፕ	-3730
ዜአ	-3731
▁ውድቅ	-3732
▁አሕመድ	-3733
▁ለማን	-3734
▁እውቅና	-3735
ሲብ	-3736
ኖቹ	-3737
ter	-3738
▁በቡ	-3739
▁2012	-3740
▁ተመራቂ	-3741
▁አግባብ	-3742
ቸጋሪ	-3743
▁ወሎ	-3744
ስኮ	-3745
ጣቱ	-3746
▁በበኩሉ	-3747
ዘጋጁ	-3748
▁መኖር	-3749
▁ክፍት	-3750
▁በመም	-3751
▁ባህል	-3752
በስ	-3753
▁መደ	-3754
ገልግሎት	-3755
ረከ	-3756
os	-3757
ኬል	-3758
▁ጅማ	-3759
▁እውነት	-3760
ይህ	-3761
▁ስጋ	-3762
ዘጋጀው	-3763
▁ያሳያል።	-3764
▁ችሏል	-3765
▁የሚተ	-3766
ካሄዱ	-3767
▁አይዘነጋ	-3768
▁ያለፈ	-3769
ወሰነ	-3770
▁በህግ	-3771
ሳችሁ	-3772
▁ከል	-3773
▁ሰዓታት	-3774
▁አስፈላጊውን	-3775
▁መቼ	-3776
መቻ	-3777
▁ብዙሃን	-3778
ል፤	-3779
▁ተናገሩ	-3780
▁የኤርትራ	-3781
▁ጠብ	-3782
▁ዝናብ	-3783
▁ቢሊየን	-3784
ዛው	-3785
▁ክህ	-3786
▁ሲያስ	-3787
▁ኮከብ	-3788
ስትራ	-3789
▁በሶማ	-3790
▁ጥቂት	-3791
▁አባቶች	-3792
▁ቻናል	-3793
▁ምክንያቱም	-3794
ፈኞቹ	-3795
▁ለስ	-3796
▁ይጀም	-3797
▁መታወቂያ	-3798
ምቦ	-3799
ዚአብሔር	-3800
▁ተጠቁሟል።	-3801
▁ላይም	-3802
ግባቡ	-3803
▁መተግበሪያ	-3804
▁መሃ	-3805
▁መቀመ	-3806
▁ኤሪክ	-3807
▁መቻ	-3808
ፈፀመ	-3809
ሊዮን	-3810
▁እንስ	-3811
▁35	-3812
ለጥ	-3813
ሐፍ	-3814
ኝ።	-3815
ፈልገው	-3816
▁የሁለት	-3817
ለዉ	-3818
▁አና	-3819
▁መድኃ	-3820
▁ይሆን	-3821
▁ያስፈልጋ	-3822
▁ያደረገው	-3823
▁ለኢ	-3824
▁ሞገስ	-3825
▁በኮቪድ	-3826
▁ለመስራት	-3827
ሎን	-3828
▁ወረቀት	-3829
ክኒክ	-3830
▁ወድ	-3831
ity	-3832
▁ኮሪያ	-3833
ውልድ	-3834
▁ለንደ	-3835
ኒቨርሲቲው	-3836
▁ለመመለስ	-3837
▁የማህ	-3838
▁በአለም	-3839
እምሮ	-3840
▁ኢኮኖሚ	-3841
▁is	-3842
ርጦ	-3843
▁ህንፃ	-3844
▁ሲሉም	-3845
▁የሊጉ	-3846
ርላማ	-3847
▁ብት	-3848
▁የኔ	-3849
▁ተዘግቧል።	-3850
▁የሸ	-3851
▁ፍራ	-3852
▁እያስ	-3853
ri	-3854
ሚር	-3855
▁ሊንክ	-3856
▁ኮርፖ	-3857
▁ቋሚ	-3858
▁የባለ	-3859
ሪቱን	-3860
▁መንገዱ	-3861
▁የሚባል	-3862
29	-3863
ናቸውን	-3864
▁ገደብ	-3865
▁ሲሆን፣	-3866
▁ጥፋ	-3867
▁ጣል	-3868
▁በፓ	-3869
▁ሰነድ	-3870
▁ጊዮርጊስ	-3871
ጥን	-3872
ረንሳ	-3873
▁ሲነ	-3874
ቂጤ	-3875
ችለው	-3876
ሰብሰብ	-3877
ርቶዶክስ	-3878
▁ተጎ	-3879
ቀስ	-3880
ታችሁ	-3881
ጠነ	-3882
▁አቤ	-3883
▁ከኮ	-3884
▁መልክ	-3885
ሸት	-3886
ሆናቸው	-3887
▁የአል	-3888
▁መጀመሩን	-3889
▁ሠራተኞች	-3890
▁ላለፉት	-3891
ገለፅ	-3892
▁በጉዳዩ	-3893
ሸነፊያ	-3894
▁ምዕራ	-3895
ነታቸውን	-3896
ዳል	-3897
▁ሀሳ	-3898
ሆነው	-3899
▁ህጻናት	-3900
▁የሚሆኑት	-3901
▁አስቀድሞ	-3902
▁እንድታ	-3903
▁ስለተ	-3904
▁ኢንዱስትሪ	-3905
ችልም	-3906
▁ታይ	-3907
▁ቀዳሚ	-3908
በዋል፡፡	-3909
▁ማድረጉን	-3910
▁ሚዲያዎች	-3911
▁እንደሚሰጥ	-3912
▁ኳ	-3913
ቢዎች	-3914
▁መስጠ	-3915
▁ጋርዲዮ	-3916
▁ማድረጋ	-3917
▁የላብራቶሪ	-3918
ቨርተን	-3919
▁ክልላዊ	-3920
▁ይህንንም	-3921
▁ያስቆ	-3922
▁ስቴትስ	-3923
▁የሚገኙት	-3924
ፀጥታ	-3925
▁በመያዝ	-3926
▁ሰለሞን	-3927
▁በዋና	-3928
▁ወንዶች	-3929
▁አንድነት	-3930
▁ኮሙ	-3931
▁ፈቃ	-3932
▁እኮ	-3933
▁ጉድ	-3934
▁የማሸነፊያ	-3935
ገራቸውን	-3936
▁Telegram	-3937
ጦች	-3938
ዋቂ	-3939
ወሰዱ	-3940
ውንት	-3941
▁የኃ	-3942
▁አለባቸው	-3943
በልጥ	-3944
▁ለጥ	-3945
▁የሚሉ	-3946
▁2017	-3947
ጋዬ	-3948
ፈተ	-3949
▁ሚያ	-3950
▁ለአዲስ	-3951
ጓዙ	-3952
▁በነፃ	-3953
▁g	-3954
መዝገብ	-3955
ምምነት	-3956
▁በአግባቡ	-3957
▁በስተ	-3958
ላይን	-3959
ወሰደ	-3960
ያዎች	-3961
▁የሰብአዊ	-3962
ቃቱ	-3963
▁ዎ	-3964
▁እንዳሉ	-3965
▁ጉብኝት	-3966
▁ጣቢያዎች	-3967
86	-3968
በን	-3969
ገዝ	-3970
ቻለም	-3971
▁ኒውካ	-3972
▁ዋስትና	-3973
▁ዜጎችን	-3974
▁የሴቶች	-3975
▁የክልል	-3976
ፌዴሪ	-3977
ለን፡፡	-3978
▁re	-3979
▁አርቲ	-3980
▁ራስ	-3981
▁በድር	-3982
▁አሊ	-3983
ቀኑ	-3984
ነብ	-3985
ቲንግ	-3986
▁ከጎ	-3987
▁ማለዳ	-3988
▁የኢትዮ	-3989
▁ድርጅቱ	-3990
▁ጠይቋል።	-3991
ቆት	-3992
ችውን	-3993
▁ቦሌ	-3994
▁ሰጥቷል።	-3995
▁አቡነ	-3996
▁ያለመ	-3997
ዋር	-3998
ዩብ	-3999
▁90	-4000
▁ሳን	-4001
▁ከእስር	-4002
▁ሚንስትር	-4003
ገናኝ	-4004
▁የወደ	-4005
▁በነበረ	-4006
▁በምት	-4007
ወዝ	-4008
ናቀሉ	-4009
▁አቀፉ	-4010
▁ለንደኑ	-4011
▁እንዲደረግ	-4012
▁እናም	-4013
▁የመው	-4014
▁አስቶን	-4015
▁ዝግጅ	-4016
▁ከምሽቱ	-4017
ሃም	-4018
▁ናይ	-4019
▁ድልድ	-4020
▁ኃላፊነት	-4021
ሱስ	-4022
▁አዳማ	-4023
▁እያደረጉ	-4024
▁በአውሮፓ	-4025
ፃፀ	-4026
ተኝነት	-4027
ገመ	-4028
▁ብርሃን	-4029
▁ክብ	-4030
▁መንስ	-4031
ላክቷል።	-4032
▁አንቶኒ	-4033
ስታን	-4034
▁ማራ	-4035
▁ከኢ	-4036
▁መሐመድ	-4037
ዕኖ	-4038
▁ዳን	-4039
▁እንደሚሆን	-4040
ላለፈ	-4041
▁የመረጃ	-4042
▁ፌዴሬሽን	-4043
ከን	-4044
2013	-4045
▁ታግ	-4046
ቀሰ	-4047
▁us	-4048
▁መዘ	-4049
▁ህዝቦች	-4050
▁ኢትዮጵያዊያን	-4051
▁ጋርዲዮላ	-4052
ምስ	-4053
ly	-4054
▁አቋም	-4055
▁ፍቃ	-4056
ET	-4057
ጋዜ	-4058
▁ሥርዓት	-4059
▁ባይደን	-4060
▁የተቃ	-4061
▁አሰላለፍ	-4062
ክተሩ	-4063
▁ማክሰኞ	-4064
▁ችግሩን	-4065
▁ደስተኛ	-4066
አይ	-4067
▁ፍትህ	-4068
ልጠና	-4069
▁ቴን	-4070
▁አድርጓል	-4071
ንዴ	-4072
ህተት	-4073
▁ሲባል	-4074
▁ችግሩ	-4075
ፍስ	-4076
▁ዝም	-4077
▁አውሮፕላ	-4078
▁ታሪካ	-4079
▁አጋማሽ	-4080
ቨስትመንት	-4081
ዩም	-4082
ቃሉ	-4083
ዛን	-4084
▁እያሳ	-4085
▁ሲኖዶ	-4086
▁አርቴታ	-4087
▁የተለየ	-4088
ው፣	-4089
ጠየቅ	-4090
▁በስፋት	-4091
▁አብሮ	-4092
▁በእንግሊዝ	-4093
ድስ	-4094
▁01	-4095
▁አዲ	-4096
▁ዞኖች	-4097
▁የተሰጠ	-4098
▁የቲክቫህ	-4099
64	-4100
▁በሱዳን	-4101
▁የሩሲያ	-4102
ሞላ	-4103
▁በእር	-4104
▁ይቀላቀሉ	-4105
▁በተገኙበት	-4106
ኤታ	-4107
▁ለሁለት	-4108
▁ትምህርታቸውን	-4109
ደገፍ	-4110
▁ሳቢያ	-4111
▁ገንዘ	-4112
▁ጥገና	-4113
ዩኒኬሽን	-4114
▁የዚህ	-4115
▁ማቅረ	-4116
▁ቫይረሱ	-4117
▁አስተባባሪ	-4118
ላቱ	-4119
▁በዲ	-4120
▁ምርቶች	-4121
▁አሌ	-4122
▁የበላይ	-4123
▁የፈተና	-4124
▁ያለበት	-4125
ጣራት	-4126
▁የልማት	-4127
ወቀ	-4128
▁እንደም	-4129
▁አለፈ	-4130
▁በጅ	-4131
▁የሚኖሩ	-4132
▁እየጨመረ	-4133
▁ቀድሞ	-4134
▁እንዳሉት	-4135
ስትሀም	-4136
▁ትችላ	-4137
▁በፖሊስ	-4138
▁ሥነ	-4139
.5	-4140
ጋን	-4141
ine	-4142
▁ፌስቡክ	-4143
▁መጋ	-4144
▁የተሳ	-4145
▁ቴሌኮም	-4146
▁ሽመልስ	-4147
ess	-4148
▁የተፈጸ	-4149
▁ሀገሪቱ	-4150
▁ተሳታፊ	-4151
▁አስኪያጅ	-4152
▁በውጭ	-4153
ሰመ	-4154
▁ታላቅ	-4155
መኑ	-4156
▁ካሜ	-4157
▁የባህር	-4158
▁ቁር	-4159
▁ተደምጠዋል።	-4160
ሌይ	-4161
▁የመድ	-4162
▁በምዕራብ	-4163
▁ወይዘ	-4164
▁1-0	-4165
▁ሚኒስቴሩ	-4166
▁በመጨረሻ	-4167
ጆቹ	-4168
▁የብሔራዊ	-4169
ረፈ	-4170
▁ዘላቂ	-4171
▁ስታንዳ	-4172
▁አጀ	-4173
▁ትንሽ	-4174
▁ደጋፊ	-4175
37	-4176
ርቹ	-4177
▁ለነ	-4178
▁ሕገ	-4179
▁ምስራቅ	-4180
▁ቀውስ	-4181
▁ገደማ	-4182
ቀና	-4183
▁መድሃ	-4184
ul	-4185
▁አቀባበል	-4186
▁የቤ	-4187
ቸዋል፡፡	-4188
▁ኤርትራ	-4189
▁ሊቀመንበር	-4190
ደቡ	-4191
▁ዘው	-4192
ሪም	-4193
ዘጋጀት	-4194
▁ሰብሳቢ	-4195
▁እንደሆኑ	-4196
▁የሆነውን	-4197
▁በሚቀጥ	-4198
▁for	-4199
▁የእግር	-4200
▁ሳላህ	-4201
ንዳንድ	-4202
▁የሩ	-4203
▁ማለፍ	-4204
▁ተፅ	-4205
▁ሽልማ	-4206
▁አንደ	-4207
▁ሀገራዊ	-4208
▁ማስተማር	-4209
▁አደጋዎች	-4210
▁ለመሆን	-4211
▁አክለውም	-4212
ጭነት	-4213
▁ሆና	-4214
▁በድን	-4215
▁ተገድ	-4216
▁የተከ	-4217
thiop	-4218
▁on	-4219
▁ማርቲ	-4220
▁ተብለው	-4221
▁የተሰራ	-4222
▁እንግሊዛ	-4223
ራል።	-4224
▁80	-4225
▁ይሄን	-4226
▁ሰጪ	-4227
▁ግርማ	-4228
ጨው	-4229
ጠይቅ	-4230
ነች	-4231
▁ቢቢሲ	-4232
▁ከሀገር	-4233
▁ከቀናት	-4234
▁እንዲወጡ	-4235
ሎስ	-4236
ገባቸው	-4237
▁የባህል	-4238
▁ፈጥ	-4239
ወድ	-4240
▁አሻ	-4241
▁በለ	-4242
▁በሲ	-4243
▁የአን	-4244
▁ብርሃኑ	-4245
▁ፈተናው	-4246
ስያ	-4247
ደስ	-4248
▁ሁሌ	-4249
/2013	-4250
▁የለውም	-4251
ሳሽ	-4252
▁ምባ	-4253
▁32	-4254
▁ለሚገኙ	-4255
▁ኃላፊዎች	-4256
▁ሙያ	-4257
ለማችን	-4258
▁ትጥቅ	-4259
ባቸዋል።	-4260
ልበት	-4261
▁እህ	-4262
ሰልጣኝ	-4263
▁ሕይወ	-4264
ut	-4265
ርባ	-4266
▁እየታ	-4267
▁አሽከርካሪዎች	-4268
ታችንን	-4269
▁በርን	-4270
▁ብቃት	-4271
▁ምዘ	-4272
▁ረዳ	-4273
ስክ	-4274
▁ተወዳ	-4275
▁ኢንጂ	-4276
የታቸውን	-4277
▁ደሞዝ	-4278
▁አገልግሎቶች	-4279
▁ምረቃ	-4280
በርግ	-4281
▁አስር	-4282
ንሰር	-4283
▁ዛሬም	-4284
ሙዝ	-4285
ዮሽ	-4286
ይይቱ	-4287
ራሉ	-4288
▁አሳል	-4289
our	-4290
ማግ	-4291
▁ወኪ	-4292
ጨምር	-4293
ህረ	-4294
▁መርሀ	-4295
▁ሰራተኛ	-4296
90	-4297
▁በመል	-4298
▁ግለሰቡ	-4299
▁የወሩ	-4300
▁ማንም	-4301
▁ፊልም	-4302
ፈጸሙ	-4303
▁ማግኘ	-4304
▁በራሱ	-4305
▁ለህዝብ	-4306
▁የዩኒቨርሲቲው	-4307
ቆሙ	-4308
▁የሚያሳይ	-4309
▁ስታንዳርድ	-4310
▁ዘገባው	-4311
ዋቱ	-4312
ገናኙ	-4313
▁ይባ	-4314
▁የተገኘው	-4315
ንኩ	-4316
▁ነሐሴ	-4317
▁ይፋዊ	-4318
መዋል፡፡	-4319
ደታ	-4320
▁ፓት	-4321
▁የሚያሳ	-4322
ብሊክ	-4323
▁45	-4324
▁ሀይሎች	-4325
if	-4326
ከባድ	-4327
ደርሳ	-4328
▁ያመለክ	-4329
▁የሻ	-4330
▁ቦታው	-4331
▁ፓርክ	-4332
▁የተማሪዎች	-4333
▁ከዋ	-4334
▁ተፈጥሮ	-4335
▁ፈረንሳይ	-4336
ይነ	-4337
▁ወሬ	-4338
ራባ	-4339
▁የዞኑ	-4340
ጠንቀቂያ	-4341
▁ድብ	-4342
ል፣	-4343
ተሪ	-4344
ቻችንን	-4345
▁የባንክ	-4346
........	-4347
▁ከባለ	-4348
▁የሽብር	-4349
▁በአስቸኳይ	-4350
ቻለው	-4351
▁ቀጠና	-4352
▁ፕሬዜ	-4353
▁አቅርቧል።	-4354
▁ፈተናውን	-4355
ሮኮ	-4356
የውን	-4357
ያቸውን	-4358
▁ደረሰ	-4359
-3	-4360
ቅምት	-4361
ጣቱን	-4362
▁ማኔ	-4363
▁አስታወቀ፡፡	-4364
▁አረጋ	-4365
▁ከሜዳ	-4366
▁በመገኘት	-4367
ሟል፡፡	-4368
▁የገቡ	-4369
▁ይገኙ	-4370
ድዋ	-4371
መለከቱ	-4372
▁ነጋዴ	-4373
▁ተከላካይ	-4374
▁ውስ	-4375
መዘገበ	-4376
ንዶ	-4377
ምንቱ	-4378
▁አለኝ	-4379
▁የደረሰው	-4380
ናዳ	-4381
ጭበር	-4382
▁መሥ	-4383
▁ግዴ	-4384
▁ለማም	-4385
ጎዱ	-4386
▁ማየት	-4387
26	-4388
▁ጌታ	-4389
ልስፍና	-4390
▁ባለሞ	-4391
▁በዘንድሮው	-4392
▁ኢንስቲትዩት	-4393
▁በሞት	-4394
▁ባሉት	-4395
ባቸዉ	-4396
▁ሽያጭ	-4397
ቃቸውን	-4398
በረከት	-4399
▁ልማ	-4400
▁የሐ	-4401
▁ገጽ	-4402
▁ሀላንድ	-4403
ሮው	-4404
ከም	-4405
▁አንቀ	-4406
▁የተገለፀ	-4407
ሪፍ	-4408
▁ማለትም	-4409
▁ሰላምና	-4410
ጠየቁ	-4411
▁የቁ	-4412
▁ሕክምና	-4413
▁የሌለው	-4414
▁የመኪና	-4415
▁የጊዜ	-4416
ሳሰ	-4417
▁''	-4418
▁በስራ	-4419
▁ተስፋዬ	-4420
ብዛ	-4421
▁ብሄ	-4422
▁አዳራሽ	-4423
መልካ	-4424
▁እንደሚደረግ	-4425
▁ወዲያ	-4426
▁ሰሞኑን	-4427
▁የተፈፀ	-4428
ገም	-4429
መዋል	-4430
▁በቀላሉ	-4431
▁በሶ	-4432
▁ስጦታ	-4433
▁ጠየ	-4434
▁ተጨዋቹ	-4435
▁አማርኛ	-4436
▁ዴሞክራሲ	-4437
ወጣት	-4438
ከናወኑ	-4439
▁አማካይ	-4440
▁እንዳልተ	-4441
▁ብድር	-4442
▁ኃላፊው	-4443
▁አውጥ	-4444
▁በጊዜ	-4445
▁አሁኑ	-4446
▁አበበ	-4447
ሪው	-4448
ላለፉ	-4449
▁ለታ	-4450
▁ኪንግ	-4451
▁በአካል	-4452
ጠዋል	-4453
▁ብሏል	-4454
ሙስና	-4455
ከታታይ	-4456
የትኛውም	-4457
ውንድ	-4458
▁ለዚህም	-4459
▁ቤቶችን	-4460
ቢው	-4461
▁ግብፅ	-4462
▁በሁለተኛ	-4463
▁እንዲሰጥ	-4464
▁ኦርቶዶክስ	-4465
ኳር	-4466
ann	-4467
▁ኮሚኒኬሽን	-4468
ናቅ	-4469
▁የሱ	-4470
ሰባሰብ	-4471
▁አንዳን	-4472
▁ክርስቲያኖ	-4473
▁ደረጃን	-4474
ማግሌ	-4475
ችበት	-4476
▁ነግ	-4477
▁መፍትሔ	-4478
▁ማሳረፍ	-4479
▁ስብስብ	-4480
ድርሻ	-4481
▁መዝገብ	-4482
በጣ	-4483
▁የመል	-4484
ደረሰው	-4485
▁አብር	-4486
▁ባንኩ	-4487
▁ባለሥልጣ	-4488
▁የኢኮኖሚ	-4489
ፋጣኝ	-4490
▁5.	-4491
51	-4492
▁ተር	-4493
▁2011	-4494
▁ማረጋገጫ	-4495
▁በሀገራችን	-4496
ሌን	-4497
▁ጋብ	-4498
▁ሲኖዶስ	-4499
▁የሚገኘ	-4500
ትነት	-4501
▁ክትባት	-4502
▁የክለቡ	-4503
▁ላል	-4504
ከሰት	-4505
ድሮስ	-4506
▁ተበ	-4507
▁አጀንዳ	-4508
ቅናቄ	-4509
ታወቅ	-4510
▁አመልክቷል።	-4511
ደንብ	-4512
▁መቃ	-4513
▁ድሬዳዋ	-4514
ማሪያ	-4515
▁መልእ	-4516
▁ድንቅ	-4517
▁ላሊጋ	-4518
▁በማሸነፍ	-4519
▁አካባቢው	-4520
▁የሶ	-4521
▁ቅርንጫፍ	-4522
▁ለሕ	-4523
▁ሃይሎች	-4524
▁በአፋር	-4525
▁ጆርናል	-4526
▁ሀብታ	-4527
▁ወላጆች	-4528
ሀል	-4529
▁ለተጨማሪ	-4530
ቱንም	-4531
▁የአው	-4532
ቶክ	-4533
▁ደራሲ	-4534
▁መንስኤ	-4535
▁ግለሰቦ	-4536
▁አርጀንቲ	-4537
▁በኦ	-4538
▁እሳ	-4539
▁33	-4540
▁ሳል	-4541
▁ዳኛ	-4542
▁እያሉ	-4543
▁ወገን	-4544
▁ፀጥታ	-4545
▁አውሮፓ	-4546
um	-4547
▁የተፈጠረ	-4548
▁ለሙሉ	-4549
▁አብዲ	-4550
▁የደህንነት	-4551
መውን	-4552
▁ሌሎችም	-4553
▁በህይወት	-4554
ከሩ	-4555
ጉት	-4556
ቶቻችን	-4557
ወርቅ	-4558
ጃቸው	-4559
ፋቸውን	-4560
▁ፍተሻ	-4561
▁የኬንያ	-4562
ላል፡፡	-4563
▁መመለስ	-4564
ቢቢሲ	-4565
▁የር	-4566
▁በአስ	-4567
▁ፖሊሲ	-4568
▁ኦሎምፒክ	-4569
▁የአስቸኳይ	-4570
ላጭ	-4571
all	-4572
ወስድ	-4573
▁ጥይት	-4574
▁ሰንጠረ	-4575
▁ተኩስ	-4576
▁ተመዝግ	-4577
▁ተነገረ	-4578
ያሜ	-4579
▁በልዩ	-4580
▁ካለው	-4581
▁አላቸው	-4582
▁ተገኝተው	-4583
ናችን	-4584
▁ቢሮው	-4585
▁አንፃ	-4586
ንቀሳቀስ	-4587
▁ማእ	-4588
▁በውድድር	-4589
ሊቲ	-4590
ሎም	-4591
ፓን	-4592
ube	-4593
▁ምድር	-4594
▁የተመሰ	-4595
▁የተጠረ	-4596
▁አሳውቀዋል።	-4597
ቦር	-4598
▁ከሚገኙ	-4599
▁ተፈናቃዮች	-4600
▁ይችላል።	-4601
07	-4602
▁300	-4603
▁የማያ	-4604
ፍያ	-4605
red	-4606
▁ህዝቡ	-4607
▁በመጪው	-4608
▁አሳስበዋል።	-4609
▁ይመ	-4610
▁ቃለ	-4611
▁ካልተ	-4612
▁ኦሮሚያ	-4613
▁ብሏል፡፡	-4614
ዳይ	-4615
▁የማዕ	-4616
ናቂ	-4617
▁እሳት	-4618
▁በአደጋ	-4619
▁በማሳ	-4620
▁ነፃነት	-4621
▁ጠቅላላ	-4622
▁ግማሽ	-4623
▁የመውጫ	-4624
▁የአመቱ	-4625
▁በተካሄደው	-4626
ዎቻቸው	-4627
▁ረዳት	-4628
▁አይዘነጋም።	-4629
▁ጊዜያት	-4630
ፃናት	-4631
▁ዘይት	-4632
▁ገልፀዋል፡፡	-4633
ስና	-4634
ላቸዉ	-4635
ጠኝነት	-4636
▁የቡድን	-4637
▁ኤቨርተን	-4638
ንዲ	-4639
ባችን	-4640
ነገር	-4641
▁በከ	-4642
ሳውዲ	-4643
▁ቀርቦ	-4644
▁ብራይ	-4645
▁ማረሚያ	-4646
▁ቤታቸው	-4647
ምራ	-4648
ቀርባ	-4649
▁መቅ	-4650
▁በንግ	-4651
▁ግምት	-4652
ወሰን	-4653
▁ከፋ	-4654
ናል፡፡	-4655
▁ተላል	-4656
ort	-4657
▁የመግቢያ	-4658
ሳን	-4659
ገገሙ	-4660
▁በጋዛ	-4661
▁አስቸጋሪ	-4662
ረጥ	-4663
ናቶች	-4664
▁የኢፌዴሪ	-4665
▁ገበ	-4666
▁ተዘጋጅ	-4667
▁ስራዎችን	-4668
ብርና	-4669
▁ገለጸ	-4670
/2012	-4671
ፋል	-4672
ከናው	-4673
▁እርግ	-4674
▁ማቅረብ	-4675
▁ባንኮች	-4676
▁ወይዘሮ	-4677
▁ሰማ	-4678
▁በቃ	-4679
▁አማካሪ	-4680
▁በሚገኝ	-4681
ክክር	-4682
▁አሁኑኑ	-4683
▁በትናንት	-4684
ሀብ	-4685
ተዉ	-4686
ቸር	-4687
▁አሸን	-4688
ith	-4689
ኑኤል	-4690
ኒየም	-4691
▁ተካ	-4692
▁የዶ	-4693
▁አስደ	-4694
▁የከፋ	-4695
▁የፈረንሳይ	-4696
ቀመጡ	-4697
ቀሳቀ	-4698
ዕምሮ	-4699
ላሚ	-4700
ስርዓት	-4701
ያል	-4702
▁ግር	-4703
▁ጫማ	-4704
▁በእስር	-4705
▁የቻይና	-4706
▁የፓርቲ	-4707
▁የጀርመን	-4708
▁ትችላላችሁ	-4709
▁ይቀ	-4710
▁ሊያስ	-4711
▁በመላው	-4712
▁በስልክ	-4713
▁የሶማሊያ	-4714
▁በመግለጫው	-4715
▁ከዩ	-4716
▁ሳንቲ	-4717
▁የደም	-4718
▁በምስራቅ	-4719
ቃይ	-4720
ለፍነው	-4721
▁ምልክት	-4722
▁ነጥቦች	-4723
ከስ	-4724
▁Ch	-4725
▁ከነማ	-4726
▁ስደተኞች	-4727
lo	-4728
ሌዳ	-4729
▁የተደረገው	-4730
▁ተገለፀ	-4731
ላችንን	-4732
▁አደረገ	-4733
▁ያሉትን	-4734
ሟላ	-4735
▁ግዛ	-4736
▁በመባል	-4737
▁አነስተኛ	-4738
ላፊነት	-4739
▁የሊግ	-4740
▁የኢንተር	-4741
ለድ	-4742
▁ጉሙዝ	-4743
▁ያደረገውን	-4744
ማረ	-4745
▁ከበደ	-4746
▁ቅድሚያ	-4747
▁በዘላቂ	-4748
▁ተደራሽ	-4749
▁አክለዋል።	-4750
ችግ	-4751
ሞክራ	-4752
▁ሳሙ	-4753
▁በሐ	-4754
▁ተደርጓል	-4755
▁ለዘ	-4756
▁አደረ	-4757
▁የተገኙ	-4758
ባሪው	-4759
ፓርት	-4760
▁ሽማግሌ	-4761
ግሉ	-4762
▁ምክንያቶች	-4763
ፋው	-4764
ባቸዋል	-4765
▁የያዘ	-4766
▁ድንገተኛ	-4767
▁የኢትዮጵያን	-4768
በትም	-4769
ናልባት	-4770
▁ዜና፡	-4771
/2017	-4772
▁አቅራቢያ	-4773
▁የከተማዋ	-4774
▁የከተማው	-4775
ዋሪ	-4776
▁አርሴ	-4777
ልህ	-4778
ንጅ	-4779
▁የተገለጸ	-4780
ባኖስ	-4781
ጠብቅ	-4782
▁አገግ	-4783
▁የሚገቡ	-4784
▁36	-4785
ረዱ	-4786
▁ተወላ	-4787
የቱ	-4788
በዋል	-4789
▁መሆ	-4790
▁ህገወጥ	-4791
▁ከነዚህ	-4792
ሎፕ	-4793
od	-4794
▁አጣ	-4795
ቸውም	-4796
▁ሚኬል	-4797
▁ዲፕሎማ	-4798
▁ወንዝ	-4799
▁ዲያ	-4800
▁የሚሰሩ	-4801
▁ስሙ	-4802
▁መንቀጥ	-4803
ቋሚ	-4804
▁ታሪካዊ	-4805
▁በቴ	-4806
▁የፈፀ	-4807
▁ቴሌግራም	-4808
▁አረጋግጠዋል።	-4809
.1	-4810
▁በማይ	-4811
ቀዋል	-4812
▁እንድን	-4813
▁ግቦችን	-4814
▁ተችሏል።	-4815
ነሰ	-4816
▁መለያ	-4817
▁መምህር	-4818
በባ	-4819
ጌታ	-4820
ግግር	-4821
▁አራተኛ	-4822
▁የሚመራው	-4823
ሮባ	-4824
▁ከበሽታው	-4825
ፋስ	-4826
▁ብሔ	-4827
75	-4828
▁ከፈ	-4829
▁የኩ	-4830
▁••	-4831
▁ልውው	-4832
▁የሚገል	-4833
▁ያደረጉት	-4834
መንድ	-4835
▁ፖርቹ	-4836
▁ቡድናቸው	-4837
እኔ	-4838
▁ቶሎ	-4839
▁ያለም	-4840
▁የስልክ	-4841
ልባ	-4842
▁የሕግ	-4843
▁ጨዋታዎችን	-4844
▁አንጻ	-4845
