<pad>	0
<unk>	0
<s>	0
</s>	0
▁የ	-0
▁በ	-1
▁አ	-2
▁እ	-3
▁መ	-4
▁ተ	-5
▁ከ	-6
▁እን	-7
▁ለ	-8
ል።	-9
ቸው	-10
▁ወ	-11
▁ነ	-12
▁ይ	-13
ዎች	-14
▁ማ	-15
ላይ	-16
▁ስ	-17
▁ያ	-18
▁የሚ	-19
▁እና	-20
▁ም	-21
▁ሰ	-22
▁ብ	-23
▁የተ	-24
▁ሲ	-25
▁ላይ	-26
▁እንደ	-27
፡፡	-28
▁ባ	-29
▁ው	-30
▁ግ	-31
▁አስ	-32
▁ክ	-33
ነት	-34
▁ነው	-35
ደረ	-36
▁በመ	-37
ዋል።	-38
ስት	-39
▁ገ	-40
▁ት	-41
ውን	-42
ችን	-43
▁ቀ	-44
▁እንዲ	-45
▁ጥ	-46
▁1	-47
▁የአ	-48
ንግ	-49
▁በተ	-50
ደር	-51
▁በአ	-52
▁ቤ	-53
▁"	-54
▁ሚ	-55
ኢት	-56
▁ድ	-57
▁2	-58
ኢትዮ	-59
ል፡፡	-60
▁የመ	-61
ንድ	-62
▁ጋ	-63
ሪያ	-64
▁ህ	-65
▁ዓ	-66
ሆን	-67
ጵያ	-68
ሆኑ	-69
ኢትዮጵያ	-70
በት	-71
..	-72
▁ደ	-73
ለው	-74
ቸውን	-75
▁ወደ	-76
ርት	-77
▁ሊ	-78
▁ከተ	-79
ራት	-80
ተኛ	-81
ቶች	-82
▁ሁ	-83
▁ሀ	-84
▁ለመ	-85
▁ጉ	-86
በር	-87
▁ል	-88
▁ጋር	-89
ሆነ	-90
▁እየ	-91
ለት	-92
ንት	-93
ማሪ	-94
▁ሳ	-95
ስጥ	-96
ገር	-97
▁-	-98
▁ታ	-99
▁እንደሚ	-100
▁በማ	-101
▁ለማ	-102
ስተ	-103
ዚህ	-104
▁ኮ	-105
▁ዘ	-106
▁ካ	-107
00	-108
ለም	-109
▁ውስጥ	-110
ገል	-111
ድር	-112
ጨዋ	-113
▁ጠ	-114
▁ባለ	-115
▁ፍ	-116
▁ቢ	-117
▁ዋ	-118
▁ዩ	-119
ቨር	-120
ረት	-121
ራዊ	-122
ምህ	-123
በረ	-124
ዲስ	-125
▁(	-126
▁እስ	-127
▁ፈ	-128
▁ጉዳ	-129
ድረ	-130
▁አካ	-131
▁በሚ	-132
▁ፕ	-133
01	-134
▁እንዳ	-135
▁የማ	-136
▁ከተማ	-137
ጊዜ	-138
ቱን	-139
▁አን	-140
▁አይ	-141
▁ግን	-142
መት	-143
ሁን	-144
▁የም	-145
▁ሰዎች	-146
▁የሚያ	-147
▁ምክ	-148
ገባ	-149
▁።	-150
ንስ	-151
▁ኢ	-152
ትን	-153
▁መስ	-154
ሪካ	-155
ሎች	-156
▁መሆኑ	-157
▁አል	-158
▁ገል	-159
▁፣	-160
ዛሬ	-161
ታወ	-162
ሰብ	-163
▁ች	-164
ምህርት	-165
▁ቤት	-166
▁3	-167
▁ሲሆን	-168
▁አስተ	-169
ጀመ	-170
ዋል	-171
ጨዋታ	-172
▁ክል	-173
ረጃ	-174
▁ምን	-175
--	-176
▁ሚኒ	-177
ኒቨር	-178
ጥር	-179
▁አለ	-180
▁ጊዜ	-181
መራ	-182
▁ይህ	-183
▁ተከ	-184
▁ነው።	-185
መለ	-186
ናል	-187
ንያ	-188
▁እየተ	-189
▁ተና	-190
ልጣ	-191
ላት	-192
ቅር	-193
▁ቡ	-194
ጠና	-195
▁ሆ	-196
▁የነ	-197
▁መንግ	-198
ታው	-199
ናት	-200
ያን	-201
ባቢ	-202
▁ኤ	-203
▁አበ	-204
▁ፖ	-205
▁ያለ	-206
▁ኢትዮጵያ	-207
ሲቲ	-208
▁መን	-209
ዋል፡፡	-210
▁ጨዋታ	-211
ደረገ	-212
ብር	-213
ተር	-214
▁ተማሪ	-215
▁ብር	-216
▁ቁ	-217
▁ተናግ	-218
ከል	-219
▁ከፍ	-220
ገኙ	-221
ገኘ	-222
ኒቨርሲቲ	-223
ዎችን	-224
▁ምር	-225
▁ክፍ	-226
▁ሙ	-227
▁መረጃ	-228
ለያ	-229
▁ዶ	-230
▁ክልል	-231
ግራ	-232
ይት	-233
ምሮ	-234
▁መሆኑን	-235
▁መል	-236
ርድ	-237
▁የት	-238
ሽን	-239
ፊት	-240
ታት	-241
▁ዳ	-242
▁ቅ	-243
ከተ	-244
ላቸው	-245
ረዳ	-246
▁አበባ	-247
ታቸው	-248
ሮች	-249
▁በላይ	-250
▁ስለ	-251
▁ቦ	-252
▁ኃ	-253
▁አባ	-254
ግር	-255
ግባ	-256
ድን	-257
ይወ	-258
የር	-259
▁ዝ	-260
▁የእ	-261
▁አቶ	-262
▁የሰ	-263
ሊስ	-264
▁ጀ	-265
▁ቀን	-266
▁እያ	-267
▁ስራ	-268
▁ድር	-269
ሎት	-270
ብረ	-271
▁የኢትዮጵያ	-272
▁ና	-273
▁አንድ	-274
▁ሌ	-275
▁5	-276
▁ደረ	-277
ማት	-278
▁የወ	-279
ረስ	-280
ለን	-281
▁ተናግረ	-282
ገድ	-283
ገለ	-284
▁4	-285
▁ዕ	-286
▁ነበር	-287
ባቸው	-288
ዮን	-289
ረጋ	-290
ደጋ	-291
▁0	-292
ችሁ	-293
ዓት	-294
▁ዩኒቨርሲቲ	-295
ገልግ	-296
▁ተጠ	-297
▁ከአ	-298
ሰራ	-299
▁“	-300
ቢያ	-301
ኞች	-302
ላፊ	-303
መል	-304
▁ፓ	-305
ርካ	-306
ላል	-307
▁ማን	-308
▁ሃ	-309
ሁም	-310
ለች	-311
ሚያ	-312
▁አሳ	-313
ፈል	-314
ድረግ	-315
▁ከፍተኛ	-316
201	-317
▁ዛሬ	-318
▁ሥ	-319
ግለ	-320
ሏል።	-321
ተና	-322
▁በቀ	-323
▁የስ	-324
▁!	-325
በሩ	-326
▁እስከ	-327
▁ማስ	-328
▁ስር	-329
ዎቹ	-330
ላም	-331
▁አገልግ	-332
▁አር	-333
ገኛ	-334
ረው	-335
ክል	-336
ቦች	-337
ሉት	-338
▁እንዲሁም	-339
ዳን	-340
▁ብለ	-341
ተው	-342
▁ነገር	-343
▁ዓመት	-344
▁ከመ	-345
▁በዚህ	-346
▁ምክንያ	-347
▁አሰ	-348
▁ትምህርት	-349
ጨማሪ	-350
▁የው	-351
▁መሰ	-352
▁ተማሪዎች	-353
▁አድር	-354
▁በእ	-355
ዝብ	-356
ስቲ	-357
▁ሳይ	-358
ጿል።	-359
▁ሕ	-360
ቋል።	-361
▁ሺ	-362
ኛው	-363
▁ላ	-364
▁አም	-365
መር	-366
▁ተቋ	-367
ካሄ	-368
ታል	-369
ለያዩ	-370
ኋላ	-371
▁በሰ	-372
▁ፕሬ	-373
▁ተብ	-374
▁ኦ	-375
▁ሲሉ	-376
▁ፖሊስ	-377
ሪዎች	-378
▁ጎ	-379
ክት	-380
ራል	-381
▁የህ	-382
▁ብቻ	-383
▁.	-384
መን	-385
▁ዋና	-386
▁አካባቢ	-387
ከላ	-388
▁ሞ	-389
ገኝ	-390
▁፤	-391
ይል	-392
▁ተገል	-393
ጦር	-394
▁ኮሚ	-395
in	-396
ኔታ	-397
ቤት	-398
▁ሴ	-399
ስተር	-400
▁ደረጃ	-401
▁የቀ	-402
ምና	-403
▁አዲስ	-404
▁አሁን	-405
▁አስተዳ	-406
▁ሜ	-407
▁ሚኒስት	-408
▁በኋላ	-409
▁በስ	-410
▁ቴ	-411
ምን	-412
ስቴ	-413
ታቸውን	-414
▁ሰው	-415
ጣት	-416
▁አቀ	-417
ሳይ	-418
▁ዜ	-419
▁አስታው	-420
▁ደግ	-421
▁ሁኔታ	-422
ጥታ	-423
▁እር	-424
መድ	-425
▁ን	-426
ሆና	-427
▁በት	-428
ጀመሪያ	-429
ይም	-430
▁ሁሉ	-431
▁ሚሊ	-432
▁መንግስት	-433
...	-434
ተሰ	-435
ንን	-436
▁ጨ	-437
ቷል።	-438
▁6	-439
▁መካ	-440
ሜሪካ	-441
▁ሶ	-442
ማራ	-443
ደረጉ	-444
▁ደግሞ	-445
▁•	-446
▁ራ	-447
ቫይ	-448
▁ዞ	-449
ሳት	-450
▁ምክንያት	-451
▁ክለ	-452
▁ያለው	-453
▁ህይወ	-454
▁አገልግሎት	-455
ዮች	-456
ፍሪካ	-457
ወሰ	-458
er	-459
ችል	-460
ኤል	-461
ጠቀ	-462
ዘጋ	-463
▁ተናግረዋል።	-464
ባት	-465
ገን	-466
ደው	-467
▁ሲል	-468
▁አብ	-469
▁መር	-470
▁ሽ	-471
▁ሀገ	-472
ዳንት	-473
▁የነበረ	-474
ቃት	-475
ቅም	-476
ጠበ	-477
ፖርት	-478
▁:	-479
▁ውጤ	-480
ነው	-481
an	-482
ጠር	-483
ደረሰ	-484
▁ሚኒስቴ	-485
▁ናቸው	-486
▁ዲ	-487
ጤና	-488
▁7	-489
▁201	-490
▁መግለ	-491
ቸዉ	-492
ታዊ	-493
▁ጠቅ	-494
▁ይገኛ	-495
▁ቆ	-496
▁ወቅ	-497
ሪክ	-498
----	-499
▁ስም	-500
▁ወረዳ	-501
የት	-502
ንጀ	-503
▁መንገድ	-504
▁ሰዓት	-505
▁ያስ	-506
ደም	-507
▁ለአ	-508
▁ወር	-509
▁አደጋ	-510
▁መካከል	-511
ግብ	-512
ሩን	-513
ምር	-514
ቀው	-515
ባለ	-516
▁ሆነ	-517
ተን	-518
ላለ	-519
ያስ	-520
ጅት	-521
▁ግብ	-522
ቶችን	-523
ትል	-524
▁አው	-525
▁በፊት	-526
ችስተር	-527
on	-528
▁ውድ	-529
▁ሚኒስቴር	-530
▁ጀምሮ	-531
▁ጉዳይ	-532
▁8	-533
ርቲ	-534
▁ቡድን	-535
▁ዞን	-536
ናይት	-537
ወጣ	-538
ፍት	-539
▁ሺህ	-540
ገና	-541
ጥጥር	-542
ዘብ	-543
▁ብለዋል።	-544
....	-545
ንክ	-546
ሉ።	-547
ያቄ	-548
ጫዋ	-549
ክር	-550
ተዋል።	-551
ሩት	-552
▁ቁጥር	-553
▁ተከት	-554
▁ሊግ	-555
መው	-556
▁የሆነ	-557
▁ግለ	-558
ስራ	-559
ዲያ	-560
▁ተፈ	-561
▁ፕሮ	-562
▁ተከትሎ	-563
ንም	-564
ግራይ	-565
ክተር	-566
▁t	-567
▁ጉዳት	-568
▁የሀ	-569
ቀር	-570
▁ኢን	-571
▁ተወ	-572
▁ቃ	-573
▁ፈተና	-574
▁መግለጫ	-575
▁ከዚህ	-576
▁አሰልጣ	-577
▁ዙ	-578
▁ገልጸ	-579
▁ፕሬዝ	-580
ጠናቀ	-581
ሥት	-582
▁ጥያቄ	-583
▁ተቀ	-584
ለሁ	-585
ብስ	-586
▁የኮ	-587
ፈው	-588
ሉን	-589
ስር	-590
▁አመ	-591
▁ይፋ	-592
▁ችግር	-593
ም።	-594
ገቡ	-595
ጠው	-596
▁ቦታ	-597
▁ድጋ	-598
ክምና	-599
ገኘው	-600
▁በኢትዮጵያ	-601
ንጫ	-602
▁በነ	-603
▁ሚኒስትር	-604
▁ማህ	-605
ክስ	-606
▁ብዙ	-607
▁ተጨዋ	-608
▁ተሰ	-609
▁የግ	-610
▁'	-611
ማር	-612
▁ሪ	-613
ኖች	-614
▁ሁለት	-615
ላን	-616
▁መጠ	-617
ከት	-618
▁?	-619
▁አስተዳደር	-620
ኖር	-621
ናይትድ	-622
▁ያል	-623
▁ጣ	-624
▁ክፍል	-625
▁9	-626
▁እንዲያ	-627
▁ተጫዋ	-628
▁ለተ	-629
ሔራዊ	-630
ረም	-631
▁ልዩ	-632
ሸነ	-633
▁ወቅት	-634
ከተማ	-635
ኩል	-636
▁ሲያ	-637
▁ወይም	-638
ቧል።	-639
ላማ	-640
▁የኢ	-641
re	-642
▁ሥራ	-643
▁ዓመ	-644
ፉት	-645
▁በህ	-646
ምነት	-647
ረብ	-648
▁በወ	-649
/201	-650
በል	-651
ገደ	-652
▁በዓ	-653
19	-654
▁ውጤት	-655
▁ኃላፊ	-656
ገው	-657
▁አመት	-658
▁ኪ	-659
▁የትምህርት	-660
▁ተመ	-661
ህን	-662
ገራ	-663
ሯል።	-664
▁ከሚ	-665
▁እንደሆነ	-666
ia	-667
ዲዮ	-668
▁አት	-669
ምንት	-670
▁በም	-671
ቀጥ	-672
▁ስል	-673
ሪቱ	-674
▁ድረስ	-675
▁መሰረት	-676
ጠቃ	-677
▁ያሉ	-678
▁ሚሊዮን	-679
ቡብ	-680
▁ተነ	-681
▁ሂ	-682
▁10	-683
▁ይታወ	-684
▁ጦር	-685
ንዳ	-686
ብረት	-687
በው	-688
ድሞ	-689
ሳኔ	-690
▁የተሰ	-691
ሱን	-692
▁ቢሮ	-693
ክልሉ	-694
ረን	-695
▁ነጥ	-696
▁ጥቃት	-697
ሮና	-698
▁በሀ	-699
▁በቁ	-700
▁ተገልጿል።	-701
▁ቤተ	-702
ያዘ	-703
▁ነበር።	-704
ለቱ	-705
ማን	-706
000	-707
ንግስት	-708
▁ሮ	-709
ደን	-710
▁ፋ	-711
▁ድጋፍ	-712
▁ቫይ	-713
ጠት	-714
▁አሰልጣኝ	-715
ናው	-716
▁ሌሎች	-717
▁በተጨማሪ	-718
▁ነዋ	-719
▁የታ	-720
▁ለሚ	-721
▁ር	-722
▁ሙሉ	-723
ክለ	-724
ዶች	-725
ከርካ	-726
ከሰ	-727
▁የሚያስ	-728
▁በርካ	-729
▁ጠቅላይ	-730
▁ጭ	-731
ባይ	-732
en	-733
▁አስፈ	-734
▁ዩናይትድ	-735
▁20	-736
ሰው	-737
ደረግ	-738
ነሳ	-739
ብት	-740
▁ሀገር	-741
▁አይደ	-742
ራን	-743
▁በአዲስ	-744
ፈጸ	-745
ንጀል	-746
▁በው	-747
▁ዝግ	-748
▁የባ	-749
▁ክለብ	-750
▁ማዕ	-751
▁መቀ	-752
▁ሆኖ	-753
▁ሬ	-754
▁ሱ	-755
ቀት	-756
ጋት	-757
ጣይ	-758
▁ምንም	-759
ቂያ	-760
▁A	-761
▁አባላት	-762
▁ፕሬዝዳንት	-763
▁ማንችስተር	-764
ረጋገ	-765
▁ምርመራ	-766
ተኞች	-767
ደረገው	-768
▁አካላት	-769
▁ተቋማት	-770
▁ምክር	-771
▁የአዲስ	-772
▁ነው፡፡	-773
ዊው	-774
at	-775
መስ	-776
ሬት	-777
▁ለማስ	-778
ጡት	-779
ጨረ	-780
መረ	-781
▁አቀፍ	-782
▁ገን	-783
በራዊ	-784
▁ተግባ	-785
▁S	-786
▁የመጀመሪያ	-787
▁እድ	-788
ምፒ	-789
▁ጨምሮ	-790
▁ሲቲ	-791
▁ቡድ	-792
ገሪቱ	-793
▁ከእ	-794
==	-795
▁በቁጥጥር	-796
▁በኩል	-797
ጀት	-798
ባል	-799
▁ዜጎ	-800
ንግድ	-801
▁ገልጿል።	-802
ታደ	-803
ስተኛ	-804
ጠረ	-805
ድሪ	-806
ብራ	-807
▁ቀናት	-808
ሉም	-809
ችንን	-810
▁አመራ	-811
ፈፀ	-812
ጭት	-813
al	-814
ለች።	-815
▁ደር	-816
ግኘ	-817
▁ቤቱ	-818
▁ሳምንት	-819
▁ነገ	-820
▁የሚገኙ	-821
▁V	-822
▁ብሔራዊ	-823
or	-824
▁ማለ	-825
▁በየ	-826
▁ፓርቲ	-827
ኦሮ	-828
ፋት	-829
ቲክ	-830
ቾች	-831
▁ቤቶች	-832
▁ጽ	-833
▁ቶ	-834
▁ሐ	-835
▁በኮ	-836
ፌዴ	-837
▁የተለያዩ	-838
ከፍ	-839
ላንት	-840
ሙሉ	-841
▁ውሳኔ	-842
it	-843
▁ብሎ	-844
▁በርካታ	-845
▁ዋንጫ	-846
ሜን	-847
መጣ	-848
ይና	-849
ዳር	-850
ሽከርካ	-851
ልቅ	-852
ነቱ	-853
ያው	-854
ስፒ	-855
▁ገልፀ	-856
▁12	-857
ቡን	-858
▁ረ	-859
▁እንዳይ	-860
ሳተ	-861
▁ተደር	-862
▁ቻ	-863
ህል	-864
he	-865
ታል።	-866
▁የሆኑ	-867
ታወቀ	-868
▁በደ	-869
is	-870
▁የበ	-871
▁የደ	-872
▁T	-873
▁የነበሩ	-874
ኝነት	-875
▁ቫይረስ	-876
▁በበ	-877
ደት	-878
ግራም	-879
ሰባ	-880
ጠራ	-881
▁አቅር	-882
ከያ	-883
ሳብ	-884
ቀረ	-885
▁በሁ	-886
▁ከነ	-887
ንቲ	-888
ዛት	-889
ደርጉ	-890
▁ፍርድ	-891
ጣሪ	-892
የን	-893
▁፦	-894
ሰጥ	-895
▁አድ	-896
▁በመሆኑ	-897
ሞች	-898
ለተኛ	-899
▁ጥሪ	-900
ልጣን	-901
▁እንደሚያ	-902
▁ኩ	-903
ላው	-904
ጋራ	-905
ፈት	-906
▁በግ	-907
▁አለመ	-908
▁ተጨዋች	-909
ኑን	-910
▁በታ	-911
▁በሚል	-912
ምጃ	-913
ቲካ	-914
▁ፎ	-915
▁በመቶ	-916
ትር	-917
ስታ	-918
ጠቃላይ	-919
▁አስታውቋል።	-920
ዳጅ	-921
ከር	-922
▁ህይወት	-923
▁ነጥብ	-924
ችው	-925
ደራ	-926
▁ሸ	-927
ላሽ	-928
▁እንደነ	-929
▁ዕለት	-930
ከና	-931
▁ማሳ	-932
▁እነ	-933
▁ምርጫ	-934
▁አጋ	-935
▁C	-936
▁ገልጸዋል።	-937
ሮፓ	-938
▁በጥ	-939
▁እንደተ	-940
ሰን	-941
ደርግ	-942
▁አሸ	-943
▁ድርጅት	-944
ጨረሻ	-945
▁በሌ	-946
▁M	-947
▁ምንጭ	-948
▁አዳ	-949
መልክ	-950
ላክ	-951
መለከተ	-952
20	-953
▁አሳው	-954
ከታ	-955
ጆች	-956
ላቀ	-957
▁ሻ	-958
▁አቅ	-959
▁ሠ	-960
▁ይች	-961
▁ባንክ	-962
ርፍ	-963
ያዊ	-964
▁እንቅ	-965
ቨርፑ	-966
▁09	-967
▁ተጨማሪ	-968
▁ዳይ	-969
ርክ	-970
▁በጣ	-971
ላቸውን	-972
▁ሀገራት	-973
▁ፀ	-974
ንቀ	-975
▁ሰላም	-976
▁መድረ	-977
ልም	-978
ሊያ	-979
ካባቢ	-980
▁ተብሎ	-981
▁ድም	-982
▁የተባ	-983
▁ይህን	-984
▁ቴሌ	-985
el	-986
▁ሰራ	-987
▁በተለ	-988
▁ግለሰ	-989
ዛሬው	-990
ሙያ	-991
ሊዝ	-992
▁ከባ	-993
▁የፈ	-994
▁ዉ	-995
▁ጉዳዮች	-996
ከላከያ	-997
▁ችግ	-998
▁መሆና	-999
,000	-1000
ረጋግ	-1001
▁ያሉት	-1002
ራቸው	-1003
▁በተለያዩ	-1004
ላር	-1005
▁ዐ	-1006
▁ዴ	-1007
ቅድ	-1008
▁መንግሥት	-1009
▁አይደለም	-1010
ደበ	-1011
▁ቆይ	-1012
ገብ	-1013
ሀም	-1014
ላችሁ	-1015
ስቃ	-1016
▁ኃይ	-1017
▁ያሳ	-1018
▁እርምጃ	-1019
▁ልጅ	-1020
▁ኬ	-1021
▁ቪ	-1022
▁የዩ	-1023
ከናወ	-1024
▁በዚህም	-1025
▁በማድረግ	-1026
▁የካ	-1027
ያዙ	-1028
ልፍ	-1029
▁በድ	-1030
12	-1031
▁ጨዋታዎች	-1032
ልድ	-1033
▁ቃል	-1034
▁ዓለም	-1035
▁ዋጋ	-1036
▁ገንዘብ	-1037
ረሱ	-1038
▁አማ	-1039
ቨርፑል	-1040
▁የኤ	-1041
ውያን	-1042
!!	-1043
ቆጣ	-1044
▁ዳይሬ	-1045
▁መስመር	-1046
▁እጅ	-1047
▁ከሰ	-1048
ar	-1049
▁ፊ	-1050
▁የውጭ	-1051
ሪያል	-1052
▁ክር	-1053
▁11	-1054
ያይ	-1055
▁ግድ	-1056
▁ጋዜ	-1057
▁ድን	-1058
ማይ	-1059
ይይት	-1060
ችሉ	-1061
▁ዘግ	-1062
▁ይታወሳ	-1063
▁ሰጥ	-1064
▁ግንኙ	-1065
▁የስራ	-1066
ስፋ	-1067
▁ማድረግ	-1068
▁ጆ	-1069
ልሲ	-1070
ደባ	-1071
ፍራ	-1072
▁ያለውን	-1073
ስቃሴ	-1074
ግኘት	-1075
::	-1076
▁ግንባ	-1077
ቻቸው	-1078
▁ዘመ	-1079
▁ሆስፒ	-1080
▁እስካ	-1081
ou	-1082
▁E	-1083
▁ሊያ	-1084
▁የብ	-1085
ሬን	-1086
▁ህዝብ	-1087
▁በሆነ	-1088
▁ቢሆን	-1089
ለቲካ	-1090
▁በማለት	-1091
:00	-1092
▁መልዕ	-1093
▁ማድሪ	-1094
▁በር	-1095
ዕራ	-1096
ላጊ	-1097
▁አይነት	-1098
▁ምክትል	-1099
▁ይህንን	-1100
▁የአሜሪካ	-1101
▁ኮሚሽን	-1102
▁ስታ	-1103
50	-1104
ርሴ	-1105
ፈር	-1106
ፊያ	-1107
▁ሩ	-1108
es	-1109
▁የምት	-1110
▁እንግ	-1111
▁Via	-1112
▁መም	-1113
▁ኃይል	-1114
ዘር	-1115
▁ናቸው።	-1116
ያዝ	-1117
▁ዶላር	-1118
▁ምስ	-1119
▁እው	-1120
ቹን	-1121
ልን	-1122
▁አዋ	-1123
ሸነፍ	-1124
▁የጥ	-1125
ነጋ	-1126
ቼልሲ	-1127
ቀዋል።	-1128
▁ተብሏል።	-1129
▁ወረ	-1130
▁አፍሪካ	-1131
ኳን	-1132
▁ዜጎች	-1133
30	-1134
ጠቀም	-1135
▁ህግ	-1136
▁ግብር	-1137
ውው	-1138
ሚየር	-1139
ነር	-1140
መለስ	-1141
ቷል	-1142
▁በሙሉ	-1143
▁አትሌ	-1144
▁ባለስ	-1145
ፈልጋ	-1146
am	-1147
▁እንቅስቃሴ	-1148
ቻችን	-1149
ይወት	-1150
ሎጂ	-1151
ሁኑ	-1152
▁የሚል	-1153
ኪና	-1154
ወስ	-1155
በትን	-1156
▁ሁሉም	-1157
▁የጤና	-1158
ፌደ	-1159
▁ጤና	-1160
▁በዛሬው	-1161
▁ማለት	-1162
▁እንዳለ	-1163
▁አጥ	-1164
ሥራ	-1165
▁የተፈ	-1166
▁የፖ	-1167
ጠበቅ	-1168
ንደ	-1169
▁ይሆና	-1170
▁ይገባ	-1171
ናን	-1172
▁ምላሽ	-1173
ታይ	-1174
▁የፀ	-1175
▁ብሏል።	-1176
▁የነበረው	-1177
ዓለም	-1178
▁ሶስት	-1179
ርያ	-1180
ላንድ	-1181
▁የማይ	-1182
ኖሩ	-1183
ድድር	-1184
▁ዓመታት	-1185
▁ለማድረግ	-1186
ምት	-1187
▁የቀድሞ	-1188
▁ግንኙነት	-1189
ኛውም	-1190
▁በማስ	-1191
▁ወንጀል	-1192
ካም	-1193
▁አንዱ	-1194
▁እለት	-1195
▁ተገልጿ	-1196
▁አህ	-1197
▁በጣም	-1198
ካል	-1199
▁ዙሪያ	-1200
ናገ	-1201
▁ትራ	-1202
▁በቅር	-1203
ጠሩ	-1204
▁ተጫዋች	-1205
▁ባለሙያ	-1206
▁ባለፉት	-1207
▁አክ	-1208
▁ጣቢያ	-1209
▁P	-1210
▁መሳ	-1211
በቃ	-1212
▁ቤተሰ	-1213
ከራ	-1214
▁ወታደ	-1215
▁አየር	-1216
ic	-1217
▁19	-1218
▁የለም	-1219
▁በአንድ	-1220
በሌ	-1221
በያ	-1222
▁ወጣ	-1223
ዥን	-1224
የም	-1225
ኳስ	-1226
ይን	-1227
ፈለ	-1228
▁በፍ	-1229
ሃን	-1230
▁24	-1231
ሰሩ	-1232
ኦሮሚያ	-1233
▁እስካሁን	-1234
ሏል	-1235
▁አካል	-1236
▁እንድ	-1237
10	-1238
▁ቀደም	-1239
▁እንጂ	-1240
ዚያ	-1241
▁መመ	-1242
ሻሻ	-1243
▁እኔ	-1244
▁ጫ	-1245
▁መድ	-1246
▁ተናግረዋል፡፡	-1247
ቪድ	-1248
ላዊ	-1249
▁B	-1250
ሌክት	-1251
ሰናል	-1252
--------	-1253
▁ወራት	-1254
ቋል፡፡	-1255
▁F	-1256
▁ስብ	-1257
▁ማስተ	-1258
ቫህ	-1259
ቦት	-1260
ቆም	-1261
▁ቀር	-1262
ቅና	-1263
ከለ	-1264
▁የሕ	-1265
▁ስምምነት	-1266
▁ለእ	-1267
▁፡	-1268
ቱም	-1269
▁ውድድር	-1270
▁የሞ	-1271
ፌደራል	-1272
ዝገባ	-1273
▁ጌ	-1274
▁ነዋሪዎች	-1275
▁15	-1276
ታችን	-1277
▁መሪ	-1278
ረድ	-1279
▁ምሽ	-1280
▁በቀጣይ	-1281
▁መው	-1282
የው	-1283
▁የመንግስት	-1284
ቀመ	-1285
▁ስት	-1286
▁አስታወቀ	-1287
ሰር	-1288
▁ሄ	-1289
ከላከል	-1290
▁ድርጊ	-1291
ስቶ	-1292
ስጠት	-1293
25	-1294
ካይ	-1295
▁ከወ	-1296
▁ገብ	-1297
ባሳ	-1298
▁አራት	-1299
▁ጉባ	-1300
ዱስ	-1301
▁ከሆነ	-1302
ለጠ	-1303
▁ማድሪድ	-1304
▁ውጪ	-1305
▁ጠይ	-1306
ገንዘብ	-1307
ርሴሎ	-1308
▁መንገ	-1309
▁አካባቢዎች	-1310
▁ተጠር	-1311
▁ድርጅ	-1312
▁በዘ	-1313
ካባቢው	-1314
▁ምርጥ	-1315
▁ከማ	-1316
▁የገ	-1317
ጸጥታ	-1318
ስራት	-1319
▁የገለ	-1320
▁ቢሊ	-1321
ብስራት	-1322
ጫወ	-1323
ion	-1324
ቲት	-1325
ካሄድ	-1326
om	-1327
ደርስ	-1328
ልስ	-1329
▁ፅ	-1330
ከፍተኛ	-1331
▁ከባድ	-1332
ሞክ	-1333
ሳሳይ	-1334
▁ማድረ	-1335
▁የል	-1336
▁ከቀ	-1337
▁ዘመን	-1338
▁ተነግ	-1339
ልክ	-1340
ሰጣ	-1341
▁ሆስፒታል	-1342
▁ሰር	-1343
ላጎ	-1344
ትና	-1345
▁30	-1346
ውሮፓ	-1347
▁ዜና	-1348
ወቅ	-1349
ዋን	-1350
▁የደረሰ	-1351
▁አሜሪካ	-1352
▁ልማት	-1353
ድስት	-1354
▁ሊቨርፑል	-1355
et	-1356
▁እንደነበር	-1357
ደሩ	-1358
ህር	-1359
ዘው	-1360
▁የፍ	-1361
ቅረ	-1362
▁ሌላ	-1363
ጠየ	-1364
▁ጦርነት	-1365
▁በጉ	-1366
ቲክቫህ	-1367
▁ገለ	-1368
ክኖ	-1369
▁:-	-1370
▁አገ	-1371
▁ሆኗ	-1372
▁ባል	-1373
ላሉ	-1374
ኞቹ	-1375
ወጥ	-1376
ጣቂ	-1377
▁በሽ	-1378
▁የዋ	-1379
▁ሆነው	-1380
ዳማ	-1381
▁ሚዲያ	-1382
ራዊት	-1383
ማኖ	-1384
ሄራዊ	-1385
▁መብ	-1386
▁ግጭት	-1387
▁የምር	-1388
▁ሜዳ	-1389
ሳቀ	-1390
ጠቅ	-1391
▁ቱ	-1392
▁ይሄ	-1393
▁በተጨማሪም	-1394
ንግሊዝ	-1395
▁የሁ	-1396
ቃል።	-1397
▁ውይይት	-1398
ናዊ	-1399
ስቲያን	-1400
▁ቼልሲ	-1401
▁s	-1402
▁መኖ	-1403
ማቸው	-1404
▁እንዴ	-1405
▁ጥቅም	-1406
ንደር	-1407
ጋሚ	-1408
▁አድርጓ	-1409
▁እንኳን	-1410
▁ወጥ	-1411
ቀላቀ	-1412
▁የቆ	-1413
መዘ	-1414
▁ዙር	-1415
▁ተከሳ	-1416
ደበኛ	-1417
ህንነት	-1418
▁እኛ	-1419
▁መሆን	-1420
▁14	-1421
▁ለው	-1422
ብረተሰ	-1423
ዳታ	-1424
ሮፕ	-1425
▁w	-1426
▁አሁንም	-1427
▁የሊ	-1428
▁ፍላጎ	-1429
ቴሌ	-1430
ስተዳ	-1431
ሮችን	-1432
▁መተ	-1433
ሲያ	-1434
ሙን	-1435
ኒክ	-1436
▁እንዳል	-1437
ባቂ	-1438
▁ግለሰብ	-1439
ወር	-1440
ቪዥን	-1441
ይማኖ	-1442
▁ሰብ	-1443
▁መሳሪያ	-1444
▁የአፍሪካ	-1445
ብኝ	-1446
▁/	-1447
▁ገልፀዋል።	-1448
ናፊ	-1449
ዝር	-1450
▁የከተማ	-1451
▁ለብስራት	-1452
-0	-1453
በረሰብ	-1454
ኦን	-1455
ዘጋጀ	-1456
ጠብ	-1457
መቱ	-1458
ኬሽን	-1459
ሳቸው	-1460
ሌክትሪክ	-1461
ሽከርካሪ	-1462
ዉን	-1463
▁ኮሚቴ	-1464
ሷል።	-1465
▁በኃ	-1466
ing	-1467
▁የክልሉ	-1468
ካሄደ	-1469
▁ትላንት	-1470
ቻል	-1471
ጠኛ	-1472
▁መሠ	-1473
ቷል፡፡	-1474
▁ክት	-1475
ክኖሎጂ	-1476
ቃድ	-1477
ከታተ	-1478
ርሴሎና	-1479
▁ይገኛል።	-1480
መሰ	-1481
ገረ	-1482
ሬሽን	-1483
ተዋል	-1484
በዋል።	-1485
ጠይ	-1486
▁ወንድ	-1487
ሏል፡፡	-1488
ለዋል።	-1489
▁የሚሆኑ	-1490
ባሪ	-1491
ሰማ	-1492
▁አባል	-1493
▁ዶክተር	-1494
ሰት	-1495
ሶች	-1496
ጥሮ	-1497
▁አላ	-1498
▁አስተያ	-1499
ሶማ	-1500
ሚዎች	-1501
▁የድ	-1502
▁ቢሆንም	-1503
ዱን	-1504
▁አስፈላጊ	-1505
▁ጅ	-1506
▁ወይ	-1507
ጀር	-1508
▁ህዝ	-1509
▁c	-1510
▁ሥር	-1511
ቫይረሱ	-1512
ፉን	-1513
▁አገልግሎ	-1514
ድዮ	-1515
▁ምሽት	-1516
▁ሁለተኛ	-1517
▁ዕድ	-1518
▁ዳይሬክተር	-1519
ንድሮ	-1520
▁ገቢ	-1521
▁እንደማይ	-1522
▁መርሐ	-1523
ሰጡ	-1524
ጀመረ	-1525
▁የሌ	-1526
▁ጠቁ	-1527
▁ቀበሌ	-1528
▁አህመድ	-1529
▁ግለሰቦች	-1530
ሆናል	-1531
▁ጥሩ	-1532
▁መልኩ	-1533
ነሱ	-1534
ወሓ	-1535
▁በረ	-1536
▁የውድድር	-1537
▁ተስፋ	-1538
▁ይሆናል	-1539
ቀል	-1540
ብን	-1541
ኒቨርስቲ	-1542
ዕራብ	-1543
ህበራዊ	-1544
▁)	-1545
▁የዘ	-1546
▁የቀረ	-1547
▁አማራ	-1548
▁የምን	-1549
▁a	-1550
▁ከስ	-1551
ንቅ	-1552
ኒኬሽን	-1553
▁the	-1554
ed	-1555
ቅረብ	-1556
ቋረ	-1557
▁አያ	-1558
▁ጥረት	-1559
▁ሴት	-1560
▁ኤም	-1561
ከብ	-1562
▁ክፍለ	-1563
ቋቋ	-1564
▁የቻ	-1565
ወጣው	-1566
▁ወን	-1567
▁ባለው	-1568
▁ሳይሆን	-1569
▁ደን	-1570
▁የጦር	-1571
ጧል።	-1572
▁ንግ	-1573
▁ክፍያ	-1574
▁ኒ	-1575
▁ይታወሳል።	-1576
ኳይ	-1577
ቦችን	-1578
▁የፀጥታ	-1579
ስን	-1580
▁የሰላም	-1581
and	-1582
▁መፍት	-1583
ሄድ	-1584
ምህር	-1585
▁ህክምና	-1586
▁አመራሮች	-1587
ዓዊ	-1588
ቸኳይ	-1589
▁አምባሳ	-1590
-1	-1591
▁f	-1592
ብረተሰቡ	-1593
▁በመሆን	-1594
ቂቃ	-1595
ርቶ	-1596
በረው	-1597
▁የአማራ	-1598
ገናኛ	-1599
ፈልግ	-1600
▁መንግስ	-1601
▁ፒ	-1602
▁አምስት	-1603
ዋሳ	-1604
ናቸው	-1605
▁በጎ	-1606
▁አለም	-1607
ሱዳን	-1608
▁በይ	-1609
ገነ	-1610
▁13	-1611
▁የፊት	-1612
ደብ	-1613
ጀመር	-1614
▁ያላቸው	-1615
ያያዘ	-1616
▁ትኩ	-1617
ክሬን	-1618
ናንት	-1619
▁ሪፖርት	-1620
▁አርሰናል	-1621
ንግሥት	-1622
▁የሰው	-1623
▁ቅር	-1624
▁አፈ	-1625
ኮች	-1626
መለከ	-1627
▁ሴቶች	-1628
ንስፖርት	-1629
ጋቢ	-1630
▁ጁ	-1631
▁ዝር	-1632
ለቀ	-1633
ጀም	-1634
▁ባይ	-1635
ታወቂያ	-1636
▁ጉባኤ	-1637
▁ኮሚሽ	-1638
▁ተገኝ	-1639
▁የትግራይ	-1640
▁ለህ	-1641
ከፈ	-1642
ደኛ	-1643
ኮኖ	-1644
ዲሱ	-1645
▁ቋ	-1646
▁ጄ	-1647
ፖር	-1648
ላማዊ	-1649
▁ክስ	-1650
▁ተቃ	-1651
▁ዳር	-1652
▁በቅርቡ	-1653
▁b	-1654
▁የራ	-1655
ከረም	-1656
▁ተገ	-1657
▁ይሆናል።	-1658
▁ትልቅ	-1659
ወሓት	-1660
ውውር	-1661
▁በተመለከተ	-1662
ጉን	-1663
ፃሜ	-1664
▁ሂደት	-1665
▁መዋ	-1666
▁ነፃ	-1667
▁ታሪክ	-1668
▁በራ	-1669
▁የትራ	-1670
▁በዋ	-1671
▁ያህል	-1672
▁ኳስ	-1673
▁ሪያል	-1674
ካሄደው	-1675
▁ስጋት	-1676
ለማ	-1677
ምድ	-1678
ሎችን	-1679
ስቲያ	-1680
▁18	-1681
▁ስነ	-1682
▁ያልተ	-1683
ውል	-1684
መዋል።	-1685
▁ሻምፒ	-1686
il	-1687
▁ኮን	-1688
▁ንግድ	-1689
ከፋ	-1690
ቸዉን	-1691
▁ውጭ	-1692
▁የክ	-1693
▁ታጣቂ	-1694
ለን።	-1695
▁መሆናቸውን	-1696
ርስ	-1697
ኤስ	-1698
ችሁን	-1699
▁አሉ	-1700
ዘጋጅ	-1701
▁ይሁን	-1702
ሙት	-1703
▁መፈ	-1704
▁የፕ	-1705
ፋር	-1706
▁መግ	-1707
▁ሳይንስ	-1708
ac	-1709
▁ሚሊየን	-1710
▁አሳውቋል።	-1711
ወጡ	-1712
ውስ	-1713
ስራኤል	-1714
ተት	-1715
▁[	-1716
▁ነዉ	-1717
▁አሸናፊ	-1718
ገሩ	-1719
▁ለሁ	-1720
▁ግንባታ	-1721
ገባው	-1722
▁ዘግቧል።	-1723
ጋል	-1724
ረተ	-1725
ርሚየር	-1726
▁ተከታ	-1727
▁መጥ	-1728
▁ቢያ	-1729
▁በትግራይ	-1730
▁ተገልጿል	-1731
ልማት	-1732
በሩት	-1733
ለፍ	-1734
▁ጊ	-1735
▁በኮሮና	-1736
▁የህዝብ	-1737
▁ሚኒስትሩ	-1738
▁o	-1739
ጠናቀቅ	-1740
▁ስፍራ	-1741
▁በስም	-1742
▁አድርጎ	-1743
▁I	-1744
▁መታ	-1745
▁በሌላ	-1746
▁ጉዳዩ	-1747
▁ስብሰባ	-1748
▁ዝግጅት	-1749
▁መልዕክት	-1750
ቢሲ	-1751
ራር	-1752
▁የቤ	-1753
▁ካለ	-1754
ርትራ	-1755
▁አግ	-1756
▁አሳስ	-1757
▁እግር	-1758
▁መጠን	-1759
st	-1760
ፈልጉ	-1761
▁እጅግ	-1762
▁ባለፈው	-1763
ማሽ	-1764
▁D	-1765
▁ችሏል።	-1766
▁የዓለም	-1767
ራሲ	-1768
▁መብት	-1769
====	-1770
▁ስልጠና	-1771
▁‹	-1772
ላቅ	-1773
ነትን	-1774
▁17	-1775
ተዋል፡፡	-1776
ምፕ	-1777
ዘን	-1778
▁የጎ	-1779
▁በዓል	-1780
▁ምዝገባ	-1781
▁መከላከያ	-1782
▁መኪና	-1783
ኒያ	-1784
ኔት	-1785
ላል።	-1786
▁25	-1787
▁::	-1788
▁አጠቃላይ	-1789
▁ቀጥ	-1790
-19	-1791
ጥረት	-1792
▁መልካም	-1793
▁ጃ	-1794
▁ማር	-1795
▁አድርገ	-1796
ዳት	-1797
ደረጉት	-1798
▁ብለው	-1799
▁በአማራ	-1800
▁እንዴት	-1801
▁ሉ	-1802
▁ይዞ	-1803
ዳሚ	-1804
▁ስን	-1805
15	-1806
ፌዴራል	-1807
ንሲ	-1808
▁ደጋ	-1809
▁ሰራተኞች	-1810
24	-1811
ኛል	-1812
▁p	-1813
ንቲባ	-1814
▁ታው	-1815
▁ዘርፍ	-1816
ደግ	-1817
▁በኢ	-1818
▁ይህም	-1819
በብ	-1820
ነስ	-1821
ገለጸ	-1822
▁ፕሮግራም	-1823
▁ሬዲዮ	-1824
ቃል	-1825
▁ባን	-1826
▁ፎቶ	-1827
▁ሃላፊ	-1828
▁ነዋሪ	-1829
ግባት	-1830
▁አልተ	-1831
መለሱ	-1832
th	-1833
ሟል።	-1834
▁ምንጭ፦	-1835
▁ኡ	-1836
▁በበኩ	-1837
▁አንዳ	-1838
▁ባርሴሎና	-1839
▁ተሸ	-1840
▁ተጠቃ	-1841
ጋጠ	-1842
ለውን	-1843
››	-1844
▁የማን	-1845
ሯል	-1846
▁የህክምና	-1847
▁16	-1848
▁ተግባር	-1849
▁ማረ	-1850
ሰጠ	-1851
▁መዝ	-1852
▁ከም	-1853
ደባባይ	-1854
▁ኢንተር	-1855
▁አራ	-1856
▁ብሄራዊ	-1857
▁እንደሚገኝ	-1858
ዘግ	-1859
▁በባ	-1860
▁በብ	-1861
▁ካል	-1862
መም	-1863
ነግ	-1864
ንቀሳቀ	-1865
▁የግል	-1866
▁ኃይሎች	-1867
▁በዩ	-1868
▁በኃላ	-1869
▁ሎ	-1870
▁ደረጄ	-1871
▁በክልሉ	-1872
መጡ	-1873
ባቸውን	-1874
ቸዋል	-1875
ጠረው	-1876
▁ህገ	-1877
▁ደብ	-1878
▁ማዕከል	-1879
▁ከተሞች	-1880
ያቸው	-1881
ረጋገጥ	-1882
ሪስ	-1883
▁መረጃዎች	-1884
▁ከት	-1885
▁ወስ	-1886
ሰቡ	-1887
ግና	-1888
ነቱን	-1889
ቸዋል።	-1890
▁የሚገኘው	-1891
ፊዎች	-1892
▁ቴሌቪዥን	-1893
▁ዩኒቨርሲቲው	-1894
ላለፍ	-1895
▁የሰብ	-1896
▁ባለስልጣ	-1897
▁m	-1898
▁ፔ	-1899
▁በሕ	-1900
▁በከተማ	-1901
▁የሆነው	-1902
▁ፍላጎት	-1903
▁ፕሬዚ	-1904
▁‹‹	-1905
▁ሀላፊ	-1906
▁የንግድ	-1907
ቆጣጠር	-1908
▁ተነግሯል።	-1909
▁አምባሳደር	-1910
▁ቢሊዮን	-1911
▁አረጋግ	-1912
ሳው	-1913
ቃቤ	-1914
ናል።	-1915
▁፡፡	-1916
▁በተያያዘ	-1917
▁~	-1918
▁መደበኛ	-1919
▁እነዚህ	-1920
▁የኮሮና	-1921
ከበር	-1922
▁የሆኑት	-1923
▁የተነሳ	-1924
▁የገንዘብ	-1925
ቤቱ	-1926
▁ብራ	-1927
▁ሁለቱ	-1928
▁ሱዳን	-1929
ለኝ	-1930
▁በተለይ	-1931
▁*	-1932
▁የሚቆ	-1933
▁በቫይረሱ	-1934
▁ህፃ	-1935
ቁት	-1936
▁ሀይ	-1937
▁ቁጥጥር	-1938
▁ተደርጓ	-1939
gr	-1940
መዝ	-1941
ፎች	-1942
▁|	-1943
▁የሴ	-1944
▁ይመስ	-1945
ንቃ	-1946
ስቡ	-1947
ናይ	-1948
ወዳ	-1949
▁የላ	-1950
▁የሥራ	-1951
ፏል።	-1952
▁በይፋ	-1953
በራ	-1954
ገት	-1955
▁G	-1956
▁R	-1957
▁ቅሬ	-1958
▁ብለዋል፡፡	-1959
▁መሠረት	-1960
ቢይ	-1961
▁ተያይ	-1962
ባብ	-1963
▁ዘር	-1964
▁ይጠበ	-1965
ሞት	-1966
ቷን	-1967
▁ቴክኖሎጂ	-1968
▁ርዕ	-1969
ገራችን	-1970
▁ወጣቶች	-1971
▁ኢንስ	-1972
▁ደህንነት	-1973
▁መነ	-1974
▁በመተ	-1975
ማስ	-1976
▁ቅድ	-1977
▁ዩኒቨርስቲ	-1978
▁አውሮፕ	-1979
ለውም	-1980
ሰተኛ	-1981
▁ቡድኑ	-1982
▁የምግብ	-1983
▁እንደሚችል	-1984
ኬት	-1985
ጠል	-1986
▁ሜትር	-1987
▁የጸጥታ	-1988
▁ያደረገ	-1989
▁ማሸነፍ	-1990
ጮች	-1991
▁በል	-1992
▁አድራ	-1993
▁ትኩረት	-1994
▁በሊ	-1995
▁በጋራ	-1996
ent	-1997
▁መለ	-1998
▁በጀት	-1999
ሊጋ	-2000
▁ባለሙያዎች	-2001
ሻለ	-2002
ጋዊ	-2003
▁ዉስጥ	-2004
ol	-2005
ጅም	-2006
13	-2007
ሳስ	-2008
ድብ	-2009
ረፍ	-2010
▁W	-2011
▁ድል	-2012
▁ቲ	-2013
▁ነጋ	-2014
ረንሳይ	-2015
▁ንብረት	-2016
ኞችን	-2017
▁አማካ	-2018
▁ህብረት	-2019
▁ተማሪዎችን	-2020
ሬዳ	-2021
▁ትክ	-2022
▁ለመፍ	-2023
▁ባለመ	-2024
▁የተወሰ	-2025
ምረ	-2026
ስቱ	-2027
ጠዋል።	-2028
ቀርብ	-2029
▁ቅዱስ	-2030
ሽከርካሪዎች	-2031
▁ከታ	-2032
ይማኖት	-2033
▁ምግብ	-2034
▁በሚያ	-2035
▁ስድስት	-2036
ልያ	-2037
ክሲ	-2038
ያዛ	-2039
ግሪ	-2040
▁ትን	-2041
▁የፖለቲካ	-2042
ላችን	-2043
ሙስ	-2044
▁መቶ	-2045
አት	-2046
▁22	-2047
▁አረ	-2048
▁ከንቲባ	-2049
ሰበ	-2050
ቁን	-2051
ዋት	-2052
ግን	-2053
ስራቅ	-2054
▁ፕሮጀ	-2055
▁በአሁኑ	-2056
▁የአውሮፓ	-2057
ቋል	-2058
ዳቸው	-2059
▁ከሁ	-2060
▁ፊት	-2061
▁በስምኦን	-2062
ንካ	-2063
▁ከሌ	-2064
▁and	-2065
ሳቢ	-2066
ካዮች	-2067
▁ዓይ	-2068
▁ከበ	-2069
▁ስልክ	-2070
▁አመታት	-2071
▁የተባለ	-2072
▁ዐቢይ	-2073
▁ቤተሰብ	-2074
ዚሁ	-2075
ዳሜ	-2076
▁of	-2077
▁ፕሪ	-2078
ምሌ	-2079
ኮኖሚ	-2080
▁ጥር	-2081
ተሰብ	-2082
ርሽ	-2083
▁ፌ	-2084
▁ተቋም	-2085
▁መስጠት	-2086
▁የእንግሊዝ	-2087
ርማ	-2088
▁1.	-2089
▁መቆ	-2090
▁ተጋ	-2091
ቀበል	-2092
▁ስሜ	-2093
▁ማስረጃ	-2094
ኩስ	-2095
ሶስት	-2096
▁አስረድ	-2097
▁የቡ	-2098
ደጋጋሚ	-2099
▁ኢትዮጵያዊ	-2100
ለመ	-2101
ዩት	-2102
▁ወጪ	-2103
▁በተመ	-2104
▁በመግለ	-2105
ማማ	-2106
ጭር	-2107
▁ጥቃ	-2108
▁፥	-2109
ሬዳዋ	-2110
በሪያ	-2111
▁አስራ	-2112
ደርጋ	-2113
ጥነት	-2114
▁በጋ	-2115
▁እየተደረገ	-2116
ክለቡ	-2117
ኮም	-2118
ድሩ	-2119
ፈራ	-2120
ባንያ	-2121
▁ማኅ	-2122
▁ሊቀ	-2123
▁የሽ	-2124
▁መፍትሄ	-2125
ኩት	-2126
ጀንሲ	-2127
▁በደረሰ	-2128
ለጋ	-2129
ሰድ	-2130
▁O	-2131
▁ደቂቃ	-2132
ዳቤ	-2133
▁አመራር	-2134
ደረጃ	-2135
▁ከሀ	-2136
ሳቸውን	-2137
▁በሰጡት	-2138
ቆጥ	-2139
ቴል	-2140
▁በደቡብ	-2141
▁ቡና	-2142
▁ንግግር	-2143
22	-2144
ሱት	-2145
ውም	-2146
▁d	-2147
▁in	-2148
▁በሽታ	-2149
▁በአጠቃላይ	-2150
▁አቅም	-2151
ዛዝ	-2152
ኒት	-2153
ደገ	-2154
ቆማ	-2155
የንስ	-2156
▁ደቡብ	-2157
▁ዝርዝር	-2158
▁አደባባይ	-2159
ላስ	-2160
ዳሪ	-2161
▁ተደም	-2162
▁ስፔ	-2163
▁የጉ	-2164
▁የአለም	-2165
ክሮ	-2166
ጠኝ	-2167
▁ከላይ	-2168
▁ይገኛል	-2169
ፊክ	-2170
▁ተሳ	-2171
▁ወገ	-2172
ታል፡፡	-2173
▁ፍቅር	-2174
▁ሰዎችን	-2175
▁L	-2176
▁ተዋ	-2177
▁ነኝ	-2178
▁ተናግሯል።	-2179
op	-2180
▁የፓ	-2181
ባር	-2182
ቶን	-2183
▁ቆይታ	-2184
▁መምሪያ	-2185
ግል	-2186
▁አቋ	-2187
▁ድምፅ	-2188
▁ተጠርጣሪ	-2189
መንት	-2190
▁ለም	-2191
ምሩ	-2192
ቶቹ	-2193
አዊ	-2194
▁N	-2195
▁ለማግኘት	-2196
ባበር	-2197
▁መምህ	-2198
▁አስቀ	-2199
▁ክልሎች	-2200
11	-2201
ጹት	-2202
▁23	-2203
▁50	-2204
▁...	-2205
▁ተደርጎ	-2206
ሁድ	-2207
ሬዝ	-2208
▁H	-2209
ሰጠው	-2210
▁ተመል	-2211
▁ትናንት	-2212
▁ኖ	-2213
▁ስለሚ	-2214
▁ለመስጠት	-2215
▁ድርጅቶች	-2216
▁ኑ	-2217
▁የፌደራል	-2218
▁ዮ	-2219
ስቡክ	-2220
ቂት	-2221
ጫው	-2222
▁+	-2223
ግም	-2224
ጠፋ	-2225
ገለፀ	-2226
ፖሊስ	-2227
ቻቸውን	-2228
▁መስከረም	-2229
ቐለ	-2230
▁ለምን	-2231
▁በቤ	-2232
▁21	-2233
ጠቅላይ	-2234
▁በታች	-2235
▁ተፈና	-2236
▁ጥቅምት	-2237
ፈን	-2238
ንቃቄ	-2239
ማሪዎች	-2240
ህፈት	-2241
ከባቢ	-2242
▁መደረጉ	-2243
us	-2244
ስስር	-2245
▁እርዳታ	-2246
ሔር	-2247
ታማ	-2248
▁መመሪያ	-2249
▁አስተያየት	-2250
▁የሚያስችል	-2251
ጫወት	-2252
ሦስት	-2253
ay	-2254
ሊት	-2255
▁ተወካዮች	-2256
le	-2257
ኔል	-2258
ውጣት	-2259
▁አንዳንድ	-2260
ካት	-2261
▁ለወ	-2262
ዝም	-2263
ሊያን	-2264
▁እድል	-2265
▁የዩኒቨርሲቲ	-2266
ቱት	-2267
▁ጸ	-2268
▁ያገኘ	-2269
▁J	-2270
▁መሀ	-2271
መሩ	-2272
▁ቅሬታ	-2273
▁ከጥ	-2274
▁ልጆች	-2275
▁አለበት	-2276
▁ይችላል	-2277
ir	-2278
▁ተዘግ	-2279
ባዊ	-2280
▁ክትትል	-2281
▁የእሳት	-2282
ተንሀም	-2283
▁ኢትዮ	-2284
▁እስራ	-2285
ik	-2286
ልት	-2287
ኪያ	-2288
▁ተይ	-2289
ሱም	-2290
▁የጋራ	-2291
ንቋ	-2292
▁የሃ	-2293
▁መያዛ	-2294
▁አገር	-2295
ation	-2296
▁....	-2297
▁ወታደራዊ	-2298
23	-2299
▁በፈ	-2300
▁መጀመ	-2301
▁እንዲህ	-2302
▁የመጨረሻ	-2303
▁ወጣት	-2304
▁አመልክ	-2305
▁በኤ	-2306
▁አዋጅ	-2307
▁ባወጣው	-2308
▁የአንድ	-2309
▁ሹ	-2310
▁አፍ	-2311
▁ወንጀ	-2312
ሳተፉ	-2313
▁እጥረት	-2314
▁ከህ	-2315
▁ማህበር	-2316
ላላ	-2317
ቀጥል	-2318
▁ግል	-2319
▁ዘንድ	-2320
▁ፕርሚየር	-2321
ታር	-2322
ዎቹን	-2323
▁ልክ	-2324
▁ተጠና	-2325
▁ይገባል	-2326
__	-2327
ጋቢት	-2328
▁የአየር	-2329
ሰዋል።	-2330
▁የማስ	-2331
▁ተግባራዊ	-2332
▁ማህበረሰብ	-2333
▁ፍፃሜ	-2334
▁በተለይም	-2335
▁መሸ	-2336
▁ለዚህ	-2337
ላቂ	-2338
▁ካር	-2339
ዱት	-2340
ፃሚ	-2341
▁ጓ	-2342
ለዋል	-2343
▁26	-2344
▁ቅዳሜ	-2345
as	-2346
▁ቫ	-2347
ሉ፡፡	-2348
ረፍት	-2349
▁የለ	-2350
ot	-2351
▁ብዬ	-2352
▁ናት	-2353
▁መወሰ	-2354
▁መኖሪያ	-2355
▁መና	-2356
▁ውሃ	-2357
▁ገበያ	-2358
▁በተመሳሳይ	-2359
ናብ	-2360
ኤስጂ	-2361
▁በሰላም	-2362
ዳጊ	-2363
▁ጉዞ	-2364
▁ለውጥ	-2365
▁ስለሆነ	-2366
▁የደቡብ	-2367
▁ከደ	-2368
▁ለማሳ	-2369
▁በወቅ	-2370
▁ትምህር	-2371
▁ትስስር	-2372
▁በከፍተኛ	-2373
18	-2374
▁የዝ	-2375
▁የኢን	-2376
▁የሀገሪቱ	-2377
የሁ	-2378
ጣል	-2379
ጠቀሙ	-2380
▁ማግኘት	-2381
ክተ	-2382
ረዳት	-2383
▁ትዕ	-2384
▁የካቲት	-2385
▁በሳ	-2386
▁አዲሱ	-2387
▁የማንችስተር	-2388
በላ	-2389
▁ቦርድ	-2390
▁የሀገር	-2391
▁ዩኒቨርሲቲዎች	-2392
ቀረቡ	-2393
▁ወል	-2394
▁ግራ	-2395
▁ክለቦች	-2396
ተናገ	-2397
▁ፍት	-2398
▁አጠና	-2399
▁የሚፈ	-2400
▁ከአንድ	-2401
▁ኢትዮጵያውያን	-2402
ራሽ	-2403
▁የሲ	-2404
▁የኦ	-2405
▁+25	-2406
▁ችሎት	-2407
▁2016	-2408
▁ኤጀንሲ	-2409
▁ባለስልጣናት	-2410
ላትን	-2411
ኬንያ	-2412
▁27	-2413
▁አስታውቋል፡፡	-2414
ም፣	-2415
ዲህ	-2416
gram	-2417
ነታቸው	-2418
▁በቂ	-2419
▁ዋናው	-2420
▁ኩባንያ	-2421
▁√	-2422
መልከት	-2423
▁ቦታዎች	-2424
▁እየሰራ	-2425
▁ከኢትዮጵያ	-2426
ቡር	-2427
ዳዩ	-2428
▁ዲግሪ	-2429
▁ዌ	-2430
▁እራ	-2431
▁እንድት	-2432
▁28	-2433
▁ስቴ	-2434
▁ፈቃድ	-2435
ዘዋ	-2436
ስትሪ	-2437
▁አብይ	-2438
▁ሰላማዊ	-2439
▁ማክ	-2440
▁ወላ	-2441
▁ሆኗል	-2442
▁ተመራ	-2443
▁ተገቢ	-2444
ጋሪ	-2445
▁ያሳያ	-2446
▁ኮሌ	-2447
▁ጀር	-2448
▁ባለቤት	-2449
ዎን	-2450
▁መፅ	-2451
▁ሰነ	-2452
ፈረ	-2453
▁ነጻ	-2454
▁ሙከራ	-2455
▁በኦሮሚያ	-2456
▁ተሽከርካሪ	-2457
ur	-2458
ስል	-2459
ደሰ	-2460
ጡን	-2461
▁ሰኔ	-2462
▁ሰን	-2463
▁አስተዳደሩ	-2464
▁y	-2465
▁«	-2466
ምረው	-2467
ፈጸመ	-2468
▁ህይወታቸው	-2469
አብ	-2470
ጓዝ	-2471
▁2.	-2472
▁የቅ	-2473
ስቸኳይ	-2474
▁ህጻ	-2475
▁አደ	-2476
▁የዲ	-2477
ሩሲያ	-2478
▁ተሰም	-2479
▁የቴሌ	-2480
▁ሽልማት	-2481
ባሲ	-2482
ዳሴ	-2483
ም፡፡	-2484
▁ቤተሰቦ	-2485
▁እንደተናገ	-2486
:-	-2487
▁ቀጠ	-2488
▁ከው	-2489
ነኛ	-2490
ጋና	-2491
▁ሼ	-2492
▁ተጠቃሚ	-2493
▁ደብዳቤ	-2494
oin	-2495
ፎርድ	-2496
▁ስታዲ	-2497
▁የተከሰ	-2498
▁እንዲሆን	-2499
ክልል	-2500
▁ውል	-2501
ሠራ	-2502
ከናወን	-2503
em	-2504
ቀበ	-2505
ዜማ	-2506
ደረጋ	-2507
▁ማጣ	-2508
▁በአካባቢው	-2509
ባሉ	-2510
▁ቀጣይ	-2511
▁ክርስቲያን	-2512
ማቸውን	-2513
▁የቤት	-2514
ሞን	-2515
ንፈ	-2516
ፐር	-2517
▁ደም	-2518
▁ዝግጁ	-2519
▁መስተዳ	-2520
▁ወረርሽ	-2521
▁አዛ	-2522
ልኝ	-2523
ካሂ	-2524
▁የወጣ	-2525
▁ችግሮች	-2526
ቆጠር	-2527
▁ቻና	-2528
▁ኪሎ	-2529
ሳኝ	-2530
ገበ	-2531
▁ባሉ	-2532
ደርገው	-2533
▁ጥቆማ	-2534
14	-2535
ረቃ	-2536
ከረ	-2537
▁29	-2538
▁to	-2539
▁አስከ	-2540
▁የተያዙ	-2541
▁አድርጓል።	-2542
▁ተራ	-2543
▁ኤፍ	-2544
▁100	-2545
▁መግባ	-2546
▁እናት	-2547
▁ድርጊት	-2548
▁በመጠቀም	-2549
▁ይገኛሉ።	-2550
ያንዳን	-2551
▁መሬት	-2552
▁ሚላን	-2553
▁ምርት	-2554
▁በተፈ	-2555
▁ታጣቂዎች	-2556
ንታ	-2557
ድሮ	-2558
▁ሀሳብ	-2559
▁ሕዝብ	-2560
▁በዓለም	-2561
ቀርቡ	-2562
▁በቅ	-2563
ሸን	-2564
ንጉ	-2565
ያት	-2566
▁ተች	-2567
▁ሃይል	-2568
▁እንደሚገኙ	-2569
ገዛ	-2570
ጠቁ	-2571
ስትና	-2572
▁ላለ	-2573
▁ግዛት	-2574
▁በሁሉም	-2575
▁አስመልክ	-2576
ሰል	-2577
ገዳ	-2578
ፁም	-2579
▁ሬድዮ	-2580
▁ሮናል	-2581
▁ባለስልጣን	-2582
▁የቀረበ	-2583
ላይታ	-2584
ንስት	-2585
▁ልም	-2586
▁ዓመቱ	-2587
▁ስርዓት	-2588
▁እንደሌ	-2589
▁ኮንት	-2590
▁ትክክለ	-2591
ንቱ	-2592
▁ጋዜጠኛ	-2593
▁ደስ	-2594
▁ደንበ	-2595
▁በሀገሪቱ	-2596
▁ገልጸዋል፡፡	-2597
ec	-2598
ሜዳ	-2599
ያቂ	-2600
▁መፍ	-2601
▁እስራኤል	-2602
ሊን	-2603
▁ተለ	-2604
▁መጨረሻ	-2605
ለህ	-2606
▁ለበ	-2607
▁ሜሲ	-2608
▁እግ	-2609
ሞክራሲ	-2610
ራቸውን	-2611
ረር	-2612
ብብር	-2613
▁ባህር	-2614
▁ፕሬዚዳንት	-2615
▁ደሞ	-2616
▁ጋዜጣ	-2617
▁መገናኛ	-2618
▁ሰራዊት	-2619
▁ክፍሎች	-2620
▁ለመከላከል	-2621
60	-2622
ub	-2623
ዲት	-2624
▁ቁጥ	-2625
▁እየተሰራ	-2626
ይይ	-2627
▁በክ	-2628
ለች፡፡	-2629
▁ሆቴል	-2630
▁የመንግሥት	-2631
ad	-2632
ረዳው	-2633
▁ትች	-2634
▁በሚገኘው	-2635
▁ተጫዋቾች	-2636
ናቀ	-2637
ሰቢያ	-2638
▁የፋ	-2639
▁ጠባቂ	-2640
▁ጥናት	-2641
▁መስሪያ	-2642
▁በመቀ	-2643
▁መልዕክ	-2644
▁ስራዎች	-2645
▁አስታወቀ።	-2646
ድያ	-2647
▁መገደ	-2648
▁ስለመ	-2649
▁ይደው	-2650
▁በትላንት	-2651
▁የኦሮሚያ	-2652
ሌት	-2653
ቻሉ	-2654
ዞኑ	-2655
ደል	-2656
▁በቦ	-2657
▁የወንጀል	-2658
▁ልጆ	-2659
▁የመጣ	-2660
▁እንደተናገሩት	-2661
ናሽ	-2662
▁ዱ	-2663
▁ትር	-2664
▁ግቢ	-2665
▁ትግራይ	-2666
ልማ	-2667
ጊያ	-2668
ለያየ	-2669
▁እንዳስ	-2670
▁በማህበራዊ	-2671
ርቅ	-2672
ውሞ	-2673
▁እሁድ	-2674
▁መሆናቸው	-2675
ሾች	-2676
ኛውን	-2677
▁ብል	-2678
ቶሪ	-2679
▁ኤር	-2680
ምንታት	-2681
▁አስተላል	-2682
▁ህብረተሰቡ	-2683
ማው	-2684
ይቶ	-2685
ፍና	-2686
▁እየተካሄደ	-2687
**	-2688
64	-2689
▁ህን	-2690
▁ሰለ	-2691
▁ዘገባ	-2692
▁ተከሳሽ	-2693
▁ክርስቲያ	-2694
▁ለኢትዮጵያ	-2695
ለሁ።	-2696
▁አለው	-2697
▁2015	-2698
▁ቤተክር	-2699
▁በተደጋጋሚ	-2700
ቀረበ	-2701
ፈረም	-2702
▁ሆኖም	-2703
▁የተባለው	-2704
ጣኝ	-2705
ኖረው	-2706
▁ሰባት	-2707
▁ይሰጣ	-2708
▁እስራት	-2709
▁በመጀመሪያ	-2710
▁ቅጣት	-2711
▁ቤተሰቦች	-2712
▁የተደረገ	-2713
▁ምል	-2714
▁ማሻሻ	-2715
ራረ	-2716
ራዘ	-2717
ገነባ	-2718
▁አትሌት	-2719
▁የፊ	-2720
▁የምታ	-2721
▁ጥበቃ	-2722
▁ቶተንሀም	-2723
27	-2724
▁ግቦች	-2725
ዝግ	-2726
ናዊው	-2727
▁መኮ	-2728
▁ዘመቻ	-2729
▁°	-2730
ቅድመ	-2731
▁መጨ	-2732
▁መጽ	-2733
▁ሙኒክ	-2734
▁ቋንቋ	-2735
▁ግድያ	-2736
▁+2519	-2737
:30	-2738
▁አቡ	-2739
ቧል፡፡	-2740
▁ሕይወት	-2741
▁ተሳት	-2742
▁ከአዲስ	-2743
/2016	-2744
▁የነበረውን	-2745
ኦሮሞ	-2746
▁ከሚያ	-2747
▁ተረጋግ	-2748
ወያ	-2749
ጀምር	-2750
▁ግድብ	-2751
▁በሚገኙ	-2752
▁ማንኛውም	-2753
oo	-2754
ምቤ	-2755
ጨት	-2756
ጄሪያ	-2757
▁ማም	-2758
▁የቦ	-2759
▁የጋ	-2760
▁አቅራ	-2761
▁በአሜሪካ	-2762
▁ወረዳዎች	-2763
ቁም	-2764
ele	-2765
▁200	-2766
▁የጨዋታ	-2767
ሟል	-2768
ራይ	-2769
▁ጥላ	-2770
▁ተመሳሳይ	-2771
▁የኤሌክትሪክ	-2772
የአ	-2773
ሽታው	-2774
▁የሚለው	-2775
ማሩ	-2776
▁ሂደ	-2777
▁ብላ	-2778
▁ዓይነት	-2779
▁ዝውውር	-2780
▁የተገኘ	-2781
iv	-2782
ክቶ	-2783
▁ሠራ	-2784
▁አልባ	-2785
▁ተጠቁ	-2786
▁እንዲፈ	-2787
▁የመሬት	-2788
▁ግንቦት	-2789
▁በአፍሪካ	-2790
ቻለ	-2791
መለከት	-2792
▁ቀጠሮ	-2793
▁በማን	-2794
▁ነገሮች	-2795
▁የተናገ	-2796
ብሪካ	-2797
▁ፖሊ	-2798
▁ባየር	-2799
▁እንደሚገባ	-2800
40	-2801
ha	-2802
ጣዩ	-2803
▁ፈር	-2804
ፌሰር	-2805
▁ለብ	-2806
▁መገኘ	-2807
▁ሮናልዶ	-2808
▁ስለዚህ	-2809
▁ስታዲየም	-2810
ናና	-2811
ንተ	-2812
ድረስ	-2813
▁የመከላከያ	-2814
id	-2815
ላቁ	-2816
ነህ	-2817
ዮር	-2818
▁አግኝ	-2819
▁ገልጿ	-2820
▁በሌሎች	-2821
▁አስተዋ	-2822
▁ሃይ	-2823
▁የተመ	-2824
▁የሚታወ	-2825
▁ተብሏል፡፡	-2826
ሊክ	-2827
▁ሀይል	-2828
▁ማብራ	-2829
▁ኬንያ	-2830
ነዚህ	-2831
▁ሰም	-2832
▁መንገዶች	-2833
▁የፌዴራል	-2834
▁ህመም	-2835
▁እድሜ	-2836
▁ብስራት	-2837
▁መምህራን	-2838
▁ሞት	-2839
▁አለማ	-2840
.....	-2841
▁ይታወቃል።	-2842
ሳካ	-2843
ታዉ	-2844
ገስ	-2845
▁ኅ	-2846
▁3.	-2847
▁ይዘ	-2848
ያጭ	-2849
▁ኔ	-2850
ፈፀመ	-2851
▁you	-2852
▁የእስራኤል	-2853
ig	-2854
ሰስ	-2855
ቂቅ	-2856
▁መክ	-2857
ቅርታ	-2858
▁የቴ	-2859
▁ተጠቅ	-2860
▁ጥንቃቄ	-2861
▁የመጀመሪያው	-2862
ጋይ	-2863
▁አስመልክቶ	-2864
▁ለሀ	-2865
▁በምር	-2866
▁መድረክ	-2867
▁ራዲዮ	-2868
▁የሶማ	-2869
▁መንግስታት	-2870
ጠን	-2871
ጥቅ	-2872
▁ሚል	-2873
▁ሸዋ	-2874
ገራቸው	-2875
▁የግብ	-2876
▁ሻምፒየንስ	-2877
BC	-2878
ከሉ	-2879
ገገ	-2880
ደርሱ	-2881
▁ስላ	-2882
▁አስፈፃሚ	-2883
ሽኑ	-2884
ፁት	-2885
▁U	-2886
ኖሪያ	-2887
ግባብ	-2888
ጠኞች	-2889
▁ለቀ	-2890
▁በሃ	-2891
ጣሪዎች	-2892
▁ሲሆኑ	-2893
▁ተሳታ	-2894
▁ቢያንስ	-2895
▁አረቢያ	-2896
▁የተሰኘ	-2897
▁ወረርሽኝ	-2898
▁ነበር፡፡	-2899
▁እያደረገ	-2900
ow	-2901
ናግ	-2902
ጎች	-2903
▁ጆር	-2904
▁በተደረገ	-2905
ቁር	-2906
▁ጂ	-2907
በታል።	-2908
▁ተወስ	-2909
▁አዘጋጅ	-2910
▁የሰሜን	-2911
▁ማህበራዊ	-2912
ታን	-2913
ምስት	-2914
ስተዋ	-2915
▁ጉዳዩን	-2916
▁እንደገለ	-2917
35	-2918
ፍን	-2919
ዳንቱ	-2920
▁የዕ	-2921
▁ያላ	-2922
▁መስራት	-2923
▁ስፖርት	-2924
▁ጎንደር	-2925
▁ለመፍታት	-2926
ሻል	-2927
▁ሰልፍ	-2928
▁ስርዓ	-2929
▁ቀላል	-2930
▁ከዚያ	-2931
ትስ	-2932
ጻሚ	-2933
▁ጳ	-2934
መለከተው	-2935
ብረተሰብ	-2936
▁አስታውቀዋል።	-2937
▁ዛ	-2938
ንካራ	-2939
ጋንዳ	-2940
▁እንደሚያስ	-2941
ዊት	-2942
ጊዜው	-2943
▁ሰዓ	-2944
▁የሚገ	-2945
▁መጋቢት	-2946
▁ቡድኖች	-2947
ካተ	-2948
▁ኦሮ	-2949
▁ዕድል	-2950
ቪል	-2951
200	-2952
▁ካሳ	-2953
▁ስምንት	-2954
▁ይደውሉ	-2955
▁ለመጀመሪያ	-2956
▁ትራንስፖርት	-2957
un	-2958
ካን	-2959
ፏል	-2960
▁ሊጉ	-2961
ሯል፡፡	-2962
▁ባለሥ	-2963
▁l	-2964
▁ጀም	-2965
▁ገደ	-2966
▁ተሰጥ	-2967
▁ተከታታይ	-2968
ሐል	-2969
ጥም	-2970
ሳተፍ	-2971
ጠናቀቀ	-2972
ንባ	-2973
ጣጫ	-2974
▁40	-2975
▁2014	-2976
▁ጨዋታውን	-2977
ካታ	-2978
ጊስ	-2979
ጣሚ	-2980
ከላዊ	-2981
ጠበቀ	-2982
▁የተቀ	-2983
▁ዳግም	-2984
▁ጭማሪ	-2985
ባለው	-2986
▁ዝቅ	-2987
▁መልስ	-2988
▁መነሻ	-2989
▁አድራሻ	-2990
▁ያደረጉ	-2991
ባይል	-2992
▁ካም	-2993
▁የዜ	-2994
ጀርመን	-2995
▁ደስታ	-2996
17	-2997
ላህ	-2998
ቋቋም	-2999
ደረሱ	-3000
▁ተከላ	-3001
▁መንግሥ	-3002
▁ታዳጊ	-3003
▁የተለ	-3004
▁የነበሩት	-3005
45	-3006
ሄዱ	-3007
ሮን	-3008
ባበ	-3009
▁እቃ	-3010
▁የዓ	-3011
▁ማብራሪያ	-3012
▁የሚያደርጉ	-3013
ሚን	-3014
ሳቁ	-3015
ፔን	-3016
▁በን	-3017
▁ደብረ	-3018
/2015	-3019
▁የሰብዓዊ	-3020
▁የተባበሩት	-3021
ውና	-3022
ገባት	-3023
ፈጸም	-3024
▁ሕግ	-3025
▁ከብ	-3026
▁ሶስተኛ	-3027
▁በቀጥታ	-3028
▁በመሆኑም	-3029
-2	-3030
▁ቀሪ	-3031
ይናንስ	-3032
▁ኮማን	-3033
▁አድርገው	-3034
▁ማስታወቂያ	-3035
▁ደመ	-3036
▁ሚንስት	-3037
▁አቅጣጫ	-3038
▁ጨምረው	-3039
▁መያዛቸው	-3040
▁መተግ	-3041
▁ሆኗል።	-3042
▁እምነት	-3043
ለጥ	-3044
▁ተመልክ	-3045
▁እስኪ	-3046
▁የመግ	-3047
▁ይዘው	-3048
▁የነዳጅ	-3049
ro	-3050
ሲል	-3051
▁ድምጽ	-3052
▁የለም።	-3053
▁የተሻለ	-3054
▁ጠቁመዋል።	-3055
ማል	-3056
ሪን	-3057
▁ገብረ	-3058
▁በሁለት	-3059
▁ፒኤስጂ	-3060
ቧል	-3061
ካኤል	-3062
ንድሮው	-3063
ዱስትሪ	-3064
▁ቅድመ	-3065
▁በዚሁ	-3066
▁በግል	-3067
ሷል	-3068
ቀፍ	-3069
▁ሰል	-3070
▁ሰኞ	-3071
▁ፌዴ	-3072
▁አብዛ	-3073
▁ጌታቸው	-3074
ter	-3075
ያዘው	-3076
▁ኤሌክትሪክ	-3077
ቃወ	-3078
▁ኒው	-3079
▁እዚህ	-3080
▁እንደምት	-3081
ሪት	-3082
ነበረ	-3083
▁ቤን	-3084
▁ነው፤	-3085
▁ጭምር	-3086
▁ወታደሮች	-3087
▁ተናግረዋል	-3088
▁n	-3089
▁የቢ	-3090
ዮርጊስ	-3091
▁2013	-3092
▁አከባቢ	-3093
eb	-3094
▁አጥቂ	-3095
▁ደርሶ	-3096
▁የምርጫ	-3097
ናገር	-3098
▁1,	-3099
▁ለገ	-3100
▁ባህ	-3101
▁የን	-3102
▁የሙ	-3103
▁ከመረብ	-3104
▁የሱዳን	-3105
▁ያላቸውን	-3106
▁የሚያደርግ	-3107
ያም	-3108
ባባሪ	-3109
ጂታል	-3110
▁ከግ	-3111
▁ጎን	-3112
▁መሆኑንም	-3113
መራው	-3114
▁መከላከል	-3115
▁የሚቆጠሩ	-3116
ቡቲ	-3117
ጠለ	-3118
ሰልጣ	-3119
▁ሀብ	-3120
▁እያለ	-3121
▁ፋብሪካ	-3122
39	-3123
ችኋ	-3124
ከባ	-3125
ኮት	-3126
ዚቃ	-3127
ንነት	-3128
▁ለት	-3129
▁ህጋዊ	-3130
/2014	-3131
ወደ	-3132
▁ሽን	-3133
ጀመረው	-3134
▁መጀመሪያ	-3135
▁ደጋፊዎች	-3136
ዳረ	-3137
▁ግጭ	-3138
▁ትዕዛዝ	-3139
▁በነበረው	-3140
ቴን	-3141
ጣቸው	-3142
▁መጣ	-3143
▁ርዕሰ	-3144
▁በትላንትናው	-3145
28	-3146
▁ኮር	-3147
▁የቱ	-3148
▁ውድድ	-3149
▁ተገልጿል፡፡	-3150
ወለ	-3151
ጣራ	-3152
ጪው	-3153
ቀላቀሉ	-3154
▁በህገ	-3155
▁ጥራት	-3156
▁መሪዎች	-3157
▁በሀገር	-3158
ሃት	-3159
ረክ	-3160
ን፣	-3161
▁ሊሆን	-3162
▁ሰሜን	-3163
▁ተጠያቂ	-3164
▁አማራጭ	-3165
▁ጊዜያዊ	-3166
ገደሉ	-3167
▁ስደ	-3168
▁ፍሬ	-3169
▁ተሰማ	-3170
▁ተቋሙ	-3171
ጎዳ	-3172
▁ልብ	-3173
▁አባት	-3174
▁በወቅቱ	-3175
▁ወገኖች	-3176
ፈፀም	-3177
▁ሚና	-3178
▁ስሜት	-3179
▁ተቀብ	-3180
▁ካርድ	-3181
▁ክለቡ	-3182
▁የሚጠ	-3183
▁ጉብኝ	-3184
▁የምርመራ	-3185
▁ፕሪሚየር	-3186
▁በትምህርት	-3187
▁ጫና	-3188
▁ስምም	-3189
▁በቀለ	-3190
▁ተፈናቃ	-3191
▁አውሮፕላን	-3192
ህሳስ	-3193
▁የህግ	-3194
▁በበኩላቸው	-3195
21	-3196
77	-3197
▁ዊ	-3198
ነራል	-3199
ሰጣቸው	-3200
ጨዋታው	-3201
▁ማረፊያ	-3202
▁በሰሜን	-3203
▁ወቅታዊ	-3204
▁ችለዋል።	-3205
ቀም	-3206
ቆስ	-3207
ፎር	-3208
ቬንቱ	-3209
ታወቁ	-3210
ጠራው	-3211
▁ያው	-3212
▁መርሃ	-3213
▁ሁሉንም	-3214
ንና	-3215
▁ሰፊ	-3216
▁የጣ	-3217
ረጋጋት	-3218
▁እረፍት	-3219
▁የኮቪድ	-3220
▁ኮንትራት	-3221
▁ፕሮፌሰር	-3222
im	-3223
▁የመስ	-3224
▁የምና	-3225
ሎምፒ	-3226
መልስ	-3227
▁ሊዮ	-3228
2016	-3229
▁በጦር	-3230
▁የውሃ	-3231
▁አድርገዋል።	-3232
▁ተሽከርካሪዎች	-3233
▁ትል	-3234
▁አቻ	-3235
▁አሰራ	-3236
▁ደርሷል።	-3237
መልከ	-3238
ጥፋት	-3239
ገኙበት	-3240
▁ከቀኑ	-3241
ንቀሳቀሱ	-3242
▁አገራት	-3243
▁ይልቅ	-3244
ስማ	-3245
ሽቱ	-3246
ራች	-3247
ሰረ	-3248
ባችን	-3249
ደርገ	-3250
ቀላቀል	-3251
በአ	-3252
ንጋ	-3253
ስተካ	-3254
▁የአር	-3255
ag	-3256
ሸጥ	-3257
▁ያመ	-3258
▁ያን	-3259
▁ፍቃድ	-3260
▁ኤምባሲ	-3261
▁መላ	-3262
▁እንደማ	-3263
▁የፖሊስ	-3264
elegram	-3265
▁ይጠበቃል።	-3266
▁አስረድተዋል።	-3267
ጧል	-3268
ቻይና	-3269
▁እሱ	-3270
▁የሟ	-3271
▁ዘጠኝ	-3272
▁መግቢያ	-3273
▁እንዲቀ	-3274
▁ሳምንታት	-3275
▁በፍጥነት	-3276
ረታ	-3277
ኖስ	-3278
▁ሳው	-3279
▁ሶማ	-3280
▁ከዛ	-3281
ከታተል	-3282
▁መስቀል	-3283
▁ማሻሻያ	-3284
▁አትሌቲ	-3285
▁በመንግስት	-3286
----------------	-3287
ላሴ	-3288
ዚአብ	-3289
▁ታደሰ	-3290
▁ተገለጸ	-3291
ብቅ	-3292
▁የጠ	-3293
▁በረራ	-3294
▁አርብ	-3295
▁የሚመ	-3296
▁ህፃናት	-3297
▁አንስተ	-3298
ፕሎ	-3299
ሴቶች	-3300
▁ኮሌጅ	-3301
▁የድር	-3302
▁ቅርንጫ	-3303
▁በመገኘ	-3304
ረግ	-3305
ቆይ	-3306
ኒስት	-3307
▁ክብር	-3308
▁አስቆጥ	-3309
▁ይችላሉ	-3310
ሕር	-3311
ቀደ	-3312
▁በፕ	-3313
▁ይፈ	-3314
▁ጥያቄዎች	-3315
▁የትራንስፖርት	-3316
ታሉ	-3317
▁ለመቀ	-3318
▁ብዛት	-3319
▁ተያይዞ	-3320
▁የትራፊክ	-3321
▁ተደርጓል።	-3322
ረምት	-3323
▁ተደራ	-3324
▁መረጃዎችን	-3325
!"	-3326
በተ	-3327
ከው	-3328
ጦታ	-3329
▁ለሰ	-3330
▁ሀብት	-3331
▁ረቂቅ	-3332
▁ሰአት	-3333
▁ወሳኝ	-3334
▁ሀሰተኛ	-3335
▁አቅርቦት	-3336
▁ይመስላል	-3337
ላሳ	-3338
▁”	-3339
ቃቸው	-3340
▁አስታዉ	-3341
▁ኮሚሽኑ	-3342
▁ባደረጉት	-3343
▁ቤተክርስቲያን	-3344
ነገ	-3345
ኒው	-3346
ዲና	-3347
ድኑ	-3348
ጣን	-3349
ግባር	-3350
ብራቶሪ	-3351
▁በመስጠት	-3352
ች።	-3353
ንኩ	-3354
ገኙት	-3355
በርካታ	-3356
▁ነበሩ	-3357
▁ተጠባቂ	-3358
▁ያገኘነው	-3359
በታ	-3360
ነትና	-3361
▁አልፎ	-3362
▁ትራምፕ	-3363
▁ከሁለት	-3364
▁የተኩስ	-3365
▁ኮሚሽነር	-3366
▁አማካኝነት	-3367
ም፤	-3368
ውሰድ	-3369
ግብር	-3370
▁ህል	-3371
▁መሞ	-3372
▁ንጉ	-3373
▁መሀመድ	-3374
▁የሚወስ	-3375
▁ጠንካራ	-3376
▁ታውቋል።	-3377
ለኛ	-3378
ዬን	-3379
ሻንጉ	-3380
ዟል።	-3381
▁ለሌ	-3382
▁የመን	-3383
▁ፈጣሪ	-3384
ቆያ	-3385
ላሉ።	-3386
ዊተር	-3387
ዷል።	-3388
▁ምት	-3389
▁የሳ	-3390
▁አመቱ	-3391
▁ድርሻ	-3392
▁መደረጉን	-3393
▁ባደረገው	-3394
80	-3395
▁በላ	-3396
▁ከቤ	-3397
መዘገቡ	-3398
▁ኢትዮጵያን	-3399
ሮቹ	-3400
ጅቱ	-3401
ከናወነ	-3402
▁ወደፊት	-3403
▁ትክክለኛ	-3404
▁ፓርቲዎች	-3405
?"	-3406
▁ፉ	-3407
▁ብቸ	-3408
▁ቦር	-3409
▁ስትል	-3410
▁አቀባ	-3411
▁የዛሬ	-3412
▁ያስተ	-3413
▁ለማወቅ	-3414
▁የሚሰራ	-3415
ቋሙ	-3416
▁ለፍ	-3417
▁ችሎ	-3418
▁ተቀም	-3419
▁ነዳጅ	-3420
▁ወርቅ	-3421
▁በሁለቱ	-3422
▁ናቸው፡፡	-3423
ረበ	-3424
ብሮ	-3425
ሐመድ	-3426
▁ሕዝ	-3427
▁ተመር	-3428
▁ሚልዮን	-3429
▁ማረጋገ	-3430
▁ስርጭት	-3431
ሩም	-3432
ምቤላ	-3433
ዶችን	-3434
▁ሙስ	-3435
በራቸው	-3436
ታወቀው	-3437
▁ቁሳቁ	-3438
▁ቻይና	-3439
▁ምዕራብ	-3440
▁ብለዋል	-3441
▁ድርድር	-3442
ወራ	-3443
ቨስት	-3444
መለከታቸው	-3445
44	-3446
▁th	-3447
▁ህዳር	-3448
▁አደጋው	-3449
▁የሚችል	-3450
ተሻ	-3451
ነቶች	-3452
▁ነን	-3453
▁የዳ	-3454
▁ጥቅ	-3455
▁ብርሃ	-3456
▁አንተ	-3457
▁እስር	-3458
▁ግብረ	-3459
▁ጽህፈት	-3460
▁በመተባበር	-3461
ዮቹ	-3462
ጁን	-3463
▁ቀይ	-3464
▁ንብረ	-3465
▁አላማ	-3466
▁አዳዲስ	-3467
▁አስቸኳይ	-3468
ሴን	-3469
መለክ	-3470
ቋረጥ	-3471
▁በሞ	-3472
▁ከዛሬ	-3473
▁ያገኛ	-3474
▁የአካል	-3475
▁አይደለም።	-3476
ዘረ	-3477
ers	-3478
▁ሀያ	-3479
▁ካሉ	-3480
ጠናቀቁ	-3481
▁የወሰ	-3482
▁መብራት	-3483
▁ማለፉን	-3484
▁እንዳለበት	-3485
ch	-3486
ነታ	-3487
የተ	-3488
▁ገና	-3489
▁0-0	-3490
▁አብረ	-3491
▁እቅድ	-3492
ረንሳ	-3493
ዎችና	-3494
ቬንቱስ	-3495
▁መተግበሪያ	-3496
ce	-3497
ሐሴ	-3498
▁ባሳ	-3499
▁ታስ	-3500
▁ሩሲያ	-3501
▁አብዱ	-3502
▁መጠቀም	-3503
▁ትብብር	-3504
▁አቀባይ	-3505
▁እንዳለው	-3506
▁ምክንያቱም	-3507
ባባ	-3508
ዑዲ	-3509
ድም	-3510
ሪዝም	-3511
ጨመረ	-3512
ፈጸሙ	-3513
ፕሎማ	-3514
▁ድረ	-3515
ረጋገጠ	-3516
▁ሀገራ	-3517
▁ስብስ	-3518
▁ምስጋና	-3519
▁ቲክቫህ	-3520
▁ዘመናዊ	-3521
▁የሚሆን	-3522
▁አስተዳዳሪ	-3523
100	-3524
ኖችን	-3525
ረዋል።	-3526
▁በተከሰ	-3527
▁የሚገኝ	-3528
▁ፖለቲካ	-3529
▁ሰጥተዋል።	-3530
ሁፍ	-3531
▁ገዳ	-3532
ጠናከር	-3533
ፌስቡክ	-3534
ab	-3535
ሺህ	-3536
▁70	-3537
▁አታ	-3538
▁ምድብ	-3539
ዳል	-3540
ፋን	-3541
500	-3542
ሞኑን	-3543
▁መልሶ	-3544
▁ብለን	-3545
ቲን	-3546
ናትን	-3547
▁ስልጣን	-3548
▁ተሳትፎ	-3549
ለል	-3550
ቆች	-3551
ልስጤ	-3552
▁በገ	-3553
ሻንጉል	-3554
▁ነበረ	-3555
▁አጋር	-3556
▁በነገው	-3557
▁አስኪያ	-3558
▁ይገኛሉ	-3559
▁ፕሮጀክ	-3560
▁ኮማንደር	-3561
▁]	-3562
▁e	-3563
▁h	-3564
▁አሕ	-3565
▁ጅማ	-3566
ገንባት	-3567
▁ተፈታ	-3568
▁መብቶች	-3569
▁ሠራዊት	-3570
▁ተቀባይ	-3571
ሰና	-3572
ንዛ	-3573
ዲን	-3574
በታል	-3575
ዎች፣	-3576
▁4.	-3577
ነጋገር	-3578
▁ሲሆን፤	-3579
16	-3580
ሴት	-3581
ፋሪ	-3582
ፐብ	-3583
ሻሻል	-3584
ቀመጥ	-3585
▁In	-3586
▁ልዑ	-3587
▁ዩሮ	-3588
▁ልምድ	-3589
▁በሊጉ	-3590
▁በሰጠው	-3591
▁ፕሮግራ	-3592
▁በመግባት	-3593
▁የአካባቢው	-3594
▁በካ	-3595
▁ዕጣ	-3596
▁ውድቅ	-3597
▁የሚችሉ	-3598
▁የአደጋ	-3599
▁ይፈልጋ	-3600
▁የሚደረግ	-3601
▁ይገኛል፡፡	-3602
ለቅ	-3603
ሳል	-3604
thi	-3605
በራት	-3606
ኔራል	-3607
▁አነ	-3608
▁የሸ	-3609
ናቸውን	-3610
▁ሊዮኔል	-3611
▁አንደኛ	-3612
▁እንግሊ	-3613
▁የሕዝብ	-3614
▁የኦሮሞ	-3615
▁የዝውውር	-3616
▁ጠይቀዋል።	-3617
ሀን	-3618
ድሜ	-3619
ላዊው	-3620
ሶችን	-3621
ግስት	-3622
ጠንቀ	-3623
▁ይቻ	-3624
▁አለን	-3625
▁ከሌሎች	-3626
▁ይቅርታ	-3627
ore	-3628
የቱን	-3629
▁ሲኖ	-3630
▁በቴሌ	-3631
▁የመሐል	-3632
▁የበለጠ	-3633
ወል	-3634
ጉም	-3635
ርቶዶ	-3636
ደንት	-3637
▁በዕ	-3638
▁ገፅ	-3639
2014	-3640
ጋጠመው	-3641
▁ሦስት	-3642
▁ጠዋት	-3643
▁ፑ	-3644
▁ይታ	-3645
▁2017	-3646
▁ህይወቱ	-3647
▁በአሁን	-3648
▁ማስቆጠር	-3649
▁አቅርበዋል።	-3650
com	-3651
ጀንቲ	-3652
ከታተሉ	-3653
▁በቀን	-3654
▁ወዲህ	-3655
▁መድረሱን	-3656
pp	-3657
ረከ	-3658
ቀን	-3659
ቃሉ	-3660
በሳ	-3661
▁ማው	-3662
▁ኤል	-3663
▁ከል	-3664
▁ከሳ	-3665
▁ለመግ	-3666
▁መኮንን	-3667
▁የቀድሞው	-3668
ፍቶ	-3669
ፖሊ	-3670
▁ታማ	-3671
ፈልገው	-3672
▁ተባለ	-3673
▁ካምፓ	-3674
▁በድጋሚ	-3675
▁የገለጹት	-3676
▁ይታወሳል፡፡	-3677
70	-3678
ተኮ	-3679
ዝና	-3680
▁ማይ	-3681
▁ግም	-3682
▁ለሚያ	-3683
▁በመስ	-3684
▁ችሏል	-3685
▁የቅድመ	-3686
▁አሰልጣኙ	-3687
▁ከተለያዩ	-3688
▁የማህበራዊ	-3689
▁የተናገሩት	-3690
▁is	-3691
▁መደ	-3692
▁ብሩ	-3693
ፔክተር	-3694
▁ክስተ	-3695
▁የዋጋ	-3696
▁አሕመድ	-3697
ኝታ	-3698
ይታ	-3699
ፈታ	-3700
ተናል	-3701
ገበው	-3702
ሳይንስ	-3703
▁መልቀ	-3704
▁መኖር	-3705
▁ቻናል	-3706
▁ይሆን	-3707
▁ተቃውሞ	-3708
▁የሚሰጥ	-3709
▁መታወቂያ	-3710
▁የስፖርት	-3711
ው።	-3712
ማርኛ	-3713
▁እጩ	-3714
▁ዝናብ	-3715
ዚአብሔር	-3716
▁አንስቶ	-3717
ህና	-3718
ኗል።	-3719
▁ሐምሌ	-3720
▁መልክ	-3721
▁ድንበር	-3722
▁ለማስፈረም	-3723
========	-3724
▁ቪላ	-3725
▁መሰል	-3726
▁መቀመ	-3727
▁መንፈ	-3728
▁ወለጋ	-3729
▁እንግሊዝ	-3730
▁ያሳያል።	-3731
▁ፕሮጀክት	-3732
ለበት	-3733
ዘነጋ	-3734
ድድሩ	-3735
▁ከጠ	-3736
▁ምንድ	-3737
▁ይኖር	-3738
▁እያንዳን	-3739
▁ለመቆጣጠር	-3740
▁እንደሚችሉ	-3741
▁ገልጿል፡፡	-3742
ርሲ	-3743
ዓመቱ	-3744
ፈለጉ	-3745
▁ክብ	-3746
ሎምፒክ	-3747
▁ባለፈ	-3748
ቃቂ	-3749
ኖቹ	-3750
ጀመሩ	-3751
ገተኛ	-3752
▁ጎል	-3753
2015	-3754
▁የከፍተኛ	-3755
29	-3756
▁ፓር	-3757
▁ሀዋሳ	-3758
▁ግንባር	-3759
ሰኞ	-3760
ሲብ	-3761
ረጅም	-3762
ገናኘ	-3763
ገናኝ	-3764
▁ተቋማ	-3765
▁ጉብኝት	-3766
▁የሚሆኑት	-3767
ሊንግ	-3768
▁ስጋ	-3769
ሰብሰብ	-3770
▁500	-3771
▁ለንደ	-3772
▁በምን	-3773
▁መረጃው	-3774
▁ብዙሃን	-3775
▁አለብን	-3776
ጣቱ	-3777
ሳችሁ	-3778
▁ወድ	-3779
ሆናቸው	-3780
በረሰቡ	-3781
▁የሚታ	-3782
▁የሚለውን	-3783
▁ተሰምቷል።	-3784
ናቱ	-3785
በልጥ	-3786
▁ሳያ	-3787
▁ሃሳብ	-3788
▁ብራዚ	-3789
▁እንስ	-3790
▁ዓላማ	-3791
▁በከተማዋ	-3792
ሃል	-3793
▁አርቴ	-3794
▁ዌስት	-3795
ቀዋል፡፡	-3796
▁ለበለጠ	-3797
▁መንገዱ	-3798
▁ለቲክቫህ	-3799
▁v	-3800
ሆስፒ	-3801
ቅርብ	-3802
▁ልት	-3803
ቃል፡፡	-3804
ፈዋል።	-3805
▁መሰረ	-3806
▁አለኝ	-3807
▁የሊጉ	-3808
▁ጊዮርጊስ	-3809
▁በተደረገው	-3810
ጻጸ	-3811
ንዶች	-3812
▁በሰው	-3813
▁ክፍት	-3814
▁ልምምድ	-3815
▁መስተዳድር	-3816
ሃም	-3817
ሻገር	-3818
ቸጋሪ	-3819
ዘጋጁ	-3820
▁ዝም	-3821
▁ለማን	-3822
▁መጠየ	-3823
▁ሊቀመን	-3824
▁ሰዓታት	-3825
▁ያስፈልጋ	-3826
▁01	-3827
▁አርባ	-3828
▁አቀፉ	-3829
▁ያስቆ	-3830
▁በጉዳዩ	-3831
▁የቲክቫህ	-3832
▁እንዲያደርጉ	-3833
ችልም	-3834
▁60	-3835
▁ካፕ	-3836
▁አክለ	-3837
▁ይቀጥ	-3838
ነታቸውን	-3839
▁ተናገሩ	-3840
▁የተባሉ	-3841
▁ዩናይት	-3842
▁ሚዲያዎች	-3843
▁አስፈላጊውን	-3844
ዛን	-3845
ይህ	-3846
▁ህወሓት	-3847
▁እንዳያ	-3848
▁ተማሪዎቹ	-3849
ሃብ	-3850
ዮችን	-3851
▁ወንዶች	-3852
▁የክልል	-3853
▁ያለበት	-3854
ኬል	-3855
ክሬ	-3856
▁ተል	-3857
▁እኮ	-3858
▁ወሎ	-3859
▁በህግ	-3860
▁የኮሚ	-3861
▁እንድታ	-3862
▁ወረቀት	-3863
▁አስፈጻሚ	-3864
▁ተዘግቧል።	-3865
▁አሳስቧል።	-3866
ሳሌ	-3867
ዩብ	-3868
ሪቱን	-3869
ርዳታ	-3870
ተኛው	-3871
▁ራሱን	-3872
▁ባለቤ	-3873
▁እያሳ	-3874
▁ኮከብ	-3875
▁የማህ	-3876
▁ለአንድ	-3877
▁ተጨዋቾች	-3878
▁አውሮፕላ	-3879
ረፋ	-3880
ዛው	-3881
ዜአ	-3882
▁በሶማ	-3883
▁በድር	-3884
▁ኮሪያ	-3885
▁ሚንስትር	-3886
▁Telegram	-3887
ወድ	-3888
ጣጥ	-3889
▁ኣ	-3890
ist	-3891
ረዋል	-3892
▁ወዳ	-3893
ኖራቸው	-3894
▁ልብስ	-3895
▁እያስ	-3896
▁የባለ	-3897
▁ለንደኑ	-3898
ሎን	-3899
ስትራ	-3900
ፈኞቹ	-3901
▁መቼ	-3902
▁ቦሌ	-3903
ምምነት	-3904
▁ሲያስ	-3905
ርቶዶክስ	-3906
በዋል፡፡	-3907
▁ሰብዓዊ	-3908
▁ችግሩን	-3909
▁የኤርትራ	-3910
ዳና	-3911
▁ብት	-3912
▁ካሜ	-3913
▁ገንዘ	-3914
ገልግሎት	-3915
▁በበኩሉ	-3916
▁ቢሊየን	-3917
▁ጋርዲዮ	-3918
▁ሠራተኞች	-3919
▁አስቀድሞ	-3920
▁ጠይቋል።	-3921
ምስ	-3922
ሊዮን	-3923
በረታ	-3924
ፀጥታ	-3925
ተኞችን	-3926
▁ስቴትስ	-3927
▁ዜጎችን	-3928
▁የሴቶች	-3929
መቻ	-3930
ሰለ	-3931
ቶኒ	-3932
ንዴ	-3933
ግባቡ	-3934
▁የሚሉ	-3935
▁ተቀባይነት	-3936
▁እንዲደረግ	-3937
ቀሰ	-3938
▁ቬ	-3939
▁ኳ	-3940
▁ዎ	-3941
ገለፅ	-3942
▁ይኖ	-3943
▁በስፋት	-3944
▁እውቅና	-3945
ሁት	-3946
ሚር	-3947
ዋር	-3948
▁‘	-3949
▁ለጥ	-3950
▁ሚያ	-3951
▁ናይ	-3952
▁ሞገስ	-3953
▁ሪፖር	-3954
▁2012	-3955
▁ተግባራት	-3956
▁አለባቸው	-3957
ርጦ	-3958
ሳዊ	-3959
ነብ	-3960
ዕኖ	-3961
ታቸዉ	-3962
ክኒክ	-3963
▁ሕገ	-3964
▁ስህ	-3965
▁ባስ	-3966
ለን፡፡	-3967
▁መጽሐ	-3968
▁ስለተ	-3969
▁የወደ	-3970
▁አሰላለፍ	-3971
▁ኢንስቲት	-3972
▁እንደሚሰጥ	-3973
ምጣት	-3974
▁አቤ	-3975
▁አና	-3976
▁ከኮ	-3977
▁ህንፃ	-3978
▁ሊንክ	-3979
▁ሰነድ	-3980
▁የሁለት	-3981
▁ያደረገው	-3982
▁ኢንዱስትሪ	-3983
▁ተጠርጣሪዎች	-3984
ሎስ	-3985
ሸት	-3986
ook	-3987
ስታን	-3988
ፈፀሙ	-3989
▁ጥፋ	-3990
▁በአለም	-3991
▁አባቶች	-3992
▁እንዳሉ	-3993
▁በተገኙበት	-3994
........	-3995
▁የዩኒቨርሲቲው	-3996
ለዉ	-3997
ቃቱ	-3998
ine	-3999
ችለው	-4000
▁ታይ	-4001
▁ጣል	-4002
ዳቸውን	-4003
▁ላይም	-4004
▁መያዙ	-4005
▁በመያዝ	-4006
▁ለመመለስ	-4007
os	-4008
ቀስ	-4009
ጣራት	-4010
▁መቻ	-4011
▁ክህ	-4012
▁ጣቢያዎች	-4013
▁ተጠቁሟል።	-4014
NA	-4015
ስኮ	-4016
ጠነ	-4017
▁ሲነ	-4018
▁ግዜ	-4019
ሸነፊያ	-4020
▁ገደማ	-4021
▁ልዩነት	-4022
▁ሲሆን፣	-4023
▁በሱዳን	-4024
▁አግባብ	-4025
▁የሚኖሩ	-4026
ኒቨርሲቲው	-4027
▁ጋርዲዮላ	-4028
▁ኢንስፔክተር	-4029
▁በቡ	-4030
▁ቀዳሚ	-4031
▁አርቲ	-4032
▁ኢንጂ	-4033
▁እናም	-4034
▁ህጻናት	-4035
▁ያደርጋ	-4036
▁ተጎ	-4037
▁አሊ	-4038
▁ምዕራ	-4039
▁Join	-4040
▁ሥርዓት	-4041
▁በኮቪድ	-4042
▁መጀመሩን	-4043
▁በአውሮፓ	-4044
ly	-4045
ሆነው	-4046
ካሄዱ	-4047
▁90	-4048
▁በጅ	-4049
▁ታላቅ	-4050
▁የአል	-4051
▁ያለፈ	-4052
▁ኢኮኖሚ	-4053
▁ከእስር	-4054
ሌይ	-4055
ወቀ	-4056
ጋዬ	-4057
ምንቱ	-4058
ሳሰብ	-4059
ወሰነ	-4060
▁ቋሚ	-4061
▁ጠብ	-4062
▁ርቀት	-4063
▁ኮርፖ	-4064
▁ድልድ	-4065
▁ለመስራት	-4066
▁አይዘነጋ	-4067
▁እያደረጉ	-4068
▁የማሸነፊያ	-4069
ET	-4070
▁በፓ	-4071
▁የኔ	-4072
ተኝነት	-4073
▁በውጭ	-4074
▁ኒውካ	-4075
▁የዚህ	-4076
▁ያለመ	-4077
ላክቷል።	-4078
▁ለሁለት	-4079
▁ሰለሞን	-4080
▁ባይደን	-4081
▁ተመራቂ	-4082
▁የሚባል	-4083
ቨስትመንት	-4084
▁ተደምጠዋል።	-4085
ረኛ	-4086
▁የሩ	-4087
▁መስጠ	-4088
▁ማለፍ	-4089
▁ሳቢያ	-4090
▁የተቃ	-4091
▁የመረጃ	-4092
▁የላብራቶሪ	-4093
ጋን	-4094
መዝገብ	-4095
▁ኃላፊነት	-4096
▁የሚገኙት	-4097
ዋቂ	-4098
ጋዜ	-4099
መረጡ	-4100
ወሰደ	-4101
ጋቸው	-4102
ዘጋጀት	-4103
▁የመው	-4104
▁ላለፉት	-4105
▁ድርጅቱ	-4106
▁አንድነት	-4107
▁ሀሳ	-4108
▁ሳን	-4109
▁ጉድ	-4110
ኅበራዊ	-4111
▁ትችላ	-4112
▁በአግባቡ	-4113
▁ኢትዮጵያዊያን	-4114
ከም	-4115
▁ለስ	-4116
▁ፈቃ	-4117
▁ፍቃ	-4118
ዘጋጀው	-4119
▁በምት	-4120
▁አሰራር	-4121
▁የሰብአዊ	-4122
ፈተ	-4123
ፌዴሪ	-4124
▁በነፃ	-4125
▁ለአዲስ	-4126
▁በነበረ	-4127
▁ተሳታፊ	-4128
▁እውነት	-4129
▁የባህር	-4130
▁የተለየ	-4131
ምቦ	-4132
ውልድ	-4133
▁ሆና	-4134
▁ለነ	-4135
▁በድን	-4136
▁ቫይረሱ	-4137
ናቂ	-4138
ላለፈ	-4139
ልጠና	-4140
ክተሩ	-4141
▁35	-4142
▁ለኢ	-4143
▁ታግ	-4144
▁ፔፕ	-4145
▁ቦታው	-4146
▁ኤሪክ	-4147
▁ለመሆን	-4148
▁ሰጥቷል።	-4149
አይ	-4150
ፃፀ	-4151
▁g	-4152
ላይን	-4153
ታችሁ	-4154
▁በአን	-4155
▁አዳማ	-4156
▁ምንጮች	-4157
▁ብርሃኑ	-4158
▁አቀባበል	-4159
▁አድርጓል	-4160
86	-4161
ቾቹ	-4162
ከን	-4163
ቢዎች	-4164
ደገፍ	-4165
ጠየቅ	-4166
▁on	-4167
▁ሁሌ	-4168
▁ሙያ	-4169
▁ዳን	-4170
▁ዐቃቤ	-4171
▁ጥቂት	-4172
▁በእንግሊዝ	-4173
ሞላ	-4174
ገዝ	-4175
ወሰዱ	-4176
▁የቁ	-4177
▁ማለዳ	-4178
▁ሲኖዶ	-4179
▁ቢቢሲ	-4180
▁ባንኩ	-4181
▁ችግሩ	-4182
▁አርቴታ	-4183
▁የፈተና	-4184
▁እንግሊዛ	-4185
▁እየጨመረ	-4186
.5	-4187
ሙዝ	-4188
ቀና	-4189
▁ሾ	-4190
ቨርተን	-4191
▁ሲሉም	-4192
▁በስተ	-4193
▁በዋና	-4194
▁ዘላቂ	-4195
▁የአን	-4196
▁ታህሳስ	-4197
▁ማድረጉን	-4198
▁ይቀላቀሉ	-4199
▁us	-4200
▁ራስ	-4201
▁ከጎ	-4202
▁ወኪ	-4203
▁ገበ	-4204
ሰባሰብ	-4205
▁ፍትህ	-4206
ቸዋል፡፡	-4207
▁መሐመድ	-4208
▁ክልላዊ	-4209
▁የበላይ	-4210
▁በምዕራብ	-4211
ወዝ	-4212
ደስ	-4213
ደቡ	-4214
ገናኙ	-4215
▁መሥ	-4216
▁ሥነ	-4217
▁ገጽ	-4218
▁ፍራ	-4219
2013	-4220
▁ማቅረ	-4221
የታቸውን	-4222
▁የለውም	-4223
▁እንዳሉት	-4224
▁የሚያሳይ	-4225
▁የብሔራዊ	-4226
99	-4227
ess	-4228
ቅምት	-4229
ባቸዉ	-4230
ይተን	-4231
▁መጋ	-4232
▁ቴን	-4233
▁ሕይወ	-4234
▁ባህል	-4235
▁ታሪካ	-4236
▁ትጥቅ	-4237
ባቸዋል።	-4238
▁የተሰጠ	-4239
▁ደስተኛ	-4240
▁የኢኮኖሚ	-4241
ላቱ	-4242
ያቸውን	-4243
▁ላሊጋ	-4244
▁አቋም	-4245
▁የሚተ	-4246
▁አንቶኒ	-4247
▁ፌዴሬሽን	-4248
ity	-4249
ችውን	-4250
▁አዲ	-4251
ሰልጣኝ	-4252
ገባቸው	-4253
ጠንቀቂያ	-4254
▁እንደም	-4255
▁ከምሽቱ	-4256
▁የኢትዮ	-4257
ግሌ	-4258
ፓን	-4259
▁መድሃ	-4260
▁ስጦታ	-4261
ላጭ	-4262
ፈፀመው	-4263
▁ማርቲ	-4264
▁ቀውስ	-4265
▁ቀድሞ	-4266
▁ፓርክ	-4267
▁ህዝቦች	-4268
▁ሽመልስ	-4269
▁በመገኘት	-4270
▁አክለውም	-4271
▁ጁቬንቱስ	-4272
ቂጤ	-4273
ትነት	-4274
▁መዘ	-4275
▁ማኔ	-4276
▁ሰጪ	-4277
▁ከኢ	-4278
ለማችን	-4279
▁ትንሽ	-4280
▁ዝግጅ	-4281
ገራቸውን	-4282
▁ፌስቡክ	-4283
▁አስኪያጅ	-4284
AH	-4285
ምራ	-4286
ሱስ	-4287
ጦች	-4288
▁ኮሙ	-4289
▁ዘው	-4290
▁የኃ	-4291
ልስፍና	-4292
▁ምረቃ	-4293
▁ሽያጭ	-4294
▁በርን	-4295
▁አለፈ	-4296
▁በፖሊስ	-4297
▁ከቀናት	-4298
▁ድሬዳዋ	-4299
37	-4300
ri	-4301
ህረ	-4302
በስ	-4303
እምሮ	-4304
▁በለ	-4305
▁በሶ	-4306
▁የሐ	-4307
▁ግዴ	-4308
ሟል፡፡	-4309
▁አብሮ	-4310
▁አጋማሽ	-4311
▁ዋስትና	-4312
▁አስተባባሪ	-4313
▁ትምህርታቸውን	-4314
ቆት	-4315
ዋሪ	-4316
ጓዙ	-4317
ሞክራ	-4318
▁ቀጠና	-4319
▁አዛዥ	-4320
▁እየታ	-4321
▁የወሩ	-4322
▁ለሚገኙ	-4323
▁ማክሰኞ	-4324
▁ተገኝተው	-4325
▁አቅርቧል።	-4326
ቦቹ	-4327
ውንት	-4328
▁Ch	-4329
▁የሻ	-4330
▁አውጥ	-4331
▁ዞኖች	-4332
▁የተከ	-4333
▁ይጀም	-4334
▁ግርማ	-4335
▁አስቶን	-4336
▁ዘገባው	-4337
▁የሽብር	-4338
መኑ	-4339
ንዶ	-4340
ዮሽ	-4341
ላለፉ	-4342
በርግ	-4343
ኒየም	-4344
ናችን	-4345
▁80	-4346
ፐብሊክ	-4347
▁ወይዘ	-4348
▁ማስተማር	-4349
ረሰ	-4350
ጲያ	-4351
ከሰት	-4352
ላል፡፡	-4353
በረከት	-4354
ፋቸውን	-4355
▁የጊዜ	-4356
▁ገደብ	-4357
ርቹ	-4358
በን	-4359
ነች	-4360
ው፣	-4361
ውንድ	-4362
▁ልማ	-4363
▁አሻ	-4364
▁ፍፁም	-4365
የትኛውም	-4366
ጎዱ	-4367
ናቀሉ	-4368
▁ጋብ	-4369
መለከቱ	-4370
▁ሳላህ	-4371
▁አልቻ	-4372
▁ዛሬም	-4373
▁የልማት	-4374
▁የኬንያ	-4375
▁ይህንንም	-4376
IK	-4377
ቢቢሲ	-4378
ቲንግ	-4379
ቻለው	-4380
▁ቁር	-4381
▁በሲ	-4382
▁for	-4383
▁መርሀ	-4384
▁ሲባል	-4385
▁ተወዳ	-4386
▁ነጋዴ	-4387
▁የተሳ	-4388
▁ማለትም	-4389
▁ብርሃን	-4390
▁ቴሌኮም	-4391
▁የባንክ	-4392
▁የሆነውን	-4393
▁በተካሄደው	-4394
ሳሽ	-4395
ከባድ	-4396
የውን	-4397
ፋጣኝ	-4398
ላችንን	-4399
▁በመል	-4400
▁ተገድ	-4401
▁ከሜዳ	-4402
▁ዘይት	-4403
▁የከፋ	-4404
▁ይሄን	-4405
▁በአፋር	-4406
▁በመጨረሻ	-4407
▁ሊቀመንበር	-4408
ሎፕ	-4409
ሮው	-4410
ሰመ	-4411
ስክ	-4412
መዋል	-4413
ችበት	-4414
▁32	-4415
▁ማራ	-4416
▁ፈጥ	-4417
▁ሽልማ	-4418
▁አንደ	-4419
▁ደጋፊ	-4420
/2013	-4421
▁ምርቶች	-4422
▁እንዲቆ	-4423
▁ከሀገር	-4424
▁የባህል	-4425
▁ደረጃን	-4426
▁አገልግሎቶች	-4427
ሪፍ	-4428
ርግ	-4429
ኝም	-4430
ኤታ	-4431
ማግሌ	-4432
ጃቸው	-4433
▁በኦ	-4434
▁አቡነ	-4435
▁ይካሄ	-4436
▁ጥገና	-4437
▁ሀይሎች	-4438
▁ሰንጠረ	-4439
▁ኃላፊዎች	-4440
▁ኮሚኒኬሽን	-4441
ምብ	-4442
ጆቹ	-4443
ልበት	-4444
ናቶች	-4445
▁በዲ	-4446
▁ብሄ	-4447
▁አሌ	-4448
▁የጭ	-4449
▁ብቃት	-4450
▁አበበ	-4451
▁እርግ	-4452
▁ግብፅ	-4453
ተሪ	-4454
ዋቱ	-4455
▁K	-4456
ቀመጡ	-4457
▁re	-4458
▁አጠ	-4459
▁የሶ	-4460
ተርኔት	-4461
▁ከባለ	-4462
▁ደረሰ	-4463
▁መዝገብ	-4464
▁ስታንዳ	-4465
▁በሚቀጥ	-4466
▁ተብለው	-4467
▁አላቸው	-4468
ረፈ	-4469
ሮኮ	-4470
ቭስ	-4471
ደታ	-4472
ፋል	-4473
IKV	-4474
ማሪያ	-4475
ምራት	-4476
ያዎች	-4477
▁ሳል	-4478
IKVAH	-4479
thiop	-4480
ዩኒኬሽን	-4481
▁ለህዝብ	-4482
▁ያመለክ	-4483
▁እንደሚሆን	-4484
90	-4485
ሪም	-4486
በጣ	-4487
ube	-4488
ይይቱ	-4489
▁ምባ	-4490
____	-4491
ቻችንን	-4492
▁1-0	-4493
▁ሀብታ	-4494
▁መንስ	-4495
▁ተላል	-4496
▁በቀላሉ	-4497
▁በአካል	-4498
▁ተፈጥሮ	-4499
ሞክራሲያዊ	-4500
ul	-4501
ቀኑ	-4502
▁ተፅ	-4503
▁ውስ	-4504
ንዳንድ	-4505
▁አረጋ	-4506
▁አንቀ	-4507
▁ደሞዝ	-4508
▁ሚኒስቴሩ	-4509
▁ማረጋገጫ	-4510
▁እንደሆኑ	-4511
▁የተገኘው	-4512
▁የተፈጠረ	-4513
▁በዘንድሮው	-4514
ኗን	-4515
ዩም	-4516
ጭበር	-4517
▁አስር	-4518
▁ሀገሪቱ	-4519
▁ሀገራዊ	-4520
▁በስልክ	-4521
▁ነፃነት	-4522
▁የሚያሳ	-4523
▁ለተጨማሪ	-4524
▁አልፏል።	-4525
ሳሰ	-4526
ጀንዳ	-4527
▁45	-4528
▁መልእ	-4529
▁ባሉት	-4530
▁መጠለያ	-4531
▁ፈረንሳይ	-4532
▁አስታወቀ፡፡	-4533
ገመ	-4534
ጥን	-4535
ፋው	-4536
ቀርባ	-4537
ንሰር	-4538
▁በከ	-4539
▁ነፍ	-4540
▁ጌታ	-4541
መዘገበ	-4542
▁አሳል	-4543
▁ድንቅ	-4544
▁ፕሬዜ	-4545
▁አዳራሽ	-4546
▁ጆርናል	-4547
▁ቅርንጫፍ	-4548
▁የደረሰው	-4549
▁የደህንነት	-4550
ut	-4551
ጠይቅ	-4552
▁የሱ	-4553
▁ደራሲ	-4554
▁መንቀጥ	-4555
▁ሲኖዶስ	-4556
▁የእግር	-4557
▁የጀርመን	-4558
▁በሀገራችን	-4559
if	-4560
ስካ	-4561
ድሮስ	-4562
▁85	-4563
▁ምስል	-4564
▁በራሱ	-4565
▁ይፋዊ	-4566
▁ኤርትራ	-4567
▁እንዲሰጥ	-4568
▁የተገለፀ	-4569
▁አሳስበዋል።	-4570
ሊቲ	-4571
ይነ	-4572
all	-4573
ደንብ	-4574
ሷል፡፡	-4575
ናል፡፡	-4576
ከናወኑ	-4577
▁መቐለ	-4578
መዋል፡፡	-4579
▁ተመዝግ	-4580
▁ተከላካይ	-4581
▁ፈተናውን	-4582
ድዋ	-4583
መልካ	-4584
▁ምዘ	-4585
▁ይቀ	-4586
ስርዓት	-4587
▁ጉሙዝ	-4588
▁መፍትሔ	-4589
▁አራተኛ	-4590
▁አውሮፓ	-4591
▁ኦሮሚያ	-4592
▁ትችላላችሁ	-4593
▁የተማሪዎች	-4594
ቢው	-4595
ዩን	-4596
ann	-4597
▁5.	-4598
▁የር	-4599
▁የዞኑ	-4600
▁ለዚህም	-4601
▁በህይወት	-4602
▁ስታንዳርድ	-4603
▁አመልክቷል።	-4604
ሌን	-4605
ሎም	-4606
ወሩ	-4607
ገጥ	-4608
ታወቅ	-4609
ወስድ	-4610
▁የዶ	-4611
ደረሰው	-4612
▁ማንም	-4613
▁ወገን	-4614
▁ኃላፊው	-4615
▁የሩሲያ	-4616
▁የስልክ	-4617
▁ግቦችን	-4618
▁ጨዋታዎችን	-4619
ሀብ	-4620
ማረ	-4621
ከሩ	-4622
ያል	-4623
ያሜ	-4624
ምረት	-4625
ባኖስ	-4626
ወጣት	-4627
ቶቻችን	-4628
▁ልውው	-4629
▁መድኃ	-4630
▁ምድር	-4631
▁ይደረ	-4632
▁ከሚገኙ	-4633
▁አደጋዎች	-4634
▁መገደላቸውን	-4635
▁አሳውቀዋል።	-4636
▁አሽከርካሪዎች	-4637
ራሉ	-4638
ስፈ	-4639
ቿን	-4640
ፍያ	-4641
ith	-4642
▁ብሏል	-4643
▁ነሐሴ	-4644
▁አርሶ	-4645
▁አብር	-4646
▁አማካሪ	-4647
▁የተሰራ	-4648
▁አርጀንቲ	-4649
▁የሚመራው	-4650
ቃይ	-4651
••	-4652
▁ለሕ	-4653
▁ላል	-4654
ጠኝነት	-4655
▁አደረ	-4656
▁ኪንግ	-4657
▁የመድ	-4658
▁ሰራተኛ	-4659
▁የተመሰ	-4660
ርባ	-4661
ሳን	-4662
ድስ	-4663
▁መቃ	-4664
▁እህ	-4665
▁ከፈ	-4666
▁መፅሀ	-4667
▁ተወላ	-4668
▁አስደ	-4669
▁ሃይሎች	-4670
▁ሌሎችም	-4671
▁ማረሚያ	-4672
▁ተጨዋቹ	-4673
▁የሟቾች	-4674
▁ተችሏል።	-4675
▁አስቸጋሪ	-4676
▁በአስቸኳይ	-4677
▁ተፈናቃዮች	-4678
▁እንዳለባቸው	-4679
ራባ	-4680
ቴር	-4681
ጉት	-4682
ጨው	-4683
ቀሳቀ	-4684
ጨምር	-4685
▁St	-4686
▁ለታ	-4687
▁ይባ	-4688
ቀረበው	-4689
ደርጉት	-4690
▁ፀጥታ	-4691
▁መቀመጫ	-4692
▁ቤቶችን	-4693
▁ወላጆች	-4694
▁ለማቅረብ	-4695
▁አልነበረ	-4696
▁የፋይናንስ	-4697
▁እንደገለጹት	-4698
ራው	-4699
ኩን	-4700
የቱ	-4701
በትም	-4702
ወርቅ	-4703
ጠዋል	-4704
▁ወሬ	-4705
▁መለያ	-4706
▁የአው	-4707
▁ፊልም	-4708
▁ሰብሳቢ	-4709
▁ተስፋዬ	-4710
▁አንዳን	-4711
▁አነስተኛ	-4712
-3	-4713
ኑኤል	-4714
ከበረ	-4715
▁እሳ	-4716
▁ካሬ	-4717
ለፍነው	-4718
ፈጸመው	-4719
▁በአብ	-4720
▁ወዲያ	-4721
▁የገቡ	-4722
ንቀሳቀስ	-4723
▁መመለስ	-4724
▁ስብስብ	-4725
▁ተዘጋጅ	-4726
▁ክርስቲያኖ	-4727
ራሪ	-4728
ችግ	-4729
ጅን	-4730
ራል።	-4731
ደርሳ	-4732
ጠየቁ	-4733
▁ሊያስ	-4734
▁በልዩ	-4735
▁በጋዛ	-4736
▁አውቶ	-4737
▁ገለጸ	-4738
▁ፖሊሲ	-4739
▁በሚገኝ	-4740
▁ነጥቦች	-4741
▁ወይዘሮ	-4742
▁ጊዜያት	-4743
▁ተደርጓል	-4744
▁የህወሓት	-4745
▁ይችላል።	-4746
▁የአሜሪካን	-4747
▁እንደሚደረግ	-4748
ኤም	-4749
ፋቸው	-4750
▁''	-4751
▁ለሙሉ	-4752
▁ካለው	-4753
▁ጉባዔ	-4754
▁ግማሽ	-4755
▁2011	-4756
▁ሽማግሌ	-4757
▁በአደጋ	-4758
▁አንዲት	-4759
▁የክለቡ	-4760
▁ግለሰቡ	-4761
▁ፈተናው	-4762
26	-4763
od	-4764
ቶክ	-4765
ድርሻ	-4766
ፈጠር	-4767
▁ቢል	-4768
▁ከዋ	-4769
ቀረቡት	-4770
▁ማየት	-4771
▁ብድር	-4772
▁አሁኑ	-4773
▁የሕግ	-4774
▁የአመቱ	-4775
▁አካባቢው	-4776
▁የተገለጸ	-4777
▁የኢፌዴሪ	-4778
▁ኦርቶዶክስ	-4779
▁ያደረገውን	-4780
ov	-4781
ላሚ	-4782
ቢኔ	-4783
ባሪው	-4784
▁ተበ	-4785
▁ከፋ	-4786
ቃቸውን	-4787
ባቸዋል	-4788
▁ምባፔ	-4789
▁በማሳ	-4790
▁በቀጣ	-4791
▁በንግ	-4792
▁አሸን	-4793
▁የሀገ	-4794
▁የምስ	-4795
▁የዜና	-4796
▁ማሳረፍ	-4797
▁በዘላቂ	-4798
▁የሌለው	-4799
▁የመውጫ	-4800
▁የተጠረ	-4801
▁እንዲወጡ	-4802
▁አረጋግጠዋል።	-4803
ሀል	-4804
ቡት	-4805
ናዳ	-4806
ቱንም	-4807
▁ማእ	-4808
▁ጳጳ	-4809
▁መገለ	-4810
▁የብር	-4811
▁ጎሎች	-4812
▁ማቅረብ	-4813
▁ቅድሚያ	-4814
▁የሚገቡ	-4815
▁በትናንት	-4816
▁ኢንስቲትዩት	-4817
ew	-4818
um	-4819
ስና	-4820
ተዉ	-4821
ፁዕ	-4822
ወሰን	-4823
▁ረዳ	-4824
▁እያሉ	-4825
▁የመል	-4826
▁የማዕ	-4827
▁ሚካኤል	-4828
▁በመጪው	-4829
▁የሚሰሩ	-4830
▁ቴሌግራም	-4831
▁ኤቨርተን	-4832
▁የኢትዮጵያን	-4833
ሌዳ	-4834
ረጥ	-4835
ገም	-4836
ጌታ	-4837
our	-4838
ላቸዉ	-4839
▁33	-4840
▁ሰማ	-4841
▁ተር	-4842
ዎቻቸው	-4843
▁ሚኬል	-4844
▁ቀርቦ	-4845
▁ቢሮው	-4846
▁ተመስ	-4847
▁የማያ	-4848
▁መጫወት	-4849
▁ዌስትሀም	-4850
▁የጠቅላይ	-4851
▁ደንበኞች	-4852
07	-4853
48	-4854
ሮቢ	-4855
ቦር	-4856
red	-4857
ቀዋል	-4858
ጠይቃ	-4859
